{"comment_3": "I love @LanaWWE Instagram profile because A. She's beautiful and B. It's always 1982 Fayetteville NC levels of kayfabe in her comments.", "article": "Need help? Contact the CQ Hotline at (800) 678-8511 or hotline@cqrollcall.com", "comment_2": "Feds take comments on $5 billion natural gas pipeline: FAYETTEVILLE, N.C. — Supporters of a proposed $5 billion… http://t.co/KfCPQXYSdu", "comment_1": "I been writing alot lately, but this Poem is a piece I'm working on for a event honoring DOMESTIC VIOLENCE. It will… https://t.co/G6zrzoqwqV", "split": "test", "label": "real"}
{"comment_3": "US Real Gross Domestic Product. Percent change from preceding period is in secular decline (via @GNietoNieto) https://t.co/2PE4auf4Bp", "article": "21.27 KB View/Download File\n\nWhy the extra step? This page can be bookmarked, the file cannot.", "comment_2": "I wondered: How many times has GDP growth been over 3.3% in past 30 years?  \n\nSource: Percent Change From Preceding… https://t.co/ruwzO7PYkn", "comment_1": "#US Real Gross Domestic Product: Percent change from preceding period is in secular decline ht @alvaro_ims @IEF_org… https://t.co/CweAQahLxm", "split": "test", "label": "real"}
{"comment_3": "CBO Report: The Long-Term Budgetary Impact of Paths for Federal Revenues and Spending Specified by Chairman Ryan http://t.co/nR5HLD3e March", "article": "Mitt Romney’s pick of U.S. Rep. Paul Ryan as his running mate has rekindled a heated debate over Medicare.\n\n\n\nRyan, R-Wis., is the head of the Budget Committee in the U.S. House of Representatives and the architect of a plan to dramatically restructure Medicare.\n\n\n\nToday, Medicare operates as a government-run health insurance plan for Americans over age 65.\n\n\n\nRyan’s idea is to eventually move Medicare toward private insurance companies by giving people a set amount to buy their own health insurance plans. The new system would be for people who are under age 55 now, and it would give them voucher-like credits to buy traditional fee-for-service Medicare or competing private insurance plans. (The credits are sometimes called \"premium support.\")\n\n\n\nThough House Republicans voted overwhelmingly for Ryan’s plan, polling shows public opinion is mixed, with older voters the most wary of the plan.\n\n\n\nThe Republican response to attacks on the Ryan plan has been to attack back, saying President Barack Obama has cut \"$7", "comment_2": "The Long-Term Budgetary Impact of Paths for Federal Revenues and Spending Specified by Chairman Ryan http://t.co/XKG8Szci - say no to Ryan!", "comment_1": "The Long-Term Budgetary Impact of Paths for Federal Revenues and Spending Specified by Chairman Ryan:  http://t.co/kRsezNse", "split": "test", "label": "real"}
{"comment_3": "Maybe Romney has already reviewed Trump's OGE Public Financial Disclosure Report and wants to see if 1040 jives #GOP2016", "article": "Need help? Contact the CQ Hotline at (800) 678-8511 or hotline@cqrollcall.com", "comment_2": "#Ohio Ethics Commission provides online financial disclosure filing for public officials/employees req'd to report. http://t.co/aZxR9pozKK", "comment_1": "Carly Fiorina’s Financial Disclosure Statement: Public Financial Disclosure Report as of… https://t.co/DONkOpG60X https://t.co/RDVidBMvY8", "split": "test", "label": "real"}
{"comment_3": "Transcript of Second McCain, Obama Debate: NASHVILLE, Tennessee (CNN) -- Presidential candidates John McCai.. http://tinyurl.com/4wx9vp", "article": "NASHVILLE, Tennessee (CNN) -- Presidential candidates John McCain and Barack Obama debated in Nashville, Tennessee, on Tuesday night. NBC's Tom Brokaw moderated the debate. Here is a transcript of that debate.\n\nSen. Barack Obama and Sen. John McCain meet in Nashville for their second debate.\n\nBrokaw: Good evening from Belmont University in Nashville, Tennessee. I'm Tom Brokaw of NBC News. And welcome to this second presidential debate, sponsored by the Commission on Presidential Debates.\n\nTonight's debate is the only one with a town hall format. The Gallup Organization chose 80 uncommitted voters from the Nashville area to be here with us tonight. And earlier today, each of them gave me a copy of their question for the candidates.\n\nFrom all of these questions -- and from tens of thousands submitted online -- I have selected a long list of excellent questions on domestic and foreign policy.\n\nNeither the commission nor the candidates have seen the questions. And although we won't be able to get to all of them t", "comment_2": "Transcript of second McCain, Obama debate: NASHVILLE, Tennessee (CNN) -- Presidential candidates Joh.. http://tinyurl.com/3totxg", "comment_1": "Transcript of second McCain, Obama debate: NASHVILLE, Tennessee (CNN) -- Presidential candidates John M.. http://twurl.nl/k1zvp1", "split": "test", "label": "real"}
{"comment_3": "Read the full transcript of Obama’s fiery anti-Trump speech https://t.co/HzAlyptf8E via @voxdotcom", "article": "And, tonight, I also want to thank the men and woman who took this journey with me as fellow candidates for president.\n\nAt this defining moment, at this defining moment for our nation, we should be proud that our party put forth one of the most talented, qualified field of individuals ever to run for office.\n\nI have not just competed with them as rivals. I've learned from them as friends, as public servants, and as patriots who love America and are willing to work tirelessly to make this country better. They are leaders of this party and leaders that America will turn to for years to come.\n\nAnd that is particularly true for the candidate who has traveled further on this journey than anyone else. Senator Hillary Clinton has made history in this campaign.\n\n(APPLAUSE)\n\nShe has made history not just because she's a woman who has done what no woman has done before, but because she is a leader who inspires millions of Americans with her strength, her courage, and her commitment to the causes that brought us here to", "comment_2": "Read the Transcript of Obama’s Speech Defending Democracy The former president offered an impassioned defense of in… https://t.co/jRlJYmvShQ", "comment_1": "Read the Transcript of Obama’s Speech Defending Democracy https://t.co/RugqT9hOef", "split": "test", "label": "real"}
{"comment_3": "@StormIsUponUs\" chairman of Dar al-Hijrah favor from the Office of the White House - photo taken of Estwani with pr… https://t.co/vfRqMnvqdg", "article": "Washington, DC - U.S. Senators Charles E. Schumer and Hillary Rodham Clinton today announced that the full Senate Appropriations Committee has approved the Labor, Health and Human Services and Education FY08 Appropriations Bill which includes $1,000,000 for Bethel Performing Arts and $300,000 for SUNY New Paltz. The bill will now proceed to the Senate Floor as the next step in the appropriations process. Schumer and Clinton worked closely with members of the Appropriations Committee to include funding for the project in this year’s spending bill.\n\n“This is great news for the Hudson Valley,” said Schumer. “These projects are designed to strengthen various aspects of the community from encouraging the arts to creating stronger and more specialized academic programs for our students. I will work hard to continue to secure funding for these critical programs.”\n\n“These are welcome investments for the Hudson Valley,” said Senator Clinton. “These funds will help the for the Bethel Woods Center for the Arts continue ", "comment_2": "@AltUSPressSec @RebeccaSWH Everything #TraitorTrump did as POTUS is nullified! HRC and Sen. Kaine are sworn in as t… https://t.co/uw3xSZah1B", "comment_1": "@ABC @TheView Sen Gillibrand forgets her favorite Bill @presbillclinton accused of rape, sexapades in the oval offi… https://t.co/UmJB5recg5", "split": "test", "label": "real"}
{"comment_3": "Bakken Housing News Barack Obama says U.S. oil production last year was highest since 2003 - http://t.co/3mJFNpUV5p", "article": "In his press conference on March 11, 2011, President Barack Obama talked up U.S. oil production against a backdrop of rising prices at the pump.\n\n\n\n\"We need to continue to boost domestic production of oil and gas,\" he said. \"Last year, American oil production reached its highest level since 2003. Let me repeat that. Our oil production reached its highest level in seven years. Oil production from federal waters in the Gulf of Mexico reached an all-time high. For the first time in more than a decade, imports accounted for less than half of what we consumed. So any notion that my administration has shut down oil production might make for a good political sound bite, but it doesn’t match up with reality,\"\n\n\n\nIn this item, we’ll check the first piece of evidence to support his contention that his administration hasn’t \"shut down\" oil production -- that \"last year, American oil production reached its highest level since 2003.\"\n\n\n\nWe turned to the Energy Information Administration, the federal government’s official ", "comment_2": "Barack Obama says U.S. oil production last year was highest since 2003 http://t.co/Cs85o5R", "comment_1": "PolitiFact | Barack Obama says U.S. oil production last year was highest since 2003 http://t.co/bLfi9ie via @politifact", "split": "test", "label": "real"}
{"comment_3": "Listen to John McCain’s acceptance speech when he received his honor the other day. (If you haven’t heard it, check it out on YouTube.)", "article": "John McCain's Acceptance Speech\n\n\n\n\n\nBy John McCain\n\nSeptember 5, 2008 Thank you all very much. Tonight, I have a privilege given few Americans -- the privilege of accepting our party's nomination for President of the United States. And I accept it with gratitude, humility and confidence.\n\n\n\nIn my life, no success has come without a good fight, and this nomination wasn't any different. That's a tribute to the candidates who opposed me and their supporters. They're leaders of great ability, who love our country, and wished to lead it to better days. Their support is an honor I won't forget.\n\n\n\nI'm grateful to the President for leading us in those dark days following the worst attack on American soil in our history, and keeping us safe from another attack many thought was inevitable; and to the First Lady, Laura Bush, a model of grace and kindness in public and in private. And I'm grateful to the 41st President and his bride of 63 years, and for their outstanding example of honorable service to our country.\n\n\n\n", "comment_2": "@realDonaldTrump  your speech had 10 million less viewers  than John McCain's acceptance speech ... #YouAintAllThat", "comment_1": "John McCain Slams 'Half-Baked, Spurious Nationalism' in Liberty Medal Acceptance Speech Please get well. So true https://t.co/dcpHmokmFD", "split": "test", "label": "real"}
{"comment_3": "1997, Obama Urges Bernanke, Paulson to Fight Foreclosures, Hold Homeownership Summit,http://tinyurl.com/3zpqwy", "article": "Obama Urges Bernanke, Paulson to Fight Foreclosures, Hold Homeownership Summit\n\nThursday, March 22, 2007\n\nFOR IMMEDIATE RELEASE\n\nContact: Ben LaBolt\n\nWASHINGTON, DC -- U.S. Senator Barack Obama today sent a letter to Federal Reserve Chairman Bernanke and Treasury Secretary Paulson urging them to immediately convene a homeownership preservation summit with key stakeholders to fight foreclosures driven by growth in the subprime mortgage market.\n\nThe text of the letter is below:\n\nDear Chairman Bernanke and Secretary Paulson,\n\nThere is grave concern in low-income communities about a potential coming wave of foreclosures. Because regulators are partly responsible for creating the environment that is leading to rising rates of home foreclosure in the subprime mortgage market, I urge you immediately to convene a homeownership preservation summit with leading mortgage lenders, investors, loan servicing organizations, consumer advocates, federal regulators and housing-related agencies to assess options for private sec", "comment_2": "1997, Obama Urges Bernanke, Paulson to Fight Foreclosures, Hold Homeownership Summit,http://tinyurl.com/3zpqwy", "comment_1": "March 22, 2007 Obama Urges Bernanke, Paulson to Fight Foreclosures, Hold Homeownership Summit http://is.gd/3Dtg he gets it!", "split": "test", "label": "real"}
{"comment_3": "A comprehensive investigation of voter impersonation finds 31 credible incidents out of one billion ballots cast http://t.co/OsjjmEQojU", "article": "\n\nA Madison, Miss., precinct worker offers a voter a \"I voted\" sticker after voting in party primaries on Tuesday, June 3, 2014. Mississippi's new voter ID law was put to its first test in Tuesday’s primaries. (AP Photo/Rogelio V. Solis)\n\nNote: This is a guest post by Justin Levitt, a professor at the Loyola Law School, Los Angeles and an expert in constitutional law and the law of democracy, with a particular focus on election administration and redistricting.\n\nVoter ID laws are back in the news once again, with two new opinions from the Wisconsin Supreme Court late last week dealing with the state's ID requirement, which would allow people to vote only if they provide certain forms of government-issued ID. The Court made some minor changes to the law but otherwise upheld it. However, the ID requirement is still on hold pending a federal lawsuit.\n\nPart of this litigation — and any rational debate about the issue generally — hinges on two things: costs and benefits. The costs of these sorts of laws vary, beca", "comment_2": "A comprehensive investigation of voter impersonation finds 31 credible incidents out of one billion ballots cast http://t.co/abCMycrjHu", "comment_1": "A comprehensive investigation of voter impersonation finds 31 credible incidents out of one billion ballots cast https://t.co/U0rh75OPDf", "split": "test", "label": "real"}
{"comment_3": "Good news everyone! There was enough public comment towards the Alaska state legislature to keep the Alaska Performance Scholarship!", "article": "Streaming Committee Meetings\n\nCurrently, the Capitol is equipped to stream committee meetings from all of the standing committee rooms. Certain special events may be streamed from locations inside and outside the Capital. This service exists to provide Alaskans with live access to every committee meeting in the State Capital.\n\nFloor Session streams are available through Gavel Alaska.\n\nFor Archived Meetings, visit the Committees tab or visit Gavel Alaska's Archive. Meetings streamed outside of Juneau are archived to our Vimeo site.", "comment_2": "Alaska Legislature House Passes LNG Trucking Bill: The Alaska state legislature has passed a bill authorizing ... http://t.co/dHeHMH5v8y", "comment_1": "Alaska Business Report Card Ranks 29th State Legislature https://t.co/4DcoConoK3 via @YourAKLink", "split": "test", "label": "real"}
{"comment_3": "NY Times: \"For Education Chief, Stimulus Means Power, Money and Risk\" -- http://is.gd/jPhA", "article": "Expectations are running so high, and the appetite for information is so large among the nation’s educators, that when Mr. Duncan organized a conference call last Wednesday to begin explaining the stimulus bill’s terms to a few dozen state and district superintendents, 800 callers swamped the switchboard.\n\nMost of Mr. Duncan’s unusual power would come in disbursing a $54 billion stabilization fund intended to prevent public sector layoffs, mostly in schools. The bill sets aside $5 billion of that to reward states, districts and schools for setting high standards and narrowing achievement gaps between poor and affluent students. The law lets Mr. Duncan decide which states deserve awards and which programs merit special financing.\n\n“It’s hard to imagine moving that much money that quickly,” said Margaret Spellings, Mr. Duncan’s predecessor, who turned her seventh-floor office over to him last month. “The point is, it’s never been done before, and as much confidence as I have in Arne Duncan, there’s an awesome o", "comment_2": "For Education Chief, Stimulus Means Power, Money and Risk, from NY Times: http://idek.net/2_m", "comment_1": "NEWS: Big Stories Of The Day: For Education Chief, Stimulus Means Power, Money and Risk NYT Arne Duncan must dec.. http://tinyurl.com/cjusns", "split": "test", "label": "real"}
{"comment_3": "RT @GOPLeader: As Dems’ “Stimulus” Anniversary Nears, Americans Ask: “Where are the Jobs?” http://bit.ly/d3b8rk", "article": "As Dems’ “Stimulus” Anniversary Nears, Americans Ask: “Where are the Jobs?”\n\nWashington, Feb 12 - As the one year anniversary of the Democrats’ trillion-dollar “stimulus” spending program approaches next Wednesday, it’s fitting to compare the results of the “stimulus” to the rhetoric that the President and Democratic leaders used to sell their spending plan - and see how their promises match up with reality.\n\n\n\nWhen Democrats rushed their massive 1,100 page, “stimulus” through Congress last year, they promised that unemployment would not rise above eight percent and that job creation would begin “almost immediately”. But nearly one year later, more than three million more Americans have lost their jobs, the deficit is set to hit a record shattering $1.6 trillion, and Administration reports on how many jobs were “saved or created” have been “riddled with inaccuracies and contradictions,” noted USA Today.\n\n\n\nBy the metrics the Democrats themselves set, the “stimulus” hasn’t worked – it’s chock-full of wasteful ", "comment_2": "RT @boblatta: RT @GOPLeader: As Dems’“Stimulus” Anniversary Nears, Americans Ask: “Where are the Jobs?” http://bit.ly/d3b8rk #tcot #fb", "comment_1": "RT @GOPLeader: As Dems’ “Stimulus” Anniversary Nears, Americans Ask: “Where are the Jobs?” http://bit.ly/d3b8rk", "split": "test", "label": "real"}
{"comment_3": "Stop coddling the super-rich: Buffett http://t.co/1wl9JPJC via @globeandmail", "article": "To understand why, you need to examine the sources of government revenue. Last year about 80 percent of these revenues came from personal income taxes and payroll taxes. The mega-rich pay income taxes at a rate of 15 percent on most of their earnings but pay practically nothing in payroll taxes. It’s a different story for the middle class: typically, they fall into the 15 percent and 25 percent income tax brackets, and then are hit with heavy payroll taxes to boot.\n\nBack in the 1980s and 1990s, tax rates for the rich were far higher, and my percentage rate was in the middle of the pack. According to a theory I sometimes hear, I should have thrown a fit and refused to invest because of the elevated tax rates on capital gains and dividends.\n\nPhoto\n\nI didn’t refuse, nor did others. I have worked with investors for 60 years and I have yet to see anyone — not even when capital gains rates were 39.9 percent in 1976-77 — shy away from a sensible investment because of the tax rate on the potential gain. People invest", "comment_2": "NYT/W.#Buffett: Stop Coddling the #SuperRich - Read his lips! - http://t.co/yDjyErodeB #taxes #income #rich #wealth #inequality #middleclass", "comment_1": "Stop Coddling the Super-Rich, from #warrenbuffett http://t.co/X87Yppf", "split": "test", "label": "real"}
{"comment_3": "@marcorubio @wsjopinion\n\nLetters: Wrong - Social Security is NOT your money!  It belongs to the government. You hav… https://t.co/yvJcdwzvxs", "article": "Supreme Court Case: Flemming vs. Nestor\n\nBackground to the Case:\n\n\n\nThe fact that workers contribute to the Social Security program's funding through a dedicated payroll tax establishes a unique connection between those tax payments and future benefits. More so than general federal income taxes can be said to establish \"rights\" to certain government services. This is often expressed in the idea that Social Security benefits are \"an earned right.\" This is true enough in a moral and political sense. But like all federal entitlement programs, Congress can change the rules regarding eligibility--and it has done so many times over the years. The rules can be made more generous, or they can be made more restrictive. Benefits which are granted at one time can be withdrawn, as for example with student benefits, which were substantially scaled-back in the 1983 Amendments.\n\n\n\nThere has been a temptation throughout the program's history for some people to suppose that their FICA payroll taxes entitle them to a benefit i", "comment_2": "@ChrisWarcraft According to Supreme Court case of Flemming v. Nestor (1960) the fact that you have paid into Social… https://t.co/bDb0GostZV", "comment_1": "1960 U.S. Supreme Court case of Flemming v. Nestor, which held that Americans have no right to receive Social Security benefits, #tcot #p2", "split": "test", "label": "real"}
{"comment_3": "Wisconsin state Sen. Alberta Darling says unions in the private sector bargain “for the most part” only on wages http://t.co/PoYcTEJ", "article": "MR. DAVID GREGORY: This Sunday, revolution in the Middle East and the showdown at home over red ink in Washington and in states like Wisconsin . Mounting leadership tests for President Obama as the battle lines of the 2012 campaign come into sharper view. This morning, how will the standoff in Wisconsin end? And is the fight there with the unions about ideology or shared sacrifice?\n\nGOV. SCOTT WALKER (R-WI): It's not just about the budget now and into the future . It's not just about jobs or workers. This is ultimately about the future of our state .\n\nMR. GREGORY: My guest, the man at the center of the storm , embattled Republican Governor Scott Walker . Also, the future of the Middle East remains in doubt as Libya 's brutal dictator cracks down on protesters.\n\nPRES. BARACK OBAMA: His actions violate international norms and every standard of common decency. This violence must stop.\n\nMR. GREGORY: What's next ? And has the administration done enough? Joining me this morning from the site of such unrest earlier ", "comment_2": "Wisconsin state Sen. Alberta Darling says unions in the private sector bargain “for the most part” only on wages http://t.co/PmCShAJ", "comment_1": "Wisconsin state Sen. Alberta Darling says unions in the private sector bargain “for the most part” only on wages http://t.co/eEGkqDK", "split": "test", "label": "real"}
{"comment_3": "Sanford and Sins - FOXNews Washington PostSanford and SinsFOXNewsAP This is a rush transcript from \"On the Record,\" Jun.. http://is.gd/1cWnB", "article": "This is a rush transcript from \"On the Record,\" June 24, 2009. This copy may not be in its final form and may be updated.\n\nGRETA VAN SUSTEREN, FOX NEWS HOST: Forty Republican members of Congress are furious at ABC News. They say ABC News is unprofessional and violating the ethics of journalism and slanting the news for President Obama. ABC News has been given all access to the White House, and in a primetime special on ABC News, President Obama will talk about his health care plan. Any problem with that? A group called the Media Fairness Caucus says yes and wrote a letter to ABC News slamming the network.\n\nCongressman Lamar Smith heads the Media Fairness Caucus. He was supposed to be with us live but is busy voting, but he does join us by phone. Congressman, nice to at least hear from you. Tell me, Congressman, what's wrong with this?\n\nREP. LAMAR SMITH - R - TEXAS (VIA TELEPHONE): Very good to be with you. Well, what's wrong with this is, as you just mentioned, ABC devoted all their newscasts today, morning, ", "comment_2": "Will 'I'm not a bully' haunt Gov. Chris Christie? -  This is a rush transcript from \"On the Record,\" January 9,... http://t.co/1c3IbksG50", "comment_1": "Obama-Friendly Court for Virginia's Health Care Reform Challenge?: This is a rush transcript from \"On the Record... http://bit.ly/kgBzLs", "split": "test", "label": "real"}
{"comment_3": "PolitiFact | Mitt Romney says there are “25 million Americans out of work” - http://t.co/ltkb0okCpx @WalkerBragman", "article": "\n\n\n\nReturn to Transcripts main page\n\nCNN LIVE EVENT/SPECIAL\n\nNevada Caucuses Coverage - 2200 Hour; Romney Wins Nevada; Rick Santorum Interviwewed; Mitt Romney's Remarks\n\nAired February 4, 2012 - 22:00 ET\n\nTHIS IS A RUSH TRANSCRIPT. THIS COPY MAY NOT BE IN ITS FINAL FORM AND MAY BE UPDATED.\n\n\n\nWOLF BLITZER, CNN ANCHOR: CNN projects Mitt Romney the winner, the winner of the Nevada caucuses. CNN projects that the former Massachusetts governor has a decisive win in the caucuses in Nevada. Mitt Romney going ahead, capitalizing on his dramatic win in Florida, now capturing Nevada as well.\n\n\n\nWe do not -- we do not yet know who's going to come in second, who's going to come in third. But there is a dramatic -- a dramatic race under way for second and third place. But now you can see Romney headquarters in Las Vegas. The crowd hearing the news that Mitt Romney has won the Nevada caucuses. Very, very excited.\n\n\n\nJim Acosta is our man over at Mitt Romney headquarters in Las Vegas.\n\n\n\nJim, the crowd pretty excited there", "comment_2": "PolitiFact | Lying Mitt - It's 13 not 25! Mitt Romney says there are “25 million Americans out of work” http://t.co/c1RgN0fn via @politifact", "comment_1": "Mitt Romney asked about his tax returns says, \"President Obama played 90 rounds of golf while 25 million Americans are out of work.\"", "split": "test", "label": "real"}
{"comment_3": "PolitiFact | Barack Obama says U.S. oil production last year was highest since 2003 http://t.co/rDXwIYB via @politifact", "article": "In his press conference on March 11, 2011, President Barack Obama talked up U.S. oil production against a backdrop of rising prices at the pump.\n\n\n\n\"We need to continue to boost domestic production of oil and gas,\" he said. \"Last year, American oil production reached its highest level since 2003. Let me repeat that. Our oil production reached its highest level in seven years. Oil production from federal waters in the Gulf of Mexico reached an all-time high. For the first time in more than a decade, imports accounted for less than half of what we consumed. So any notion that my administration has shut down oil production might make for a good political sound bite, but it doesn’t match up with reality,\"\n\n\n\nIn this item, we’ll check the first piece of evidence to support his contention that his administration hasn’t \"shut down\" oil production -- that \"last year, American oil production reached its highest level since 2003.\"\n\n\n\nWe turned to the Energy Information Administration, the federal government’s official ", "comment_2": "Bakken Housing News Barack Obama says U.S. oil production last year was highest since 2003 - http://t.co/3mJFNpUV5p", "comment_1": "PolitiFact | Barack Obama says U.S. oil production last year was highest since 2003 http://t.co/Zsa0ILN via @politifact", "split": "test", "label": "real"}
{"comment_3": "During his twelve years in office, President Franklin D. #Roosevelt appointed eight new members of the Supreme Cour… https://t.co/6pn5SscMeO", "article": "Chief Justices\n\nAssociate Justices\n\nNotes: The acceptance of the appointment and commission by the appointee, as evidenced by the taking of the prescribed oaths, is here implied; otherwise the individual is not carried on this list of the Members of the Court. Examples: Robert Hanson Harrison is not carried, as a letter from President Washington of February 9, 1790 states Harrison declined to serve. Neither is Edwin M. Stanton who died before he could take the necessary steps toward becoming a Member of the Court. Chief Justice Rutledge is included because he took his oaths, presided over the August Term of 1795, and his name appears on two opinions of the Court for that Term.\n\nThe date a Member of the Court took his/her Judicial oath (the Judiciary Act provided “That the Justices of the Supreme Court, and the district judges, before they proceed to execute the duties of their respective offices, shall take the following oath . . . ”) is here used as the date of the beginning of his/her service, for until tha", "comment_2": "@BarbMcQuade \n\nBarbara - Can the Supreme Court expunge one of its own members or would they refer this to the presi… https://t.co/6DSyXrJBYp", "comment_1": "@thehill And the third thing you know for sure is that Justice Kavanaugh’s expression of deep-seated dislike and il… https://t.co/LCt38FzA7C", "split": "val", "label": "real"}
{"comment_3": "@Being_and_Tom @WriteSmitty @fr_faulkner \"I think we have a lot of  foes,\" Trump told CBS News in an interview segm… https://t.co/ooiBq7zchr", "article": "The territorial gains of the Islamic State of Iraq and Syria (ISIS) in the Middle East over the past week have prompted a fresh look at what the U.S. can do to stop the militant group. But lawmakers are still divided about whether a military or political strategy provides the best shot at success.\n\nISIS on the move after capturing key cities in Iraq, Syria\n\n\"We need to have a more robust strategy. We need more troops on the ground, we need forward air controllers - we're just referring to air strikes,\" said Senate Armed Services Committee Chairman John McCain, R-Arizona, on CBS' \"Face the Nation\" Sunday. \"We found in Vietnam War that if you don't have the right strategy, airpower is minimal in its effect, but we need to have forward air controllers, we need to have special forces, we need to have more of those kind of raids that were so successful into Syria. We need to have a strategy. There is no strategy. And anyone that says that there is, I'd like to hear what it is because it certainly isn't apparent no", "comment_2": "National News: Trump: Clinton guilty of \"stupidity\" on email server: In a \"Face the Nation\" interview, t... https://t.co/omK0VkeiQj #cbs", "comment_1": "ICYMI: CBS Face the Nation / #DODGERS Vin Scully  interview / Hall of Fame Broadcaster / November 27 2016 💙⚾️🎙 https://t.co/XZI5fUHKo1", "split": "val", "label": "real"}
{"comment_3": "For recent graduates, this summer is a big push to save up cash for their first year of college. Follow our tips:  http://t.co/HWOpybyUAO", "article": "Immigration reform was a major component of President Barack Obama's campaign platform. He promised to secure the border, crack down on employers who hire undocumented immigrants, and provide a path to citizenship for undocumented immigrants.\n\n\n\nWhile watching ABC's This Week as part of our fact-checking partnership with the show, we learned of a promise that we hadn't heard before. During the campaign, then-candidate Obama was interviewed by Univision's Jorge Ramos, a prominent voice within the Latin American community. During that interview, Obama said he would pursue immigration reform aggressively. \"I cannot guarantee that it is going to be in the first 100 days,\" Obama said. \"But what I can guarantee is that we will have in the first year an immigration bill that I strongly support and that I'm promoting. And I want to move that forward as quickly as possible.\"\n\n\n\nWe checked our database of promises, and found that that while we did have promises from Obama on immigration reform, we missed this one with ", "comment_2": "This is the sixth year for Big Orange Give, a 24-hour fundraising push by the Office of Alumni Affairs, but the fir… https://t.co/aLc0VPlhR1", "comment_1": "@jimmyknight1 no mate, he will come good. \nI have faith in him, we wot win a lot first year, but next we will make a big push", "split": "val", "label": "real"}
{"comment_3": "Knowledge is power -- and also money: By Ezra Klein In his column today, Paul Krugman argues that \"the root of o... http://bit.ly/ghaxpt", "article": "By the way, Heritage is always like this. Whenever there’s something the G.O.P. doesn’t like — say, environmental protection — Heritage can be counted on to produce a report, based on no economic model anyone else recognizes, claiming that this policy would cause huge job losses. Correspondingly, whenever there’s something Republicans want, like tax cuts for the wealthy or for corporations, Heritage can be counted on to claim that this policy would yield immense economic benefits.\n\nPhoto\n\nThe point is that the two parties don’t just live in different moral universes, they also live in different intellectual universes, with Republicans in particular having a stable of supposed experts who reliably endorse whatever they propose.\n\nSo when pundits call on the parties to sit down together and talk, the obvious question is, what are they supposed to talk about? Where’s the common ground?\n\nEventually, of course, America must choose between these differing visions. And we have a way of doing that. It’s called democra", "comment_2": "Another embarrassing old column by @paulkrugman on what would happen if Trump axed NAFTA:  “Plants would close, job… https://t.co/JA50UQoUmI", "comment_1": "Democracy in Poland, Alive and Well. Poland’s ambassador objects to a column by Paul Krugman that argued “democracy… https://t.co/jakYPJhu2d", "split": "val", "label": "real"}
{"comment_3": "Democratic debate: Bernie Sanders really isn't as \"socialist\" as President Eisenhower https://t.co/8Uk0aPd4Gc via @cbsnews", "article": "Vermont Sen. Bernie Sanders earned laughter and applause during Saturday's Democratic debate for a line defending his progressive tax policy.\n\nWhen asked how he would pay for proposals like tuition-free college for Americans, Sanders said he would finance them by \"due-demanding: that the wealthiest people and the largest corporations - have gotten away with murder for years - start paying their fair share.\"\n\nCBS News Congressional Correspondent Nancy Cordes pressed the White House hopeful: \"Let's get specific. How high would you go? You've said before you'd go above 50 percent. How high?\"\n\n\"We haven't come up with an exact number yet,\" Sanders responded. \"But it will not be as high as the number under Dwight D. Eisenhower which was 90 percent.\"\n\nBernie Sanders on universal healthcare, taxing the rich and taking on Clinton\n\nAs an aside, he said, to loud cheers in the audience: \"I'm not that much of a socialist compared to Eisenhower.\"\n\nSanders went on to say that his administration would \"end the absurdities a", "comment_2": "Democratic debate: Bernie Sanders really isn't as \"socialist\" as President Eisenhower https://t.co/NYov3simfq via @cbsnews", "comment_1": "Democratic debate: Bernie Sanders really isn't as \"socialist\" as President Eisenhower https://t.co/to5Mmxm4iY", "split": "val", "label": "real"}
{"comment_3": "The CEO Plan to Steal Your Social Security &amp; Medicare by Dean Baker, co-director  Center for Economic &amp; Policy Research http://t.co/WqL9I9pc", "article": "AMANPOUR: Madam Speaker, thank you so much for joining me.\n\nPELOSI: My pleasure.\n\nAMANPOUR: Can I ask you about some of the important news that's been made this week, particularly in -- in the House and that would be on Afghanistan.\n\nLast year, 32 Democrats voted against the funding of the war in Afghanistan. This year, 102 Democrats voted against. That seems to be a dramatic rejection from the president's own party of his major strategic goal.\n\nPELOSI: Well, not quite. You have to put the votes in perspective.\n\nOur president came in. He was president maybe two months, three months, by the time we took the vote last year. And the Republicans said they weren't going to vote for the funding. And so it took all Democratic votes.\n\nI persuaded my members to give this president a chance, to give him room in order to have time to implement his plan. And in -- and in the course of time -- now the Republicans said they would vote for it, it gave my members the freedom to express themselves on the war in Afghanistan.\n\n", "comment_2": "Dean Baker, Co-Director at the Center for Economic Policy and Research (CEPR), will join NLIHC staff in presenting Out of Reach 2010 data!", "comment_1": "#CCTV: Mark Weisbrot, research co-director, Center for Economic Policy http://t.co/IXOdxeXkpI", "split": "val", "label": "real"}
{"comment_3": "@CNNOpinion @CNN @Crossfire @CNN @Newsweek @cnnbrk  Christian Pastor MLK's comments to overcome homosexual habits http://t.co/xaQSDneNmx", "article": "\n\n\n\nReturn to Transcripts main page\n\nCROSSFIRE\n\nShould U.S. Trust Russia on Syria?\n\nAired September 10, 2013 - 18:28 ET\n\nTHIS IS A RUSH TRANSCRIPT. THIS COPY MAY NOT BE IN ITS FINAL FORM AND MAY BE UPDATED.\n\n\n\nANNOUNCER: Tonight on CROSSFIRE, as President Obama prepares to address the nation, he hits the pause button on attacking Syria. Should he follow Russia's lead or keep threatening a military strike?\n\n\n\nJOHN KERRY, SECRETARY OF STATE: Nothing focuses the mind like the prospect of a hanging.\n\n\n\nANNOUNCER: On the left, Van Jones. On the right, S.E. Cupp. In the CROSSFIRE, Joe Lieberman, who supports the strike on Syria, and Rick Santorum, who's opposed. Is Russia's diplomacy real? Or should the U.S. strike Assad now? Tonight on CROSSFIRE.\n\n\n\nVAN JONES, CO-HOST: Welcome to CROSSFIRE. I'm Van Jones on the left.\n\n\n\nS.E. CUPP, CO-HOST: I'm S.E. Cupp on the right.\n\n\n\nTonight, the world is giddy at the prospect of getting out of a U.S. military strike on Syria. It's all thanks to Russia's offer of a diplomatic s", "comment_2": "Mom Of Murdered Teen Blasts @CNN Conservative S.E. Cupp’s Gun Comments http://t.co/yD69dwzUL1  #crossfire #uniteblue", "comment_1": "CNN’s Van Jones: Obama’s Latest Comments on Race ‘Honest and Accurate’: What did CNN's Crossfire host Van Jones think when he read Pr...", "split": "val", "label": "real"}
{"comment_3": "Body of Missing New Jersey Teenager Sarah Townsend Found in Pond - FoxNews.com : http://fxn.ws/lceDqB", "article": "A Connecticut teen-ager who was missing for six days after she took a train to New York City was reunited with her family early yesterday after the police found her at a New Jersey home where she was staying.\n\nMelissa Gay, 14, met her parents, Robert and Lynette, at the police station in Montville, N.J., at 2:30 A.M. yesterday and returned home to Ridgefield, Conn.\n\nWe haven't really talked to her yet,\" Mr. Gay said yesterday from the Pierre Hotel. \"We just gave her hugs and brought her home.\"\n\nMr. Gay, a partner in the private investment firm Bain Capital, launched a huge search with the help of business partners Thursday to help locate his daughter, whom the family had not heard from since last Saturday.\n\nMelissa left her parents' home that day, took a train to New York and never returned after attending a rave concert on Randalls Island. While at the concert, her father said, she took the drug Ecstasy and then \"wandered the city.\" During her wandering, her father said, she met a young man who took her to h", "comment_2": "Body Of Missing NJ Teen Found In Surf: The body of a New Jersey teenager who disappeared after being knocked dow.. http://bit.ly/1e5rOh", "comment_1": "Body of Missing New Jersey Teenager Sarah Townsend Found in Pond  http://t.co/NKj5Sdm", "split": "val", "label": "real"}
{"comment_3": "Guaranteed Choices to Strengthen Medicare & Health Security For All: Wyden-Ryan Options for the Future http://t.co/SvDH9A0m", "article": "7 years ago\n\n(CNN) - Vice President Joe Biden and Republican vice presidential nominee Paul Ryan met in Danville, Kentucky on Thursday evening for the vice presidential debate.\n\n\n\nMARTHA RADDATZ, MODERATOR: Good evening, and welcome to the first and only vice presidential debate of 2012, sponsored by the Commission on Presidential Debates. I'm Martha Raddatz of ABC News, and I am honored to moderate this debate between two men who have dedicated much of their lives to public service.\n\nTonight's debate is divided between domestic and foreign policy issues. And I'm going to move back and forth between foreign and domestic, since that is what a vice president or president would have to do. We will have nine different segments. At the beginning of each segment, I will ask both candidates a question, and they will each have two minutes to answer. Then I will encourage a discussion between the candidates with follow-up questions.\n\nBy coin toss, it has been determined that Vice President Biden will be first to answe", "comment_2": "See AARP response to white paper on \"Guaranteed Choices to Strengthen Medicare & Health Security Choices for All\" at http://t.co/Q1BtbBGI", "comment_1": "GUARANTEED CHOICES TO STRENGTHEN MEDICARE AND\nHEALTH SECURITY FOR ALL: BIPARTISAN OPTIONS FOR THE FUTURE http://t.co/EzMsvTOG", "split": "val", "label": "real"}
{"comment_3": "Text of Obama Speech on Homeownership: President Obama's remarks on responsible homeownership, as prepared for... http://t.co/UsRigPNjkY", "article": "Desert Vista High School\n\nPhoenix, Arizona\n\n1:00 P.M. MST\n\nTHE PRESIDENT: Hey! Hello, Phoenix! (Applause.) Hello, Arizona! (Applause.) It is --\n\nAUDIENCE MEMBER: We love you, Obama!\n\nTHE PRESIDENT: I love you back. It is good to be here. (Applause.)\n\nI want to say thank you to the Thunder for hosting us here today. (Applause.) Well, we are so glad to be here. I want you to give it up for somebody who’s been fighting for homeowners and working families every single day, who’s with me today -- Secretary Shaun Donovan, Secretary of HUD. There he is right there. Give him a big round of applause. (Applause.) We’ve got Congressman Ed Pastor who’s here as well. (Applause.) We’ve got your Mayor, Greg Stanton, here. (Applause.) Doing an outstanding job. And to all the mayors and state legislators and tribal leaders who are here today, thank you. (Applause.)\n\nGive Jorge a big round of applause for his introduction. (Applause.) To your superintendent, Dr. Kenneth Baca. (Applause.) Your principal, Dr. Anna Battle. (Appla", "comment_2": "Text of Obama Speech on Homeownership -  The following are President Barack Obama‘s remarks on responsible... http://t.co/ot7G69v67P", "comment_1": "Responsible? Responsible? “@WSJ: Read the full text of President Obama's speech on responsible homeownership: http://t.co/oVkMT79ZQl”", "split": "val", "label": "real"}
{"comment_3": "Did Bernie Sanders vote against background checks and waiting periods for gun purchases? http://t.co/WJEwNV3AUa via @PolitiFact", "article": "As hype around Democratic presidential candidate Bernie Sanders grows, political opponents and media reporters are once again suggesting the socialist Vermont senator is a gun nut.\n\n\"One issue your Democratic rivals are starting to hit you with is the fact that you have, in the past, sided with the NRA on some gun issues,\" CNN’s Jake Tapper said in a July 5 interview with Sanders, alluding to an attack ad paid for by a pro-Martin O’Malley group.\n\n\"Bernie Sanders voted against the Brady Bill -- background checks and waiting periods,\" said the attack, which first aired June 25. \"Bernie Sanders is no progressive when it comes to guns.\"\n\nSanders’ record on guns has been the subject of liberal ire (\"Bernie Sanders, gun nut\") as well as conservative glee (\"Sorry liberals, Bernie Sanders is a gun nut\"). So we wanted to take a look at his vote on the Brady Handgun Violence Prevention Act, a landmark piece of gun control legislation.\n\nThe Brady Act mandated that everyone who wanted to buy a handgun had to wait five da", "comment_2": "Did Bernie Sanders vote against background checks and waiting periods for gun purchases? - PolitiFact https://t.co/6wAPhyu6jq", "comment_1": "Did Bernie Sanders vote against background checks and waiting periods for gun purchases? https://t.co/WysijjIKXo", "split": "train", "label": "real"}
{"comment_3": "Transcript of the 4-27-2010 Mark S. Allen’s \"American Morning\" CNN Interview With Mark S. Allen... http://dlvr.it/jctv #chicago #lifestyle", "article": "\n\n\n\nReturn to Transcripts main page\n\nAMERICAN MORNING\n\nSuper Tuesday: More Than 20 States, 40 Contests; Super Tuesday Meets the Mortgage Meltdown\n\nAired February 5, 2008 - 08:00 ET\n\nTHIS IS A RUSH TRANSCRIPT. THIS COPY MAY NOT BE IN ITS FINAL FORM AND MAY BE UPDATED.\n\n\n\nKIRAN CHETRY, CNN ANCHOR: Super Tuesday, more than 20 states, 40 contests. Candidates give their final pitches right here.\n\n(BEGIN VIDEO CLIP)\n\n\n\nHILLARY CLINTON, (D) PRESIDENTIAL CANDIDATE: I am so committed on to making sure nobody goes without health care.\n\n\n\nMITT ROMNEY, (R) PRESIDENTIAL CANDIDATE: We want to make sure this party does not leave the house that Ronald Reagan built.\n\n\n\n(END VIDEO CLIP)\n\n\n\nCHETRY: The issues hit home, health care, the housing crisis. We're talking to voters in the north, south, east and in Super Tuesday's biggest prize, California, on this AMERICAN MORNING.\n\n\n\nAnd welcome. It's a special split edition of AMERICAN MORNING on this Super Tuesday. I'm Kiran Chetry. I'm here at one of the local schools up in Harlem", "comment_2": "@CNN transcripts for American Morning http://t.co/91rERZGoIQ http://t.co/6NYv1mkFpV", "comment_1": "From Friday's CNN American Morning. Scroll down to see interview transcript.... http://bit.ly/3G8MdX", "split": "train", "label": "real"}
{"comment_3": "Will be at the Democratic National Convention in Charlotte this Thursday. Excited to see Pres. Obama and VP Biden give the acceptance speech", "article": "The Current Employment Statistics (CES) program produces detailed industry estimates of nonfarm employment, hours, and earnings of workers on payrolls. CES National Estimates produces data for the nation, and CES State and Metro Area produces estimates for all 50 States, the District of Columbia, Puerto Rico, the Virgin Islands, and about 450 metropolitan areas and divisions.\n\nEach month, CES surveys approximately 142,000 businesses and government agencies, representing approximately 689,000 individual worksites.\n\nAnnouncements IMPORTANT 2019 CES Preliminary Benchmark Revision to be released on August 21, 2019\n\nNext Releases: The Employment Situation for July 2019 is scheduled to be released on August 2, 2019, at 8:30 A.M. Eastern Time.\n\nReal Earnings for June 2019 is scheduled to be released on July 11, 2019, at 8:30 A.M. Eastern Time.\n\nCurrent Employment Statistics Contacts Staff members of the Current Employment Statistics are available Monday through Friday 8:30 AM TO 4:30 PM EASTERN TIME for your assista", "comment_2": "Final night of the #Democratic National Convention begins in #Charlotte, #Barack Obama' acceptance speech around  7:30am Indian time", "comment_1": "One year from tonight, our President will be making his acceptance speech at the Democratic National Convention in Charlotte.", "split": "train", "label": "real"}
{"comment_3": "BREAKING: Vice President #JoeBiden expected to make a statement at the White House Rose Garden within minutes.", "article": "Rose Garden\n\n5:35 P.M. EDT\n\nMR. BARDEN: Hello. My name is Mark Barden. Just four months ago, my wife Jackie and I lost our son, and our children, James and Natalie, they lost their little brother Daniel. Daniel was a first-grader at Sandy Hook Elementary School. Our sweet, 7-year-old Daniel was one of 20 children, six adults lost on December 14th. I have to say it feels like it was just yesterday.\n\nIn our deepest grief, we were supported by the love of our families and comforted by the love and prayers we received from millions of America, from every corner of the country.\n\nWhat happened in Newtown can happen anywhere. In any instant, any dad in America could be in my shoes. No one should feel the pain. No one should feel our pain or the pain felt by the tens of thousands of people who’ve lost loved ones to senseless gun violence.\n\nAnd that's why we're here. Two weeks ago, 12 of us from Newtown came to meet with U.S. senators and have a conversation about how to bring common-sense solutions to the issues of g", "comment_2": "Statement by the President in the Rose Garden: 1:43 P.M. EDT\nTHE PRESIDENT:  Good afternoon.  Today I accepted Gen... http://bit.ly/bs57eV", "comment_1": "White House: President Obama to deliver statement at 2:15 pm ET in the Rose Garden about the Iran talks - @OKnox  http://t.co/XQNboCVkAB", "split": "train", "label": "real"}
{"comment_3": "Memory Lapse? Trump Seeks Distance From 'Advisor' With Past Ties to Mafia - ABC News - https://t.co/PNq6ej3cB0 via @ABC", "article": "Though he touts his outstanding memory, when Donald Trump was asked under oath about his dealings with a twice-convicted Russian émigré who served prison time and had documented mafia connections, the real estate mogul was at a loss.\n\nEven though the man, Felix Sater, had played a role in a number of high-profile Trump-branded projects across the country.\n\n“If he were sitting in the room right now, I really wouldn't know what he looked like,” Trump testified in a video deposition for a civil lawsuit two years ago.\n\nIn recent weeks, the Republican Presidential candidate has been fending off critics who have accused him of embellishment, insensitivity and in some cases inaccuracy for his descriptions of the Muslim response to 9/11. Trump also dismissed outrage at his purported mocking of a disabled New York Times reporter, saying he simply does not remember meeting the scribe.\n\nAway from the spotlight, Donald Trump has also been seeking to minimize his past business ties with Sater, the Russian émigré who appea", "comment_2": "Memory Lapse? Trump Seeks Distance From 'Advisor' With Past Ties to Mafia - @ABC News https://t.co/sI80fdqzAJ", "comment_1": "Memory Lapse? Trump Seeks Distance From 'Advisor' With Past Ties to Mafia - ABC News - https://t.co/3b0lUXtcwP via ABC", "split": "train", "label": "real"}
{"comment_3": "Marco #Rubio says Ted #Cruz voted for defense cuts in Rand Paul's budget proposal https://t.co/4hBVxWLaXS via @PolitiFactFL", "article": "The only budget Ted Cruz \"ever voted for in his time in the Senate is a budget that cut defense spending by more than Barack Obama proposes we cut it.\"\n\nMarco Rubio portrayed fellow GOP senator and presidential hopeful Ted Cruz as all talk and no action on defense in an interview on Meet the Press.\n\n\"He talks tough on some of these issues,\" Rubio said Dec. 13. \"For example, he was going to ‘carpet bomb’ ISIS. But the only budget he's ever voted for in his time in the Senate is a budget that cut defense spending by more than Barack Obama proposes we cut it.\"\n\nRubio has tried to portray himself as a strong supporter of the military, while Cruz has tried to appeal to hawks as well as libertarians , who typically favor less defense spending.\n\nWe decided to fact-check Rubio’s claim that Cruz voted for a budget that cut defense spending by more than the Democratic president.\n\nCruz’s vote on Rand Paul’s budget proposal\n\nRubio’s campaign pointed to Cruz’s 2013 vote in favor of a budget proposal by U.S. Sen. Rand Paul", "comment_2": "Marco Rubio says Ted Cruz voted for defense cuts in Rand Paul's budget proposal.  Verdict:  Mostly FALSE!  https://t.co/RQewH9DymR", "comment_1": "Marco Rubio says Ted Cruz voted for defense cuts in Rand Paul's budget proposal https://t.co/Gun0KBl5sS via... https://t.co/XrsDO6Rlrz", "split": "train", "label": "real"}
{"comment_3": "The Driving Life And Death Of Philando Castile: Stopped by Police 46 times https://t.co/fYyrD5T6rg", "article": "\n\n\n\n— When Philando Castile saw the flashing lights in his rearview mirror the night he got shot, it wasn’t unusual. He had been pulled over at least 52 times in recent years in and around the Twin Cities and given citations for minor offenses including speeding, driving without a muffler and not wearing a seat belt.\n\nHe was assessed at least $6,588 in fines and fees, although more than half of the total 86 violations were dismissed, court records show.\n\nWas Castile an especially bad driver or just unlucky? Or was he targeted by officers who single out black motorists like him for such stops, as several of his family members have alleged?\n\nThe answer may never be known, but Castile’s stop for a broken tail light Wednesday ended with him fatally shot by a suburban St. Paul police officer, and Castile’s girlfriend livestreaming the chilling aftermath.\n\nThe shooting has added a new impetus to a national debate on racial profiling; a day after Castile died, a black Army veteran killed five officers in Dallas at a", "comment_2": "AP: Philando Castile had been stopped 52 times by police since 2002 (and never convicted o… https://t.co/hJ9P7l3J0A https://t.co/qYWRwuLC7h", "comment_1": "Philando Castile was stopped 52 times by police https://t.co/eGaD8lE4EO via @pioneerpress", "split": "train", "label": "real"}
{"comment_3": "Trump’s Tough Talk on Hedge-Fund Taxes Doesn’t Match His Plan https://t.co/kHmDUpiaTC on @bloglovin", "article": "Why did this happen?\n\nPlease make sure your browser supports JavaScript and cookies and that you are not blocking them from loading. For more information you can review our Terms of Service and Cookie Policy.", "comment_2": "Trump's Tough Talk on Hedge-Fund Taxes Doesn't Match His Plan https://t.co/QQaYTy5nsL via @bpolitics", "comment_1": "Trump's Tough Talk on Hedge-Fund Taxes Doesn't Match His Plan https://t.co/rpSVYFuUFe", "split": "train", "label": "real"}
{"comment_3": "CBC: Loves This #cdnpoli #abpoli #nlpoli\n**Livewire** President Trump's First Address to a Joint Session of Congress https://t.co/N0G1cWCp3O", "article": "I am not the first President to take up this cause, but I am determined to be the last. It has now been nearly a century since Theodore Roosevelt first called for health care reform. And ever since, nearly every President and Congress, whether Democrat or Republican, has attempted to meet this challenge in some way. A bill for comprehensive health reform was first introduced by John Dingell Sr. in 1943. Sixty-five years later, his son continues to introduce that same bill at the beginning of each session.\n\nOur collective failure to meet this challenge – year after year, decade after decade – has led us to a breaking point. Everyone understands the extraordinary hardships that are placed on the uninsured, who live every day just one accident or illness away from bankruptcy. These are not primarily people on welfare. These are middle-class Americans. Some can't get insurance on the job. Others are self-employed, and can't afford it, since buying insurance on your own costs you three times as much as the coverag", "comment_2": "President Trump's First Address to a Joint Session of Congress https://t.co/kLWi9Ul87i Congress better start delivering.   Fabulous Speech", "comment_1": "#French #President @EmmanuelMacron address to joint #Session of #Congress in the US is, among other things, a fine… https://t.co/2VbtuI9JeJ", "split": "train", "label": "real"}
{"comment_3": "twaboutMCCAIN&gt; The McCain Plan on Global Climate Change http://tinyurl.com/5gyoo2 http://tinyurl.com/43kva4", "article": "John McCain will establish a market-based system to curb greenhouse gas (GHG) emissions, mobilize innovative technologies, and strengthen the economy. He will work with our international partners to secure our energy future, to create opportunities for American industry, and to leave a better future for our children.\n\nJohn McCain’s Principles For Climate Policy:\n\n\n\nClimate Policy Should Be Built On Scientifically-Sound, Mandatory Emission Reduction Targets And Timetables.\n\n\n\nClimate Policy Should Utilize A Market-Based Cap And Trade System.\n\n\n\nClimate Policy Must Include Mechanisms To Minimize Costs And Work Effectively With Other Markets.\n\n\n\nClimate Policy Must Spur The Development And Deployment Of Advanced Technology.\n\n\n\nClimate Policy Must Facilitate International Efforts To Solve The Problem.", "comment_2": "Video: The McCain Plan on Global Climate Change: Here's video of Senator McCain's speech yesterday.. http://tinyurl.com/44nuud", "comment_1": "twaboutMCCAIN&gt; Video: The McCain Plan on Global Climate Change: Here's video of Se.. http://tinyurl.com/3mhee2", "split": "train", "label": "real"}
{"comment_3": "@CapitaLiszt @LindseyGrahamSC \"You people\" \n\nYou mean the majority of America who see Kavenaugh as an untrustworthy… https://t.co/Ov7kx2yolf", "article": "COPYRIGHT © 2005 LexisNexis, a division of Reed Elsevier Inc. All rights reserved.", "comment_2": "While traitors @ChuckGrassley and @LindseyGrahamSC desperately try undermine our constitutional democracy and prote… https://t.co/DDrtdls260", "comment_1": "Audio/transcript of my interview w/ @LindseyGrahamSC re Parks attacks: https://t.co/SaICJoVwfZ", "split": "train", "label": "real"}
{"comment_3": "@Math_Schmidt00 @RubinReport I said democratic socialist ideals, in the context of the presidential campaign of… https://t.co/bKwB1XMPvR", "article": "Press Release Sanders Supports Gun Safety Bill January 16, 2016 Twitter\n\nFacebook\n\nEmail Link\n\nCHARLESTON, S.C. – U.S. Sen. Bernie Sanders on Saturday made good on his promise to support legislation to amend a 2005 law on firearms manufacturers’ liability.\n\n“I’m pleased that this legislation is being introduced,” Sanders said of proposals by Sen. Richard Blumenthal and Rep. Adam Schiff to rescind portions of a law granting broad immunity from lawsuits to gun manufacturers and dealers. “As I have said for many months now, we need to look at the underlying law and tighten it up,” Sanders added.\n\nSanders called it “good news” that the Senate and House bills proposed by Blumenthal and Schiff would leave in place provisions in the 2005 law that require child safety locks on guns and ban armor-piercing ammunition. “Those were important provisions that I did support,” he said.\n\nSanders also renewed his concern that the law should not subject the owners of small gun stores, which have not acted negligently, to lawsui", "comment_2": "\"West said that his dream presidential candidate would have the Trump campaign and the Bernie Sanders principles\"… https://t.co/TiO9zHmnBe", "comment_1": "“Michael #Avenatti is the personification of 'progressives' who still traffic in white supremacy and the patriarchy… https://t.co/CI5Btjwl7X", "split": "train", "label": "real"}
{"comment_3": "GOP Task Force, Lone Democrat Eye Trafficking Law http://t.co/d2NNSdIakD", "article": "Aury Terriquez, left, 6, whose parents are from Guatemala, and Lucia Jimenez, 5, whose parents are from Bolivia, joined immigration advocates to call on the Obama administration to mitigate the child migrant crisis. (Tom Williams/CQ Roll Call)\n\nThe House GOP task force charged with making recommendations to colleagues on the influx of unaccompanied, undocumented immigrant children at the U.S.-Mexico border might suggest controversial changes to a 2008 trafficking law — and at least one Democrat wants to go that route as well.\n\nRep. Henry Cuellar of Texas, a fiscally conservative Blue Dog Democrat who made headlines on Wednesday for blasting President Barack Obama's failure to visit the border during a fundraising trip to the area, said he would soon introduce legislation to allow all children apprehended at the southwest border to qualify for \"voluntary return\" to their home countries.\n\nA law known as the \"William Wilberforce Trafficking Victims Protection Reauthorization Act\" gave that right only to children", "comment_2": "GOP Task Force, Lone Democrat Eye Trafficking Law http://t.co/lKRshwqU5K via @rollcall", "comment_1": "GOP Task Force, Lone Democrat Eye Trafficking Law http://t.co/IHkA7QYezb", "split": "train", "label": "real"}
{"comment_3": "NRA President David Keene rejects White House gun control approach http://t.co/UZx1k5Ml", "article": "JUDY WOODRUFF: We come back now to the gun story.\n\nAnd we're joined by David Keene. He's president of the National Rifle Association.\n\nWelcome to the NewsHour.\n\nDAVID KEENE, National Rifle Association: Thank you for having me.\n\nJUDY WOODRUFF: So, earlier on the program, we heard from the governor of Delaware, Jack Markell, who said the critics who argue that what they're trying to do by limiting gun violence and say that it's an attack on the Second Amendment are not right. He said, what we're simply doing are commonsense safety measures.\n\nDAVID KEENE: That's what Michael Bloomberg says.\n\nNo, it is an attack on the Second Amendment. It is an attack on those Americans who purchased and legally use firearms, who have never committed a criminal act, who have never done anything wrong. And they can say that it doesn't infringe upon their rights, but, in fact, it does.\n\nNow, every amendment -- the First Amendment -- you can't, famously, yell fire in a crowded theater. The Second Amendment is also subject to reason", "comment_2": "NRA President David Keene Rejects White House Gun Control Approach http://t.co/GnQwxEd1", "comment_1": "[Blog:http://t.co/5XBPpN8y] NRA President David Keene Rejects White House Gun Control Approach - P... http://t.co/n3ZnXx79 #uselessdrivel", "split": "train", "label": "real"}
{"comment_3": "Clinton knocks Bush’s ‘Right to Rise’ pitch in National Urban League speech – Washington Post http://t.co/jDF9FWAjJw", "article": "Hillary Clinton Remarks at National Urban League Conference\n\n2016 Democratic presidential candidate Hillary Clinton delivers remarks at the National Urban League Conference. She discusses jobs, the economy, and recent police killings and the shooting at a church in Charleston, South Carolina.", "comment_2": "Clinton knocks Bush’s ‘Right to Rise’ pitch in National Urban League speech – Washington Post http://t.co/FLHiiwpJjR", "comment_1": "Clinton knocks Bush’s ‘Right to Rise’ pitch in National Urban League speech http://t.co/IZRHIbzsuk #SahelNews", "split": "train", "label": "real"}
{"comment_3": "“@todaymoms: Five most popular baby names by state http://t.co/TWKRZrMR”", "article": "Top 100 Names by State for a Given Year of Birth Below, select a state and enter a year of birth.\n\nClick on \"Go\" and you will see a table of the top 100 names by sex. Select a State : Alaska Alabama Arkansas Arizona California Colorado Connecticut District of Columbia Delaware Florida Georgia Hawaii Iowa Idaho Illinois Indiana Kansas Kentucky Louisiana Massachusetts Maryland Maine Michigan Minnesota Missouri Mississippi Montana North Carolina North Dakota Nebraska New Hampshire New Jersey New Mexico Nevada New York Ohio Oklahoma Oregon Pennsylvania Rhode Island South Carolina South Dakota Tennessee Texas Utah Virginia Vermont Washington Wisconsin West Virginia Wyoming Enter a year of birth between\n\n1960-2004:", "comment_2": "Behold: The year's most popular baby names by state — surprised? https://t.co/idL1nySJOd https://t.co/Inna39ubki", "comment_1": "Most popular baby names by state: http://t.co/5EZ5yHVj | #Michael #James #Charlotte #Tennessee #Emma #Ava #Tinseltown", "split": "train", "label": "real"}
{"comment_3": "Hillary Clinton: To young people who are undocumented: This is your country, too. https://t.co/GhZ4wCWEMY #ImWithHer", "article": "Today marks four years since U.S. Citizenship and Immigration Services began accepting requests for President Obama’s 2012 Deferred Action for Childhood Arrivals (DACA) policy. DACA provides deportation relief and two-year work permits for young people aged 15–30 who came to the United States as children, allowing you to live without fear of being torn away from the only country you’ve ever really known.\n\nAnd that’s exactly who I want to talk to today: all of you who’ve benefited from DACA, all of you who can still apply, and all of you who are still fighting for a path to citizenship for you and your families.\n\nI’m sure this election has been stressful for you.\n\nIt can’t be easy to hear a presidential candidate demonize immigrant families and blame you for our nation’s problems. That’s not fair, it’s not kind, and it’s also just not true. In every state in this country, immigrants are starting small businesses, growing our economy, and making our communities and our country stronger.\n\nMany of you have told m", "comment_2": "Leadership: “To young people who are undocumented: This is your country, too” by @HillaryClinton https://t.co/4yeclV0ozV", "comment_1": "“To young people who are undocumented: This is your country, too.” by @HillaryClinton https://t.co/BBm8UZoeKR #DACA https://t.co/SkID18ChDU", "split": "train", "label": "real"}
{"comment_3": "Opinion: If Democrats Lose, Blame These Guys http://t.co/L8M02TwJW0 via @POLITICOMag", "article": "Kyle Kondik is managing editor of Sabato’s Crystal Ball, a nonpartisan political newsletter produced by the University of Virginia Center for Politics. He also directs the center’s Washington, D.C., office.\n\nIf Republicans capture control of the U.S. Senate, there will be many explanations for their victory: President Obama’s poor numbers, a great Senate map filled with attractive opportunities, a generally strong slate of candidates, the success of establishment-backed Republicans in primaries and others.\n\nBut one of the biggest factors will have hardly anything to do with the national political climate or, really, the campaign as a whole. Five Democrats, all of whom are old enough to be eligible for Medicare, decided not to run for another term in the Senate. Their decisions, all announced before May 2013, are a huge but largely forgotten boon to GOP hopes.\n\nStory Continued Below\n\nThe five retirements were: Max Baucus of Montana, Tom Harkin of Iowa, Tim Johnson of South Dakota, Carl Levin of Michigan and Ja", "comment_2": "New Jersey - Just say No to the Tax &amp; Spend DemocRats that blame Trump 4 Everything!  Defy NJ History &amp; give Clean… https://t.co/ZAntna8YeC", "comment_1": "@foxandfriends Democrats are the enemy not Russia or TRUMP.These lying CRIMINAL bastards take out horrible lying ad… https://t.co/yuDPvPmfri", "split": "train", "label": "real"}
{"comment_3": "Rand Paul We must demilitarize the police http://t.co/VKGqRbXq6U", "article": "The shooting of 18-year-old Michael Brown is an awful tragedy that continues to send shockwaves through the community of Ferguson, Missouri and across the nation.\n\nIf I had been told to get out of the street as a teenager, there would have been a distinct possibility that I might have smarted off. But, I wouldn’t have expected to be shot.\n\nThe outrage in Ferguson is understandable—though there is never an excuse for rioting or looting. There is a legitimate role for the police to keep the peace, but there should be a difference between a police response and a military response.\n\nThe images and scenes we continue to see in Ferguson resemble war more than traditional police action.\n\nGlenn Reynolds, in Popular Mechanics, recognized the increasing militarization of the police five years ago. In 2009 he wrote:\n\nSoldiers and police are supposed to be different. … Police look inward. They’re supposed to protect their fellow citizens from criminals, and to maintain order with a minimum of force. It’s the difference b", "comment_2": "Rand Paul We must demilitarize the police: Quote: --- Originally Posted by Gelsemium I think that the military is… http://t.co/QSO2Xmorc8", "comment_1": "Rand Paul We must demilitarize the police: Quote: --- Originally Posted by Gelsemium I think that the military is… http://t.co/0dSBIhPZ2j", "split": "train", "label": "real"}
{"comment_3": "Live Now: @dashching, Deputy Director of Federal Tax Policy at the Center on Budget and Policy Priorities, joins us… https://t.co/J0YcBXf2jc", "article": "COPYRIGHT © 2005 LexisNexis, a division of Reed Elsevier Inc. All rights reserved.", "comment_2": "The $1.5 trillion tax bill should be making its way to President Trump's desk soon. At noon, we'll talk about what… https://t.co/0MEmDZz1Jy", "comment_1": "@rjonesx @BarbaraKB @rustybrick @RyanJones And it destroys your EITC argument\n\"The EITC is just nowhere. They don't… https://t.co/j2efTMFQV0", "split": "train", "label": "real"}
{"comment_3": "EDITION: Full transcript: David Axelrod interviews President Barack Obama for The AxeFiles - CNNPo, https://t.co/6tgqVTITFp", "article": "This is a transcript of the interview ABC News’ chief anchor George Stephanopoulos conducted with President Barack Obama on November 12, 2015 at the White House.\n\nSTEPHANOPOULOS: Okay, Mr. President, thank you for doing this.\n\nPRESIDENT BARACK OBAMA: Great to be here, George.\n\nSTEPHANOPOULOS: Let's talk about ISIS to begin with. Did they bring down that Russian plane?\n\nOBAMA: Well, we don't know that yet. It is a possibility\n\nSTEPHANOPOULOS: Just a possibility?\n\nOBAMA: Well, we don't know. I think we're still looking at all the details. Any kind of aviation tragedy like this requires a lot of forensic work. It becomes more difficult when we're not actively involved on the ground. We are offering full cooperation with the Egyptians, with the Russians and others. But a lot of this is peace work. But there's a possibility that they may have taken place.\n\nSTEPHANOPOULOS: A lot of the intelligence community seems to think it's more of a probability. Adam Schiff, the ranking Democrat on House Intelligence Committee", "comment_2": "Full transcript: POLITICO’s Glenn Thrush interviews President Barack Obama on Iowa, 2016, and the choice between Hil…https://t.co/B4ZbfMll7Q", "comment_1": "Full transcript: David Axelrod interviews President Obama: AXELROD (voiceover): I first met Barack Obama when he… https://t.co/3tmSAxh71i", "split": "train", "label": "real"}
{"comment_3": "Trump signs executive order 'Protection of The Nation From Foreign Terrorist Entry Into The United States'\nhttps://t.co/cEJvo8TObw", "article": "By the authority vested in me as President by the Constitution and laws of the United States of America, including the Immigration and Nationality Act (INA), 8 U.S.C. 1101 et seq., and section 301 of title 3, United States Code, and to protect the American people from terrorist attacks by foreign nationals admitted to the United States, it is hereby ordered as follows:\n\nSection 1. Purpose. The visa-issuance process plays a crucial role in detecting individuals with terrorist ties and stopping them from entering the United States. Perhaps in no instance was that more apparent than the terrorist attacks of September 11, 2001, when State Department policy prevented consular officers from properly scrutinizing the visa applications of several of the 19 foreign nationals who went on to murder nearly 3,000 Americans. And while the visa-issuance process was reviewed and amended after the September 11 attacks to better detect would-be terrorists from receiving visas, these measures did not stop attacks by foreign nat", "comment_2": "Titled \"Protection Of The Nation From Foreign Terrorist Entry Into The United States,\" the executive order would tighten borders", "comment_1": "#IS is responding to #Trump's executive order \"Protection Of The Nation From Foreign Terrorist Entry Into The Unite… https://t.co/ZkYZmmZ5OQ", "split": "train", "label": "real"}
{"comment_3": "“@HillaryClinton: Commercial break: Hillary wants to make college affordable for every American. Can I get some free ice cream with that!", "article": "Clinton said, \"African-Americans are more likely to be arrested by police and sentenced to longer prison terms for doing the same thing that whites do.\"\n\nThe research suggests that when you compare what happens to black and whites who are engaging in the same illegal activity and have the same criminal history, African Americans are more likely to be arrested, more likely to face tougher charges, and more likely to receive longer sentences than their caucasian counterparts.\n\nWe rate the claim as True.", "comment_2": "@kcmoLEW Whoever made up that commercial was obviously not an American, or a Trump supporter.  I didn't vote for Tr… https://t.co/oWiahd3BD7", "comment_1": "If it weren't for Putin, Hillary taking a red button with the wrong word written on it, referencing an American commercial, would've done--?", "split": "train", "label": "real"}
{"comment_3": "#HealthcareEconomics Transcript of the Democratic Presidential Debate in Milwaukee https://t.co/UJvHDxq8Ov", "article": "Sue Grafton 1940–2017\n\nSue Grafton published the first in her series, “‘A’ Is for Alibi,” in 1982 and reached the 25th letter of the alphabet with her final book, “‘Y’ Is for Yesterday,” which was published in August. “As far as we in the family are concerned,” her daughter wrote, “the alphabet now ends at Y.”", "comment_2": "\"Transcript: Democratic Presidential Debate in Brooklyn\" by Unknown Author via NYT https://t.co/9Kf8Bfinft", "comment_1": "Transcript of the Democratic Presidential Debate: Following is a transcript of the Democratic debate, as trans... https://t.co/f2dnJ64EFr", "split": "train", "label": "real"}
{"comment_3": "Palin: Pioneer, maverick -- and now game-changer - CNN International: BBC NewsPalin: Pioneer, mav.. http://tinyurl.com/6y4wx3", "article": "(CNN) -- The McCain campaign calls her a \"tough executive who has demonstrated\" readiness to be president. The Republican National Committee calls her a \"conservative star with the talent, energy and family support necessary to carry out common sense policies.\"\n\nJohn McCain's choice of Sarah Palin as his running mate came as a surprise. more photos »\n\nBut the Obama campaign calls her a candidate with \"the thinnest foreign policy experience in history\" who is \"currently under investigation in her own state.\" And one of the Senate's top Democrats, Charles Schumer, said that although she is \"a fine person, her lack of experience makes the thought of her assuming the presidency troubling.\"\n\nWhat do we know about Sarah Palin, the 44-year-old first-ever female governor of Alaska, wife and mother of five, and now GOP vice presidential nominee?\n\nOn August 29, a new part of her identity dominated the political scene: game-changer.\n\nShe entered an already historic election, knowing well two of the biggest things McCain", "comment_2": "CNN says: Palin a pioneer, maverick -- and game-changer -- hahaha, read Jack London honey. Modern day pioneer = i stay on a diet", "comment_1": "Palin: Pioneer, maverick -- and now game-changer - CNN International http://tinyurl.com/5emjjv", "split": "train", "label": "real"}
{"comment_3": "Rick Perry says he switched to GOP at a younger age than Reagan did http://t.co/MNG2Q7d6Fw via @PolitiFactTexas", "article": "\"I became a Republican sooner in my life than\" Ronald Reagan did in his.\n\nOn his Aug. 30 radio program, conservative commentator Sean Hannity noted that Texas Gov. Rick Perry’s years-ago switch from the Democratic to the Republican party Puts him in the same company as the nation’s 40th president.\n\n\"You’re sort of like Ronald Reagan, you feel the Democratic Party left you?\" Hannity asked.\n\nPerry replied that he’d had a conversation with Reagan’s son Michael, a political consultant and former radio host. \"I told Michael Reagan the other day … ‘You know, I love your dad, and he was part of the reason I became a Republican,’ but I said, ‘I became a Republican sooner in my life than your dad did.’ \"\n\nPerry and Hannity shared a laugh over that. But that light moment left unresolved how old each leader was when he made his D-to-R leap. Did Perry beat Reagan to the flip point?\n\nWe’ll take a look at Reagan first. In March 2010, PolitiFact Florida rated True the claim that \"Reagan was a Democrat before he was a Republ", "comment_2": "RT @PolitiFactTexas: Rick Perry says he switched to GOP at a younger age than Reagan did -- True http://t.co/DJGMxZN1 #tcot #rgv #txlege", "comment_1": "RT @AaronPena: RT @PolitiFactTexas: Rick Perry says he switched to GOP at a younger age than Reagan did -- True http://t.co/B0VZDTqC #tcot", "split": "train", "label": "real"}
{"comment_3": "House GOP Introduces Keep Terrorists Out of America Act | Republican Leader John Boehner: http://bit.ly/9rxf2", "article": "House GOP Introduces Keep Terrorists Out of America Act\n\nWashington, May 7 - House Republicans today introduced the Keep Terrorists Out of America Act, legislation aimed at stopping the transfer or release of terrorists held at the Guantanamo Bay prison into the United States. The legislation unequivocally opposes releasing terrorists from the Guantanamo Bay facility and transferring them to the United States, makes clear that governors and state legislatures must pre-approve the transfer or release of any terrorist detainee into their respective states, and requires the Administration to meet strict criteria and certification standards before terrorists housed at the Guantanamo prison could be brought to the United States. Republican Leader John Boehner (R-OH) issued the following statement on the legislation:\n\n\n\n\n\n“This bill has a straightforward but vital purpose: to ensure that the terrorists held in the Guantanamo Bay prison are not imported into the United States. We are giving every member of Congress ", "comment_2": "GOP House: House GOP Introduces Keep Terrorists Out of America Act: House Republicans today introduced.. http://tinyurl.com/c9ak48", "comment_1": "RT @KOSMOSNET: House GOP Introduces Keep Terrorists Out of America Act  http://bit.ly/30Sr5g #tcot #tlot", "split": "train", "label": "real"}
{"comment_3": "\"Domestic production will average 83.3 billion cubic feet per day (Bcf/d)  of natural gas this year, up from 74.8 B… https://t.co/MJgPDGHrqm", "article": "Data Series Period-Unit: Weekly - Thousand Barrels per Day 4-Week Avg. - Thousand Barrels per Day View\n\nHistory 08/11/06 08/18/06 08/25/06 09/01/06 09/08/06 09/15/06 Imports\n\nCrude Oil and Petroleum Products 13,851 14,574 14,831 13,698 14,086 13,923 1991-2006 Crude Oil 10,022 10,197 11,153 10,365 10,597 10,592 1990-2006 Crude Oil (Excluding SPR) 10,022 10,197 11,153 10,365 10,597 10,592 1982-2006 SPR 0 0 0 0 0 0 1982-2006 Total Products 3,829 4,377 3,678 3,333 3,489 3,331 1990-2006 Total Motor Gasoline 1,388 1,324 1,183 1,027 1,084 799 1982-2006 Reformulated 0 0 0 0 0 0 1993-2006 Blended with Ether 0 0 0 0 0 0 2004-2006 Blended with Alcohol 0 0 0 0 0 0 2004-2006 Blended Non Oxygenated 0 0 0 0 0 0 2004-2006 Conventional 361 372 480 460 285 210 1994-2006 Blended with Alcohol 0 0 0 0 0 0 2004-2006 Other Conventional 361 372 480 460 285 210 2004-2006 Blending Components 1,027 952 703 567 799 589 1985-2006 RBOB with Ether 0 0 0 0 0 0 2004-2006 RBOB with Alcohol 290 222 274 243 176 143 2004-2006 CBOB 0 0 0 0 0 0 20", "comment_2": "The U.S. Energy Information Administration said Wednesday that America \"likely surpassed\" Russia in June and August. https://t.co/PmNDAzolmG", "comment_1": "Texas and New Mexico will account for 1/3 of the entire world’s growth in oil supply next year #PermianBasin - US E… https://t.co/zTRHeTDaDu", "split": "train", "label": "real"}
{"comment_3": "According to (http://t.co/wvdsUaO) Statutory Limits on Federal debt 1940-Current Table 7.3 (106) increases the federal debt limit since 1940", "article": "OMB HOME •\n\nHistorical Tables\n\nHistorical Tables provides data on budget receipts, outlays, surpluses or deficits, Federal debt, and Federal employment over an extended time period, generally from 1940 or earlier to 2010 or 2014.\n\nTo the extent feasible, the data have been adjusted to provide consistency with the 2010 Budget and to provide comparability over time.\n\nSpreadsheets\n\nTo download the Historical Tables as a single PDF, click here (2.0 MB)", "comment_2": "STATUTORY LIMITS ON FEDERAL DEBT:1940–CURRENT Excel table from Office of Management and Budget http://t.co/NK1kzsc", "comment_1": "Among its historical tables is one labeled \"Statutory Limits on Federal debt 1940 - Current\" (Table 7.3) The... http://t.co/4bHUcy0a", "split": "train", "label": "real"}
{"comment_3": "As low as congressional job approval ratings I suppose. https://t.co/RU5PafLtrs", "article": "Tweet CONGRESS – Job Rating See also: Detailed trend Approve Disap-\n\nprove Unsure Approve\n\nminus % % % Disapprove . Monmouth U. 6/12-17/19 19 69 12 - 50 Monmouth U. 5/16-20/19 20 71 9 - 51 Fox RV 5/11-14/19 21 66 13 - 45 Gallup 5/1-12/19 20 75 5 - 55 Monmouth U. 4/11-15/19 24 62 14 - 38 Gallup 4/1-9/19 20 77 3 - 57 Gallup 3/1-10/19 26 70 4 - 44 Monmouth U. 3/1-4/19 23 68 9 - 45 Gallup 2/1-10/19 21 76 3 - 55 Monmouth U. 1/25-27/19 18 72 10 - 54 Fox RV 1/20-22/19 18 67 15 - 49 Gallup 1/2-10/19 20 75 5 - 55 . Gallup 12/3-12/18 18 75 7 - 57 Monmouth U. 11/9-12/18 23 63 14 - 40 Gallup 11/1-11/18 21 74 5 - 53 Gallup 10/15-28/18 21 74 6 - 53 CBS 10/14-17/18 19 72 8 - 53 Fox RV 10/13-16/18 23 63 14 - 40 Gallup 10/1-10/18 21 73 6 - 52 CNN 10/4-7/18 17 74 9 - 57 Gallup 9/4-12/18 19 76 5 - 57 Quinnipiac RV 9/6-9/18 18 72 10 - 54 NBC/WSJ RV 8/18-22/18 20 75 5 - 55 Fox RV 8/19-21/18 23 68 9 - 45 Monmouth U. 8/15-19/18 17 69 14 - 52 Quinnipiac RV 8/9-13/18 15 78 7 - 63 Gallup 8/1-12/18 17 78 5 - 61 Gallup 7/1-11/18 17 77 6", "comment_2": "S & P ratings signal a failure of CONGRESSIONAL leadership.  The executive branch did its job.", "comment_1": "New from Pew Research: Declining Confidence in Trump, Lower Job Ratings for Congressional Leaders https://t.co/arwG3NJ8Fy", "split": "train", "label": "real"}
{"comment_3": "How a Leaked Tape of Donald Trump Bragging About Groping Women Changed the 2016 Race | TIME https://t.co/ahorVAxcyl", "article": "The bombshell dropped on the Washington Post’s website just after 4 p.m.: a video of Donald Trump, in 2005, using extremely vulgar language to describe women, detailing his attempt to bed a married woman and bragging that he can grope women because he is a celebrity. Less than an hour later, Wikileaks published more than 2,000 emails from what appeared to be the personal account of the chairman of Hillary Clinton’s presidential campaign.\n\nBut not even John Podesta’s private and largely inside-baseball notes to Clinton could save Trump the lashing that was coming his way.\n\nRepublicans lined up to criticize Trump’s language and attitudes toward women. His advisers worried about what else might be out there to sink their chances with just over a month until Election Day. Trump Tower was in full meltdown mode again, with some advisers urging him to make another apology and others just trying to make him see that there was a serious problem. And Trump’s Sunday night’s debate against the first woman to lead a major", "comment_2": "How a leaked tape of donald trump bragging about groping women changed the 2016 race https://t.co/af2bwvYWyC https://t.co/LLK2Tknttk", "comment_1": "How a Leaked Tape of Donald Trump Bragging About Groping Women Changed the 2016 Race https://t.co/ZPi0IMKkjJ", "split": "train", "label": "real"}
{"comment_3": "Mitch McConnell, Alison Lundergan Grimes Have 'Sharp Differences' on Campaign Finance Rules http://t.co/xZ88gLfGmn via @wfplnews", "article": "Republican Senator Mitch McConnell and Democratic challenger Alison Lundergan Grimes sit on opposite sides of the debate about the role of money in U.S. elections.\n\nA deluge of campaign cash is playing a significant role in Kentucky’s Senate race thus far.\n\nThe money raised by the campaigns and outside groups is expected to top the $100 million mark and go down as the most expensive in U.S. history.\n\nMore than any lawmaker, McConnell is the face of loosening—if not, eliminating—campaign finance regulations.\n\nFor over a decade the GOP leader has espoused that money and free speech are synonymous. He has filed legal briefs urging the Supreme Court to reaffirm its Citizens United decision and supports a controversial case to further deregulate contribution limits placed on individuals.\n\nIn a March 17 e-mail to supporters, Grimes took a strong stance against the influence wealthy donors are having and calls out McConnell as the chief architect and beneficiary of that system.\n\n“Special interest money has already f", "comment_2": "Mitch McConnell, Alison Lundergan Grimes Have 'Sharp Differences' on Campaign Finance Rules http://t.co/RYUfisqqr7 via @wfplnews", "comment_1": "By @phillipmbailey: Mitch McConnell, Alison Lundergan Grimes Have 'Sharp Differences' on Campaign Finance Rules http://t.co/awW1Ovzqgj", "split": "train", "label": "real"}
{"comment_3": "Obama: Gitmo inspires jihadists http://t.co/ZeYOcM11uq", "article": "About This Show\n\nFrom the country’s major political and policy issues to diplomacy on the global stage, State of the Union with Candy Crowley brings in the world’s top newsmakers and analysts to deliver the smartest, most comprehensive look at what matters most to you. Sundays at 9am and Noon ET.\n\n\n\nSend Feedback | Subscribe | About Candy Crowley", "comment_2": "Obama: Gitmo inspires jihadists http://t.co/p6KnwC7BCG", "comment_1": "Obama: Gitmo inspires jihadists will do everything he can to close Guantanamo Bay Prison http://t.co/FDeZxeaZTw", "split": "train", "label": "real"}
{"comment_3": "Skeptic History: @MythBusters' Emmy-nominated episode \"NASA Moon Landing\" first aired Aug. 27, 2008. http://t.co/ANQKcrkf", "article": "Clinton said, \"Trump Management was charged with discriminating against African-Americans and breaking federal law.\"\n\nThe government in 1973 accused Trump, his father and Trump Management of violating the Fair Housing Act, part of the Civil Rights Act of 1968. The case alleged Trump’s realty company discriminated against non-white tenants and potential tenants at numerous apartment complexes.\n\nThe government settled the lawsuit, after Trump waged a years-long legal battle, so Trump never admitted guilt. But the company did agree to comply with extensive requirements intended to stop housing discrimination at its properties.\n\nClinton’s claim is carefully phrased. For that, we rate her claim True.", "comment_2": "Read my Aug 27 Newsletter featuring “HBO just aired first 'Game of Thrones' Season 8 footage, featuring an…” https://t.co/SRas36W2oR", "comment_1": "First episode aired Aug.1,2003. Last was May.27,2005. I can't even handle the nostalgia right now. #radiofreeroscoe #2003 #2004 #2005", "split": "train", "label": "real"}
{"comment_3": "The Boards of Trustees of the Federal Hospital Insurance (Medicare Part A) and the Federal Supplementary Medical In… https://t.co/aXFaZ0j6Cj", "article": "Senate Committee Any Committee Agriculture, Nutrition, and Forestry (70th-116th) Armed Services (79th-116th) Banking, Housing, and Urban Affairs (70th-116th) Budget (93rd-116th) Commerce, Science, and Transportation (79th-116th) Energy and Natural Resources (70th-116th) Environment and Public Works (79th-116th) Finance (70th-116th) Foreign Relations (70th-116th) Health, Education, Labor, and Pensions (70th-116th) Homeland Security and Governmental Affairs (70th-116th) Indian Affairs (95th-116th) Intelligence (Select) (94th-116th) Judiciary (70th-116th) Rules and Administration (79th-116th) Small Business and Entrepreneurship (81st-116th) Veterans' Affairs (91st-116th)\n\nState or Territory Indicated Any State or Territory Alabama Alaska American Samoa Arizona Arkansas California Colorado Connecticut Delaware District of Columbia Florida Georgia Guam Hawaii Idaho Illinois Indiana Iowa Kansas Kentucky Louisiana Maine Maryland Massachusetts Michigan Minnesota Mississippi Missouri Montana Nebraska Nevada New Hampsh", "comment_2": "2018 Annual Report of the Boards of Trustees of the Federal Hospital Insurance and Federal Supplementary Medical In… https://t.co/1okeXdrLya", "comment_1": "@bpangie Meanwhile: The 2017 Annual Report of the Boards of Trustees of the Federal Hospital Insurance and Federal… https://t.co/6PKXzlrTcB", "split": "train", "label": "real"}
{"comment_3": "Way to go, Congress. “@MilitaryTimes: No mid-Oct. paycheck for troops if government shuts down, lawmaker says http://t.co/XCTgINOvYp”", "article": "On the Ground at the Paris Air Show | Defense News Weekly, June 21, 2019\n\nPlay Video", "comment_2": "No mid-Oct. paycheck for troops if government shuts down, lawmaker says http://t.co/e0QAMrdBjs", "comment_1": "No mid-Oct. paycheck for troops if government shuts down, lawmaker says: With one week to go before a po... http://t.co/WeWKJEZCaM #army", "split": "train", "label": "real"}
{"comment_3": "Changes in U.S. Family Finances from 2007 to 2010: Evidence from the Survey of Consumer Finances: http://t.co/tehvEKmn #consumer #finance", "article": "The defeat of the DISCLOSE Act in the Senate is part of a “frightening” trend, according to Independent Sen. Bernie Sanders of Vermont.\n\nDuring an appearance on Current TV’s Viewpoint on Tuesday, Sanders blasted Republicans for blocking the legislation.\n\n“What really frightens me is not just the disastrous nature of Citizens United, but the whole trend that we are seeing lately, economically, of moving this country toward an oligarchic form of government,” he said. “What you have right now is incredibly unequal distribution of wealth and income… the Walton family of Walmart itself owns more wealth — one family — than the bottom 40 percent of the American people.”\n\n“You’ve got that reality out there, and then what’s happening now — what Citizens United is about — is these guys are not content to own the economy, to own the wealth of America, they now want to own lock, stock and barrel the political process as well.”\n\nThe DISCLOSE Act would have required outside campaign groups to disclose those who contribute ", "comment_2": "moneyStream©: Changes in U.S. Family Finances from 2010 to 2013: Evidence from the Survey of Consumer Finances http://t.co/GayO0vEuUF", "comment_1": "Changes in U.S. Family Finances from 2007 to 2010: Evidence from the Survey of Consumer\nFinances as pdf http://t.co/CRKk8O9p", "split": "train", "label": "real"}
{"comment_3": "H.R. 240 – Department of Homeland Security Appropriations Act, 2015 http://t.co/mkzAGlMEL4", "article": "We’re looking to learn more about who uses GovTrack and what features you find helpful or think could be improved. If you can, please take a few minutes to help us improve GovTrack for users like you.\n\nStart by telling us more about yourself:\n\nWe hope to make GovTrack more useful to policy professionals like you. Please sign up for our advisory group to be a part of making GovTrack a better tool for what you do.\n\nYoung Americans have historically been the least involved in politics, despite the huge consequences policies can have on them. By joining our advisory group, you can help us make GovTrack more useful and engaging to young voters like you.\n\nOur mission is to empower every American with the tools to understand and impact Congress. We hope that with your input we can make GovTrack more accessible to minority and disadvantaged communities who we may currently struggle to reach. Please join our advisory group to let us know what more we can do.\n\nWe love educating Americans about how their government work", "comment_2": "H.R. 240 (Department of Homeland Security Appropriations Act, 2015 ) failed cloture in the Senate http://t.co/qFjKY6lnjz", "comment_1": "Today I voted to pass H.R. 240, the FY15 Department of Homeland Security Appropriations Act. http://t.co/IasMVBioug", "split": "train", "label": "real"}
{"comment_3": "Organizing for America | BarackObamacom | Watch A Special Live ... http://ow.ly/15WbMs", "article": "Profile\n\nLocation: Concord, NH\n\nWhy I support Barack Obama: America is in need of change and Barack Obama represents the kind of change Washington and our country needs.\n\nIssues: peace & social justice; economic fairness / security; smart energy policy\n\nRegistered to Vote: Yes\n\n", "comment_2": "@Microsoft Just thought I'd pop in and say thanks for your voluntary contribution to the US govt this year.", "comment_1": "Register To Vote If You Want To Avoid -- THIS!! http://t.co/Q5uVTeYQDX #BarackObamacom", "split": "train", "label": "real"}
{"comment_3": "NK's endgame and how to handle it. Good interview with frmr Amb. Christopher Hill on Daily Show: https://t.co/B31b4HbYk9 via @comedycentral", "article": "Broad City\n\nCreated by UCB alums Abbi Jacobson and Ilana Glazer, Broad City is an odd-couple comedy about two best friends navigating life in New York City. Abbi and Ilana are broke and flawed, and they don’t shy away from the sticky situations NYC throws at them – they dive right into the muck. No matter how bad it gets, these broads are always down to tackle whatever hits them.", "comment_2": "The #DailyShow's Samantha Bee has a new book out: \"I Know I Am, But What Are You?\" -&gt;@ccinsider's  exclusive interview http://bit.ly/cx38Cp", "comment_1": "@TheDailyShow Great interview with Sen. Marco Rubio on last night's show. Going to @comedycentral dot com to watch the rest! #DailyShow", "split": "train", "label": "real"}
{"comment_3": "This is where I am following the 3rd &amp; final US Presidential #debate . Transcript with associated fact-checks https://t.co/t7YavJaG43", "article": "Here is a complete transcript of President Obama and Mitt Romney’s remarks at the third and final presidential debate at Lynn University in Boca Raton, Fla., on Oct. 22, 2012. Remarks from the two candidates were updated as the debate unfolded.\n\nBOB SCHIEFFER, MODERATOR: Good evening from the campus of Lynn University here in Boca Raton, Florida. This is the fourth and last debate of the 2012 campaign, brought to you by the Commission on Presidential Debates.\n\nThis one’s on foreign policy. I’m Bob Schieffer of CBS News. The questions are mine, and I have not shared them with the candidates or their aides.\n\nSCHIEFFER: The audience has taken a vow of silence — no applause, no reaction of any kind, except right now when we welcome President Barack Obama and Governor Mitt Romney.\n\n(APPLAUSE)\n\nGentlemen, your campaigns have agreed to certain rules and they are simple. They’ve asked me to divide the evening into segments. I’ll pose a question at the beginning of each segment. You will each have two minutes to respo", "comment_2": "LIVE-STREAM-TRANSCRIPT: Presidential Debate in Denver — Romney vs. Obama — October 3rd, 2012 http://t.co/MUxFE9Ec", "comment_1": "josettestach: Transcript: 3rd Obama-Romney Presidential Debate", "split": "train", "label": "real"}
{"comment_3": "HPV Vaccine Victim’s Advocacy Group Sends Open Letter to HHS Secretary Kathleen Sebelius http://t.co/GHK0CWLq", "article": "Florida Democrats Ask HHS to Protect Floridians from High Insurance Premiums in Marketplace f t # e Washington, DC, August 1, 2013 | (202-225-3001) In a letter sent today to U.S. Secretary Kathleen Sebelius led by Congressman Ted Deutch (FL-21), the Florida Democratic delegation in the House of Representatives slammed Governor Rick Scott and the Florida legislature for stripping the state of the authority to protect consumers from unreasonably high insurance premiums and called on the Department of Health and Human Services to take a more active role in reviewing rates in Florida. The Affordable Care Act encourages state regulators to review premium rates proposed by health insurance companies, but allows the federal government to engage in such reviews if a state is found to have inadequate protection for consumers. While the federal government determined in early May that Florida’s Office of Insurance Regulation was legally capable of protecting consumers, on May 31, 2013 Governor Scott signed SB 1842 and e", "comment_2": "READ: See the Actual Letter Gov. Perry Sent to HHS Secretary Kathleen Sebelius http://t.co/DuFgDq12", "comment_1": "Rick Perry's Letter to HHS Secretary Kathleen Sebelius http://t.co/4wZWmp3V", "split": "train", "label": "real"}
{"comment_3": "Rep. Dennis Kucinich Says ExxonMobil Paid No Taxes in 2009 and Got $156 Million Rebate: PolitiFact Ohio http://t.co/NwlSYxy", "article": "Rose Garden\n\n11:00 A.M. EDT\n\nTHE PRESIDENT: Thank you very much. (Applause.) Everybody, please have a seat. Sorry we’re running just a little bit behind, but I figured it’s a great day to enjoy the Rose Garden.\n\nToday, members of Congress have a simple choice to make: They can stand with the big oil companies, or they can stand with the American people.\n\nRight now, the biggest oil companies are raking in record profits –- profits that go up every time folks pull up into a gas station. But on top of these record profits, oil companies are also getting billions a year -- billions a year in taxpayer subsidies -– a subsidy that they’ve enjoyed year after year for the last century.\n\nThink about that. It’s like hitting the American people twice. You’re already paying a premium at the pump right now. And on top of that, Congress, up until this point, has thought it was a good idea to send billions of dollars more in tax dollars to the oil industry.\n\nIt’s not as if these companies can’t stand on their own. Last year,", "comment_2": "Rep. Dennis Kucinich says ExxonMobil paid no taxes in 2009 and got $156 million rebate. POLITIFACT says FALSE http://j.mp/oEZkWM @cspanwj", "comment_1": "Rep. Dennis Kucinich says ExxonMobil paid no taxes in 2009 and got $156 million rebate. POLITIFACT says FALSE http://j.mp/oEZkWM @cspanwj", "split": "train", "label": "real"}
{"comment_3": "First time watching This week in South Florida on @abc . I have to say I’m impressed with the hard hitting question… https://t.co/Nzi2FBJVop", "article": "TAPPER: Good morning, everyone. Tomorrow, the Senate is scheduled to hold its first vote on the biggest overhaul in decades of the nation's financial system, changes that could impact your savings, your pension, maybe even your job. This as a big Wall Street investment bank comes under attack on Tuesday. Executives from Goldman Sachs, which is already facing government accusations of fraud, will testify before a Senate committee investigating whether the firm profited from the massive housing crash at the expense of its clients.\n\nJoining me this morning, three key players in the middle of this storm. With me here, is Austan Goolsbee from the President Obama's Council of Economic Advisers. In Chattanooga, we have Tennessee Republican Senator Bob Corker, and in Cincinnati, Democratic Senator Sherrod Brown, both key members of the Senate Banking Committee. Gentlemen, welcome.\n\nGOOLSBEE: Thanks for having us.\n\nCORKER: Good morning. Good to be with you.\n\nTAPPER: Before we start with Wall Street reform, I do want t", "comment_2": "@ArminNavabi @RitaPanahi December and January's courageous Iranian freedom protests held in cities across the count… https://t.co/NGjQqA8o3k", "comment_1": "“Se cortó mamadera”, decían https://t.co/RkUIy6GYsA.  El Ministro Leite se jactaba de haber frenado desembolsos de… https://t.co/eWGiTFS2cf", "split": "train", "label": "real"}
{"comment_3": "Updated: The Facts About Hillary Clinton's Emails https://t.co/vCbIQLxhNk", "article": "Factsheets\n\nUpdated: The Facts About Hillary Clinton’s Emails\n\nWe’ve put all of the information about Hillary Clinton’s State Department emails here. Just the facts, all in one place.\n\nWhy did Clinton use her own email account?\n\nWhen Clinton got to the Department, she opted to use her personal email account as a matter of convenience. It enabled her to reach people quickly and keep in regular touch with her family and friends more easily given her travel schedule.\n\nThat is the only reason she used her own account.\n\nHer usage was widely known to the over 100 State Department and U.S. government colleagues she emailed, consistent with the practice of prior Secretaries of State and permitted at the time.\n\nAs Clinton has said, in hindsight, it would have been better to just have two accounts. While she thought using one account would be easier, obviously, that has not been the case.\n\nWas it allowed?\n\nYes. The laws, regulations, and State Department policy in place during her tenure permitted her to use a non-gove", "comment_2": "Updated: The Facts About Hillary Clinton’s Emails\n https://t.co/M1cmRcxFDn", "comment_1": "Updated: The Facts About Hillary Clinton's Emails NancyHarvey: https://t.co/1mUeYVQPbV", "split": "train", "label": "real"}
{"comment_3": "“None of this is normal”: read the full transcript of Sen. Jeff Flake’s blistering retirement speech https://t.co/PMkoqrIx2z via @voxdotcom", "article": "poster=\"http://v.politico.com/images/1155968404/201801/319/1155968404_5713627373001_5713606670001-vs.jpg?pubId=1155968404\" true Full text: Jeff Flake on Trump speech transcript\n\nPrepared remarks for Sen. Jeff Flake, who delivered a speech to the Senate on Jan. 17, 2018.\n\nMr. President, near the beginning of the document that made us free, our Declaration of Independence, Thomas Jefferson wrote: “We hold these truths to be self-evident...” So, from our very beginnings, our freedom has been predicated on truth. The founders were visionary in this regard, understanding well that good faith and shared facts between the governed and the government would be the very basis of this ongoing idea of America.\n\nStory Continued Below\n\nAs the distinguished former member of this body, Daniel Patrick Moynihan of New York, famously said: “Everyone is entitled to his own opinion, but not to his own facts.” During the past year, I am alarmed to say that Senator Moynihan’s proposition has likely been tested more severely than at", "comment_2": "Read transcript of Sen. Jeff Flake’s speech comparing Pres. Donald Trump to Josef Stalin https://t.co/Ch4nueMDwo", "comment_1": "Read transcript of Sen. Jeff Flake’s speech comparing Pres. Donald Trump to Josef Stalin https://t.co/t9VYO0kIGD", "split": "train", "label": "real"}
{"comment_3": "#Current Employment Statistics Highlights, Monthly - Bureau of Labor Statistics- https://t.co/4NisaiqtxF", "article": "TAPPER: Secretary Geithner thanks for joining us. Good to see you.\n\nSo, the administration has had a number of successes after big battles, stimulus, health care legislation, new rules for Wall Street, but you have a big battle coming when it comes to the Bush tax cuts.\n\nIf they remain in place, as Republicans want, it will cost three trillion dollars every ten years. The administration has said it wants to keep the ones for people who make under $200,000 a year, individuals and $250,000 for couples.\n\nThat will cost $2.5 trillion over 10 years.\n\nBen Bernanke the chairman of the Federal Reserve said that with the economic outlook unusually uncertain, extending the Bush tax cuts would have a stimulative effect on the economy. Is he right?\n\nGEITHNER: I don't think it should be a battle, Jake. You know, what the President's proposing to do is to leave in place, to extend tax cuts that go to more than 95 percent of working Americans and to leave in place tax cuts that are very important to incent businesses to hir", "comment_2": "@peskyspoll @dostert_michele @13_Heidi @FrankCundiff @heathdotson @Fahrenthold @realDonaldTrump @CNN @MSNBC… https://t.co/KgJtOhFxkV", "comment_1": "@PressSec and here is the Current Employment Statistics Highlight Report released Dec 8, 2017...again it states Manufacturing added 31K", "split": "train", "label": "real"}
{"comment_3": "Mi voto #Top30Rumbera es #Mehacefaltatuamor de @Raulcantante @Miguelsaezofici este en lista @Rumbera_Oficial", "article": "Need help? Contact the CQ Hotline at (800) 678-8511 or hotline@cqrollcall.com", "comment_2": "Does the New York Times want to become a Fox News affiliate? Will they ever run out of trump supporters to intervie… https://t.co/sBjQBxNip4", "comment_1": "１１歳の少年が学位取得、夢は天体物理学者　米大学（https://t.co/Ms9CTj2Uk6） https://t.co/ElUzk4BK3b", "split": "train", "label": "real"}
{"comment_3": "CDC released National Vital Statistics Report Vol. 64, No. 11, United States Life Tables, 2011 September 22, 2015.  Elizabeth .Arias, Ph.D.", "article": "Resource Not Available\n\nThe page you requested cannot be found at this time. It may be temporarily unavailable or it may have been removed or relocated.\n\nSee one of the following pages for possible options:", "comment_2": "National  Vital Statistics Report Vol 59, No 6 June 2011 https://t.co/8mPLZSZUx5", "comment_1": "Review CDC (Centers for Disease Control)  NVSR (National Vital Statistics Report),Vol.56 No.5 November 20,2007 Table 1 (to info below)", "split": "train", "label": "real"}
{"comment_3": "#Estonia Might Have The Most Efficient Tax Filing #System In The World http://t.co/ACJWqw3M #domesticmainstreamnews", "article": "Wikimedia Commons It's true.\n\nIt turns out that one reason why Estonia has been the lone feel-good story amidst the Eurozone crisis is that its tax filing system is scarily efficient.\n\nIntroduced in 2000, the system allows individual income taxes, business taxes and excises to be filed electronically.\n\nUsing a secure ID, a filer simply completes pre-made forms and approves the document with a digital signature.\n\nThe process takes an average of five minutes, and last year 94% of tax declarations were filed electronically.\n\nThe system is part of the country's impressive e-government initiative, which allows Estonians to do everything from vote to fill out prescriptions to look up school grades online.\n\nEstonians begin filing their taxes on Wednesday.", "comment_2": "Estonia Might Have The Most Efficient Tax Filing System In The World http://t.co/h9zG1C45 #tech #social @allisswel", "comment_1": "Estonia Might Have The Most Efficient Tax Filing System In The World- Here's Why: http://t.co/kKpy9aES", "split": "train", "label": "real"}
{"comment_3": "Peanut Product Recall Took Company Approval http://tinyurl.com/cj8bku", "article": "“That’s what Sasha eats for lunch probably three times a week,” Mr. Obama said. “And, you know, I don’t want to have to worry about whether she’s going to get sick as a consequence to having her lunch.”\n\nThe White House press secretary, Robert Gibbs, said Friday that Mr. Obama would soon announce a new F.D.A. commissioner and other officials. Mr. Gibbs said they would put in place a “stricter regulatory structure” to prevent breakdowns in food-safety inspections.\n\nPart of the review is sure to examine whether the requirement for the peanut company’s approval caused delays in warnings about its products once public health officials became aware of significant problems at its plant in Blakely, Ga. The warning also covered products from the company’s customers that manufacture food, including Kellogg.\n\nA representative for the peanut company would not comment. Kris Charles, a Kellogg spokeswoman, said “Kellogg acted quickly and recalled potentially impacted products within hours” of the peanut company’s second r", "comment_2": "Peanut Product Recall Took Company Approval - New York Times: Washington PostPeanut Product Recall Took Company ApprovalNew York Times&nb..", "comment_1": "Peanut Product Recall Took Company Approval  http://tinyurl.com/ddl9qz", "split": "train", "label": "real"}
{"comment_3": "@y2m_acog @acogchicago @endurer . R.A.W Real About Worship. @ Apostolic Church of God - Chicago https://t.co/5OG7JJYyvt", "article": "Remarks of Senator Barack Obama: Apostolic Church of God\n\nChicago, IL | June 15, 2008\n\nGood morning. It's good to be home on this Father's Day with my girls, and it's an honor to spend some time with all of you today in the house of our Lord.\n\nAt the end of the Sermon on the Mount, Jesus closes by saying, “Whoever hears these words of mine, and does them, shall be likened to a wise man who built his house upon a rock: and the rain descended, and the floods came, and the winds blew, and beat upon that house, and it fell not, for it was founded upon a rock.” [Matthew 7: 24-25]\n\nHere at Apostolic, you are blessed to worship in a house that has been founded on the rock of Jesus Christ, our Lord and Savior. But it is also built on another rock, another foundation – and that rock is Bishop Arthur Brazier. In forty-eight years, he has built this congregation from just a few hundred to more than 20,000 strong – a congregation that, because of his leadership, has braved the fierce winds and heavy rains of violence and", "comment_2": "@BeachBumKel @RickeySmiley Awesome. We will be in Chicago Friday September  28th at Apostolic Church Of God", "comment_1": "Bishop Thomas Weeks, Sr. is preaching!! He is killing it at Apostolic Church of God in Chicago tonight!", "split": "train", "label": "real"}
{"comment_3": "Most heroin in U.S. now comes across Mexican border, Rob Portman says | PolitiFact Ohio https://t.co/iRwGbdW8yg", "article": "\"We understand that this heroin is primarily coming from Mexico, over the border.\"\n\nOhio Sen. Rob Portman has been busy in Washington touting the Comprehensive Addiction Recovery Act in response to a shocking number of heroin overdoses in Ohio.\n\nThe bill just passed in the Senate, 94-1. (Nebraska Sen. Ben Sasse was the sole \"nay,\" saying he believes that fighting addiction is a local issue.)\n\nOhio ranks high on the list of states reeling from the national epidemic. In Montgomery County, which encompasses Dayton, Ohio, heroin-related deaths increased 225 percent between 2011 and 2015.\n\nBack in the 1970s, the heroin on U.S. streets was the \"black tar\" variety, and much of it came from southeast Asia. In 2010, 80 percent of the heroin in the world came from poppy fields in Afghanistan, according to the Office of National Drug Control Policy.\n\nSo when Portman said that most of the heroin in America comes from Mexico’s border, we were skeptical.\n\nPortman, it turns out, has done his homework. The Drug Enforcement A", "comment_2": "@T_E_Conroy @rikersit @jbbuzbee @Cherryh59 @tworae @CGanalysis @sunsouders @BrookeBCNN @CNN @FBI Claim: \"Most heroi… https://t.co/7h7heOw4BZ", "comment_1": "@realDonaldTrump @DaveBratVA7th VOTE REPUBLICAN \n\nBUILD THE WALL FOR YOUR KIDS\n\nMost heroin in U.S. now comes acros… https://t.co/HxEs9SHoLU", "split": "train", "label": "real"}
{"comment_3": "RT @PolitiFact: Here's our annotated transcript of the second presidential debate https://t.co/o8rEe4iylt https://t.co/T8SfgmdBLb", "article": "By PolitiFact staff\n\nPolitiFact is annotating the second presidential debate at Washington University. We will be posting the transcript and our annotations through the night. Follow us on Medium and check back regularly to see our commentary.\n\nRADDATZ: Ladies and gentlemen the Republican nominee for president, Donald J. Trump, and the Democratic nominee for president, Hillary Clinton.\n\nCOOPER: Thank you very much for being here. We’re going to begin with a question from one of the members in our town hall. Each of you will have two minutes to respond to this question. Secretary Clinton, you won the coin toss, so you’ll go first. Our first question comes from Patrice Brock. Patrice?\n\nQUESTION: Thank you, and good evening. The last debate could have been rated as MA, mature audiences, per TV parental guidelines. Knowing that educators assign viewing the presidential debates as students’ homework, do you feel you’re modeling appropriate and positive behavior for today’s youth?\n\nCLINTON: Well, thank you. Are you", "comment_2": "Read it and weep “PolitiFact’s annotated transcript of the second presidential debate” @PolitiFact https://t.co/1rbHJKcUDe", "comment_1": "PolitiFact’s annotated transcript of the second presidential debate https://t.co/vhdNLalEFH", "split": "train", "label": "real"}
{"comment_3": "I should really draw instead of playing Monster Hunter but here I am, being stepped on by a pink dinosaur for the 28th time", "article": "If you check the \"Remember me\" box, you will be automatically signed in for 30 days to TIME.com when you visit in the future.\n\nIf you are accessing TIME.com on a public computer, you are advised not to click on the \"Remember me\" option.\n\nFor more information, please visit TIME's Privacy Policy", "comment_2": "@calliecatte talk to me about monster hunter in the mooornniiiiing.", "comment_1": "@paleowire (1) The kids are quoted as saying they'd found a dinosaur bone. (2) The article calls the kids \"dinosaur… https://t.co/MPF9lAclII", "split": "train", "label": "real"}
{"comment_3": "#LITechNews: WATCH LIVE: House Minority Leader Pelosi holds weekly news conference #Conference https://t.co/gUvAr75643", "article": "House Minority Leader Nancy Pelosi on Thursday urged Congress to hike the hourly minimum wage dramatically.\n\n\n\nNoting that Wall Street this week is trading at record-high levels, the California Democrat said those gains have done nothing to benefit middle-class workers, and called on Congress to close the gap.\n\n\n\n\"This week, we saw something quite remarkable, the stock market soaring to record heights. At the same time, we see productivity keeping pace,\" Pelosi told reporters in the Capitol. \"But we don't see income for America's middle class rising. In fact, it's been about the same as since the end of the Clinton years.\"\n\n\n\nADVERTISEMENT\n\nPelosi said the negative effects of wage stagnation on the middle class have been compounded by the bursting of the housing bubble and the recession that followed. She urged Congress to take up legislation — sponsored by Sen.(D-Iowa) and Rep. George Miller (D-Calif.) — to hike the minimum wage from $7.25 to $10.10 over three years, while indexing future increases to inflat", "comment_2": "(Republicans, Democrats fight over infrastructure plans By Reuters) - https://t.co/kelnEOj3vj -… https://t.co/1y8ml98VCV", "comment_1": "(U.S. Democrats push $1 billion bill for election security By Reuters) - https://t.co/X8loAIubQ6 -… https://t.co/gtFXWXzRmI", "split": "train", "label": "real"}
{"comment_3": "Exciting and fun week ahead: seminar on social networking &amp; NLRA, YWCA presentation, ACG mtg &amp; luncheon with US Attorney General Eric Holder", "article": "Attorney General Eric Holder delivered remarks on criminal justice and sentencing reform at a National Press Club Speakers luncheon on Feb. 17, 2015.", "comment_2": "Tuesday Morning Splash: What’s Happening\n— Luncheon with Attorney General Eric Holder at the N... http://t.co/AEDvi9YPnh via @fishbowldc", "comment_1": "So happy to be @ IL Judges Association luncheon with keynote AG Eric Holder @ISBAmembership @TheJusticeDept http://t.co/0dhZw9YLCe", "split": "train", "label": "real"}
{"comment_3": "President Barack Obama speaks about the economy, Wednesday, July 24, 2013, at Knox College in Galesburg, Ill. Se ...  http://t.co/bUI9O6Yus5", "article": "Knox College\n\nGalesburg, Illinois\n\n12:13 P.M. CDT\n\n\n\nTHE PRESIDENT: Hello, Galesburg! (Applause.) Well, it’s good to be home in Illinois! (Applause.) It is good to be back. It’s good to be back. Thank you. Thank you so much, everybody. (Applause.) Thank you. Everybody, have a seat, have a seat. Well, it is good to be back.\n\n\n\nI want to, first of all, thank Knox College -- (applause) -- I want to thank Knox College and your president, Teresa Amott, for having me here today. Give Teresa a big round of applause. (Applause.) I want to thank your Congresswoman, Cheri Bustos, who’s here. (Applause.) We've got Governor Quinn here. (Applause.) I'm told we've got your Lieutenant Governor, Sheila Simon, is here. (Applause.) There she is. Attorney General Lisa Madigan is here. (Applause.)\n\n\n\nI see a bunch of my former colleagues, some folks who I haven't seen in years and I'm looking forward to saying hi to. One in particular I've got to mention, one of my favorites from the Illinois Senate -- John Sullivan is in the ho", "comment_2": "President Obama is delivering a speech on the economy today at Knox College in Galesburg, Ill. Watch it here: http://t.co/gmOi0y29DK", "comment_1": "LIVE VIDEO: President Obama speaks on economy in Galesburg, Ill., at Knox College... NOW http://t.co/OzwpI3KXgf", "split": "train", "label": "real"}
{"comment_3": "ON THIS DATE Aug 27 1992 - Ep 59 \"Brother, Can You Spare Two Dimes?\" (8F23) first aired. http://t.co/0M93eCZ9", "article": "Clinton said, \"Trump Management was charged with discriminating against African-Americans and breaking federal law.\"\n\nThe government in 1973 accused Trump, his father and Trump Management of violating the Fair Housing Act, part of the Civil Rights Act of 1968. The case alleged Trump’s realty company discriminated against non-white tenants and potential tenants at numerous apartment complexes.\n\nThe government settled the lawsuit, after Trump waged a years-long legal battle, so Trump never admitted guilt. But the company did agree to comply with extensive requirements intended to stop housing discrimination at its properties.\n\nClinton’s claim is carefully phrased. For that, we rate her claim True.", "comment_2": "\"Oh Nasingpet Unay Anggut\" sang by Antonio M. Albornoz was #first aired on Aug 27, 1930", "comment_1": "List of first eps of shows aired in Tulsa for Jul 27, 2011 to Aug 9, 2011 http://tf.to/4ePC", "split": "train", "label": "real"}
{"comment_3": "CNN’s Borger Slams Giuliani for ‘Hateful’ Comments, He ‘Hijacked’ the Debate: On Sunday’s State of the Union, ... http://t.co/GbVuUBRMxd", "article": "About This Show\n\nFrom the country’s major political and policy issues to diplomacy on the global stage, State of the Union with Candy Crowley brings in the world’s top newsmakers and analysts to deliver the smartest, most comprehensive look at what matters most to you. Sundays at 9am and Noon ET.\n\n\n\nSend Feedback | Subscribe | About Candy Crowley", "comment_2": "OK State of the Union @CNN Interesting dissection of Trump's comments - it sure will be a 'gory' 2016 as America decides", "comment_1": "@LJaaaaankins @FlunckyJoe @joelpollak @ScottAdamsSays \"I don't know anything about David Duke.\"\n\n— Donald Trump on… https://t.co/5isFQWihuP", "split": "train", "label": "real"}
{"comment_3": "Who brought the hotel in under budget and on time?  At Trump hotel site, immigrant workers wary - WaPo https://t.co/5SxzzauiI6", "article": "Workers leave the site of the future Trump International Hotel, which is at the site of the Old Post Office Pavilion in Washington. (Matt McClain/The Washington Post)\n\nFor weeks, dozens of construction workers from Latin America have streamed onto the site of the Old Post Office Pavilion in downtown Washington and taken pride in their work building one of the city’s newest luxury hotels.\n\nBut that job site is now laden with tension after the man behind the project — billionaire developer Donald Trump — put himself at the center of the nation’s debate over illegal immigration.\n\n[Democrats cheer as Donald Trump surges in the polls]\n\nTrump garnered headlines — and prompted several business associates to sever relations with him — when he launched his bid for the Republican presidential nomination last month with a controversial description of drug dealers and “rapists” crossing the border each day into the United States from Mexico.\n\nBut a Trump company may be relying on some undocumented workers to finish the $", "comment_2": "\"At Trump hotel site, immigrant workers wary,\" by @aolivo in @washingtonpost http://t.co/FFpoVFrOw5", "comment_1": "At Trump hotel site, immigrant workers wary http://t.co/GOByXbmbzH", "split": "train", "label": "real"}
{"comment_3": "Reading: Op-ed by President Obama: President Obama Reflects on the Impact of Title IX  http://t.co/Kw3rQC8P", "article": "The full text of the op-ed by President Barack Obama is printed below. The piece was published today in Newsweek.\n\nPresident Obama Reflects on the Impact of Title IX\n\nBy President Obama\n\nCoaching my daughter Sasha’s basketball team is one of those times when I just get to be “Dad.” I snag rebounds, run drills, and have a little fun. More importantly, I get to watch Sasha and her teammates improve together, start thinking like a team, and develop self-confidence.\n\nAny parent knows there are few things more fulfilling than watching your child discover a passion for something. And as a parent, you’ll do anything to make sure he or she grows up believing she can take that ambition as far as she wants; that your child will embrace that quintessentially American idea that she can go as far as her talents will take her.\n\nBut it wasn’t so long ago that something like pursuing varsity sports was an unlikely dream for young women in America. Their teams often made do with second-rate facilities, hand-me-down uniforms, ", "comment_2": "(press office) Op-ed by President Obama: President Obama Reflects on the Impact of Title IX: \n\tThe full text of ... http://t.co/oubekcbO", "comment_1": "Op-ed by President Obama: President Obama Reflects on the Impact of Title IX: \n\tThe full text of the op-ed by Pr... http://t.co/ZLu7gmrP", "split": "train", "label": "real"}
{"comment_3": "RelNews: Podcast: How Donald Trump is raising the racial stakes this election -MLive.com- https://t.co/PuIOc5zgpv", "article": "- June 22, 2016 -\n\nDonald J. Trump on the Stakes of the Election\n\nDownload PDF\n\nToday I‘d like to share my thoughts about the stakes in this election.\n\nPeople have asked me why I am running for President.\n\nI have built an amazing business that I love and I get to work side-by-side with my children every day.\n\nWe come to work together and turn visions into reality.\n\nWe think big, and then we make it happen.\n\nI love what I do, and I am grateful beyond words to the nation that has allowed me to do it.\n\nSo when people ask me why I am running, I quickly answer: I am running to give back to this country which has been so good to me.\n\nWhen I see the crumbling roads and bridges, or the dilapidated airports, or the factories moving overseas to Mexico, or to other countries, I know these problems can all be fixed, but not by Hillary Clinton – only by me.\n\nThe fact is, we can come back bigger and better and stronger than ever before --Jobs, jobs, jobs!\n\nEverywhere I look, I see the possibilities of what our country coul", "comment_2": "DONALD J. TRUMP ON THE STAKES OF THE ELECTION\n\nToday I‘d like to share my thoughts about the stakes in this... https://t.co/0tcrhigMq6", "comment_1": "Full transcript: Donald Trump NYC speech on stakes of the election https://t.co/rMGA8zoc7N @giacupcake", "split": "train", "label": "real"}
{"comment_3": "Ten Things You Don't Know about Merissa McCain and Margaret Madigan, the authors of HERO FOR HIRE.  Enter to win... http://t.co/k5Ar2hVCZl", "article": "10 things to know about McCain\n\nFor all the coverage this week of Senator John McCain's background, there are some important things you won't learn about him from the TV networks. His carefully crafted positive image relies on people not knowing this stuff—and you might be surprised by some of it.\n\nPlease check out the list below, and then forward it to your friends, family, and coworkers. We can't rely on the media to tell folks about the real John McCain—but if we all pass this along, we can reach as many people as CNN Headline News does on a good night.\n\nClick here to tell us how many people you can pass it on to—and to see our progress nationally:\n\nhttp://pol.moveon.org/mccain10/\n\n10 things you should know about John McCain (but probably don't):\n\nJohn McCain voted against establishing a national holiday in honor of Dr. Martin Luther King, Jr. Now he says his position has \"evolved,\" yet he's continued to oppose key civil rights laws.1 According to Bloomberg News, McCain is more hawkish than Bush on Iraq, R", "comment_2": "Here's Ten Things You Need to Know Today: Questions About Mccain's Unannounced Trip, Newborn Rescued From Toilet Pipe http://t.co/dA5qw3yYYp", "comment_1": "@Schumer @SenateMajLdr @GOPLeader @Jim_Jordan @Pelosi @realDonaldTrump  -- You better know there are tens of thousa… https://t.co/NO0bOdeyIT", "split": "train", "label": "real"}
{"comment_3": "Newt Gingrich: \"We are entering a dark period where freedom of speech becomes intimidation by the left...”  The Dem… https://t.co/TQ0uHQKglY", "article": "Remarks of Senator Obama: The War We Need to Win\n\nWashington, DC | August 01, 2007\n\nSenator Barack Obama presents his comprehensive five part plan for fighting terrorism worldwide in Washington D.C.; Abu Ghrahib; afghanistan; Barack Obama; Guantanamo; Iraq; pakistan; terrorism; United States; War; Senator Barack Obama presents his comprehensive five part plan for fighting terrorism worldwide in Washington D.C. (part 1); Abu Ghrahib; afghanistan; Barack Obama; Guantanamo; Iraq; pakistan; terrorism; United States; War; http://link.brightcove.com/services/link/bcpid1126056719 http://www.brightcove.com/channel.jsp?channel=353512430\n\nThank you Lee, for hosting me here at the Wilson Center, and for your leadership of both the 9/11 Commission and the Iraq Study Group. You have been a steady voice of reason in an unsteady time.Let me also say that my thoughts and prayers are with your colleague, Haleh Esfandiari, and her family. I have made my position known to the Iranian government. It is time for Haleh to be relea", "comment_2": "Mr. President.  Sick of Putin.  Unless this will end the war in Syria, can we go back to the Wall and ending illega… https://t.co/Q3htGjSBOo", "comment_1": "Glad you won the battle. Now we need to win the war on our freedom of speech on these social media platforms https://t.co/jJh4zTWRjb", "split": "train", "label": "real"}
{"comment_3": "Laws Affecting Reproductive Health and Rights:\n2014 State Policy Review  http://t.co/5dcojpURlB", "article": "by Elizabeth Nash, Rachel Benson Gold, Andrea Rowan, Gwendolyn Rathbun and Yana Vierboom\n\nReproductive health and rights were once again the subject of extensive debate in state capitols in 2013. Over the course of the year, 39 states enacted 141 provisions related to reproductive health and rights. Half of these new provisions, 70 in 22 states, sought to restrict access to abortion services. In sharp contrast to this barrage of abortion restrictions, a handful of states adopted measures designed to expand access to reproductive health services. Most notably, California enacted the first new state law in more than seven years designed to expand access to abortion, and five states adopted measures to expand access to comprehensive sex education, facilitate access to emergency contraception for women who have been sexually assaulted and enable patients’ partners to obtain STI treatment.\n\nAbortion\n\nTwenty-two states enacted 70 abortion restrictions during 2013. This makes 2013 second only to 2011 in the number o", "comment_2": "\"Laws Affecting Reproductive Health and Rights: 2015 State Policy Review\" https://t.co/2lmBxNLPRc 米国各州の中絶関連法", "comment_1": "Laws Affecting Reproductive Health and Rights: 2013 State Policy Review https://t.co/00BkNaZKF2", "split": "train", "label": "real"}
{"comment_3": "Judicial Watch filed a FOIA lawsuit w/ the Justice Dept for any memos that may have been written by fired FBI Direc… https://t.co/UDyi7M5xUv", "article": "Political Figures: C (p. 2) Chris Christie | Wesley Clark | James Comey | Ted Cruz | Andrew Cuomo Gov. Chris Christie (R - New Jersey) McClatchy-Marist Poll. July 5-9, 2016. N=650 registered voters nationwide. Margin of error ± 3.8. . \"Overall, do you have a favorable or an unfavorable impression of Chris Christie?\" . Favorable Unfavorable Never\n\nheard of Unsure % % % % 7/5-9/16 34 50 7 9 ABC News/Washington Post Poll. Jan. 6-10, 2016. N=1,000 adults nationwide. Margin of error ± 4. \"Overall, do you have a favorable or unfavorable impression of Chris Christie?\" Favorable Unfavorable No opinion % % % 1/6-10/16 35 47 18 5/28-31/15 22 48 29 3/26-29/15 26 51 24 1/20-23/14 35 40 25 CNN/ORC Poll. Dec. 17-21, 2015. N=1,018 adults nationwide. Margin of error ± 3. . \"We'd like to get your overall opinion of some people in the news. As I read each name, please say if you have a favorable or unfavorable opinion of these people -- or if you have never heard of them. Chris Christie.\"\n\n2012: \"New Jersey Governor Chris Chri", "comment_2": "@realDonaldTrump @drum10thmtn @USArmy @USNavy @usairforce @USMC remember this\nMurder https://t.co/zpW26Dgvl4\nMass m… https://t.co/s75DqSgsTP", "comment_1": "@McFaul So its not ok for Russia to meddle in our democracy but it totally fine if we do it to others?\n\nhttps://t.co/P2OhgoD3W0", "split": "train", "label": "real"}
{"comment_3": "Interview with U.S. Economist Larry Summers: 'The Very People Who Voted for Trump Will Suffer' https://t.co/XtLmrHteCL via @SPIEGELONLINE", "article": "DONALD TRUMP, the President of the United States, along with Steve Mnuchin, the treasury secretary, and Gary Cohn, the director of the National Economic Council, sat down for a conversation with editors from The Economist on May 4th, 2017. What follows is a lightly edited transcript.\n\nThe Economist: Could we start with the economy?\n\nDonald Trump: Sure.\n\nGet our daily newsletter Upgrade your inbox and get our Daily Dispatch and Editor's Picks.\n\nWhat is Trumponomics and how does it differ from standard Republican economics?\n\nWell it’s an interesting question. I don’t think it’s ever been asked quite that way. But it really has to do with self-respect as a nation. It has to do with trade deals that have to be fair, and somewhat reciprocal, if not fully reciprocal. And I think that’s a word that you’re going to see a lot of, because we need reciprocality in terms of our trade deals. We have nations where…they’ll get as much as 100% of a tax or a tariff for a certain product and for the same product we get nothing", "comment_2": "The Original \"Woke\" Economist: An Interview with Dr. Thomas Sowell, Part II https://t.co/qylzdLGhXr", "comment_1": "@alistairhann @TheEconomist Excellent interview with William MacAskill on the same topic - https://t.co/U6G2hYtJ5u", "split": "train", "label": "real"}
{"comment_3": "@USDOL - eagerly anticipating Secretary Perez's remarks in Philadelphia today.", "article": "Need help? Contact the CQ Hotline at (800) 678-8511 or hotline@cqrollcall.com", "comment_2": "McNabb Career Done With Latest Remarks?: Former Philadelphia Eagles star Donovan McNabb is back in the news for ... http://t.co/qi7vao9C", "comment_1": "@HillaryClinton has concluded her remarks in Philadelphia. @wdet", "split": "train", "label": "real"}
{"comment_3": "Transcript: Obama's prime-time press briefing http://jijr.com/mFV", "article": "And that is why the single most important part of this Economic Recoveryand Reinvestment Plan is the fact that it will save or create up to 4million jobs, because that's what America needs most right now.\n\nIt is absolutely true that we can't depend on government alone to create jobs or economic growth. That is and must be the roleof the private sector. But at this particular moment, with theprivate sector so weakened by this recession, the federal government isthe only entity left with the resources to jolt our economy backinto life. It is only government that can break the vicious cyclewhere lost jobs lead to people spending less money, which leads to evenmore layoffs. And breaking that cycle is exactly what the planthat's moving through Congress is designed todo.\n\nWhen passed, this plan will ensure thatAmericans who'velost their jobs through no fault of their own can receivegreater unemployment benefits and continue their health carecoverage. We will also provide a $2,500 tax credit to folks who are struggl", "comment_2": "My Unemployment Tips : Transcript: Obama's prime-time press briefing http://tinyurl.com/cto676", "comment_1": "Transcript: Obama's prime-time press briefing http://bit.ly/LCQe", "split": "train", "label": "real"}
{"comment_3": "Melania Trump Hired Exorcist To Cleanse White House Of Obama Demons https://t.co/X9fEQKWq4E https://t.co/bSkYlKGMAc", "article": "First Lady Melania Trump demanded the White House undergo a complete exorcism, with “pagan idols and demonic artifacts” from “the Clinton and Obama years” removed from the premises before she would set foot in the building, according to White House pastor Paul Begley.\n\n“I’m not going to go into that White House unless it has been completely exorcised,” Melania Trump told Pastor Begley.\n\n“They cleansed the White House,” the pastor said. “They had people in there anointing it with oil and praying everywhere.”\n\nAfter the First Lady had finished removing pagan and demonic items, only one thing was left – a cross on the wall. The White House is now free of all pagan gods and idols, and contains only Christian iconography.\n\n“Because apparently during the eight years when Obama was there, and maybe even some of the presidents before him, there were all kinds of idol gods and images and all kinds of artifacts in there that were demonic, even some of the stuff from the Clinton era,” Begley said.\n\nThe White House pasto", "comment_2": "#MelaniaTrump Hired Exorcist To ‘Cleanse White House Of #Obama Demons’ https://t.co/TkF7KJLKF5 @yournewswire 님이 공유", "comment_1": "Melania Trump Hired Exorcist To ‘Cleanse White House Of Obama Demons’ | WUC-News https://t.co/QrbbOeyKFM", "split": "test", "label": "fake"}
{"comment_3": "Executive Order Leads to Capture of ISIS Leader, Rasheed Muhammad – NewPoliticsToday https://t.co/iy2GuCkHXG", "article": "SORRY GUYS AND GALS\n\nSORRY GUYS AND GALS\n\nSORRY GUYS AND GALS\n\nSORRY GUYS AND GALS\n\nSORRY GUYS AND GALS\n\nExecutive Order Leads to Capture of ISIS Leader, Rasheed Muhammad\n\nDiscussion in ' National ' started by kwflatbed , .\n\nSearch tags for this page", "comment_2": "Executive Order Leads to Capture of ISIS Leader, Rasheed Muhammad https://t.co/NHWvwNiiyJ", "comment_1": "Executive Order Leads to Capture of ISIS Leader, Rasheed Muhammad https://t.co/oaEbE5i7Ay", "split": "test", "label": "fake"}
{"comment_3": "Obama’s Tax- Skipping – Audit Shows Millions In Offshore Accounts https://t.co/W2JR5cFWxW via @Conservative Info", "article": "3265 April 27, 2017\n\n“Kim Jong-Un is clearly in a position to threaten Hawaii today, in my opinion,” Adm. Harry Harris, the chief of U.S. Pacific Command, told the House Armed Services Committee. “I have suggested that we consider putting interceptors in Hawaii that . . . defend (it) directly, and that we look at a defensive Hawaii radar.”\n\nThe imminent conflict with North Korea is beginning to become very real.According to one U.S. military officer, the communist country, headed-up by Kim Jong-Un, is targeting Hawaii.reports:The Pentagon needs to consider deploying new anti-ballistic missile systems and a defensive radar to Hawaii to protect against a growing threat from North Korea, the top U.S. military officer in the Pacific told Congress on Wednesday.The U.S. currently has anti-missile interceptors at Vandenberg Air Force Base in California and in Fort Greely, Alaska.Harris was repeatedly questioned by lawmakers from Hawaii on the threat posed to their state.The current defense architecture “is sufficien", "comment_2": "Obama’s Tax- Skipping – Audit Shows Millions In Offshore Accounts https://t.co/la8n3Oc6iY via @Conservative Info", "comment_1": "Obama’s Tax Skipping – Audit Shows Millions In Offshore Accounts https://t.co/Ef4NMt3iVJ via @YouTube", "split": "test", "label": "fake"}
{"comment_3": "Queen Elizabeth Removes Obamas From Royal Wedding Guest List https://t.co/OMuff9vjjQ", "article": "The guest list hasn’t been set for the royal wedding of Prince Harry and Meghan Markle, but a number of things could stand in the way of President Donald Trump getting an invite.\n\nBut a former U.S. president might make the list, due to his friendship with the young British royal: Barack Obama and his wife, former first lady Michelle, who appear to have amiable relations with Harry and his elder brother and future king, Prince William, the Duke of Cambridge.\n\nAsked about the potential guest list, Kensington Palace spokeswoman Julie Barley told Newsweek, “We’re focusing on the happy announcement of their engagement,” adding that invitations “will be announced in due course.”\n\nKeep up with this story and more by subscribing now\n\nMark Blinch/Reuters\n\nWhen the Duke and Duchess of Cambridge were married, in 2011, the Obamas were left off the guest list because of the added security costs of protecting the president. The day of the wedding, thousands of Britons took the day off, and about 1,900 guests attended the c", "comment_2": "Queen Elizabeth Removes Obamas From Royal Wedding Guest List https://t.co/NXLKqC0kTW\nGood for you Queen Elizabeth! 🏴󠁧󠁢󠁥󠁮󠁧󠁿 \nRT", "comment_1": "Queen Elizabeth Removes Obamas From Royal Wedding Guest List https://t.co/MxjPSnVa6o https://t.co/I8d8zSfw6g", "split": "test", "label": "fake"}
{"comment_3": "Asswipe @BarackObama\n\nObama Administration Kept Illegal Mexican Kids In Detention Camps As \"Experiment\". https://t.co/pnhcZ8v4KW", "article": "It was June 2014 when the Washington Post reported that illegal immigrants, “including thousands of women and children, stream into south Texas. It was nine months late when the same paper reported that Obama’s border agents were tossing some of those kids into internment camps as an experiment.\n\nIt was called the Juvenile Referral Process, and it worried human rights groups Mexican officials who feared that it put the kids at risk. The program was the creation of Robert Harris who at the time U.S. Customs and Border Protection commander of the Laredo sector. Harris believed holding certain young Mexicans, believed to be working for cartels in detention serves to get these kids out of the smuggling enterprise. Believed is the operative word, There were no judges, no charges– no trial–just belief.\n\nHis intelligence analysts estimated that 78 percent of the guides smuggling other migrants were Mexicans younger than 18 — teenagers often hired or conscripted by drug cartels that knew they would not be prosecuted ", "comment_2": "@foxandfriends   True and From Wash Post —&gt;Obama Administration Kept Illegal Mexican Kids In Detention Camps As \"Ex… https://t.co/a2TBDCyON4", "comment_1": "Obama Administration Kept Illegal Mexican Kids In Detention Camps As \"Experiment\" https://t.co/O1QWotrmN9", "split": "test", "label": "fake"}
{"comment_3": "Investigators: Anthony Bourdain Was Killed By Clinton Operatives\nhttps://t.co/Zbbj3mnkYL\n@TuckerCarlson… https://t.co/KL2HyK4SiG", "article": "Anthony Bourdain had been harassed and threatened by Hillary Clinton operatives just weeks before he was found dead in an apparent “suicide.”\n\nAccording to investigators, Mr. Bourdain was planning to expose pedophile rings connected to Hollywood and D.C. shortly before his death.\n\nHis body found Friday after reportedly hanging himself. He was just 61 years old.\n\nBourdain was fierce critic of Harvey Weinstein and denounced the serial sexual abuser, calling for swift justice to be served.\n\nDuring his condemnation of Weinstein, he publicly stated that Hillary Clinton had full knowledge of the sexual abuse, and had done so “for years”:\n\n“know what Hillary Clinton is NOT? She’s not stupid. Or unsophisticated about the world. The Weinstein stories had been out there for years.”\n\n..and I am in no way an HRC fan. I’ve been on the receiving end of her operatives’ wrath. And it ain’t fun, — Anthony Bourdain (@Bourdain) May 2, 2018\n\nIt’s no secret that people who cross the Clinton’s wind up dead … mostly from suicide. J", "comment_2": "Investigators: \nAnthony Bourdain Was Killed \nBy Clinton Operatives\nhttps://t.co/Hr2Zue1wgv https://t.co/ZbgCtUWzR8", "comment_1": "Investigators: Anthony Bourdain Was Killed By Clinton Operatives https://t.co/WMLUN5piO1 via @YouTube", "split": "test", "label": "fake"}
{"comment_3": "300,000 Pounds of Rat Meat Sold as Chicken Wings Across America https://t.co/tXTv9Knure", "article": "Fact Check Fact-Check Quick Rate Ratings Ratings Scores represent the weighted public opinion of the quality of this article based on political spin, trust, accuracy, and relevance. To see the current scores for this article, tap Ratings. 31% Score Share\n\n\n\n\n\nFlag\n\n\n\n– The Food and Drug Administration (FDA) is concerned about an estimated 300,000 pounds of counterfeit rat meat that has been sold as chicken wings in restaurants and grocery stores across America. FDA inspectors raised concerns when several illegal containers originatin..", "comment_2": "300,000 Pounds of Rat Meat Sold as Chicken Wings Across America https://t.co/9zb2Unv5w5", "comment_1": "300,000 Pounds of Rat Meat Sold as Chicken Wings Across America \n\nhttps://t.co/jb91XUPNu9\nI am ready to hurl!!! Really?!", "split": "test", "label": "fake"}
{"comment_3": "BREAKING: Intel Officer Reveals Obama Could Be ‘First President In History’ To Be Hit With a FELONY INDICTMENT https://t.co/Yw1BQZ6Vld", "article": "Account Suspended\n\nThis Account has been suspended. Contact your hosting provider for more information.\n\n", "comment_2": "BREAKING: Intel Officer Reveals Obama Could Be ‘First President In History’ To Be Hit With a FELONY INDICTMENT - https://t.co/UDFTtGoecZ", "comment_1": "BREAKING: Intel Officer Reveals Obama Could Be ‘First President In History’ To Be Hit With a FELONY INDICTMENT - https://t.co/oY6JWHaYq1", "split": "test", "label": "fake"}
{"comment_3": "“None of this is normal”: read the full transcript of Sen. Jeff Flake’s blistering retirement speech… https://t.co/J4GjQhcVDz", "article": "poster=\"http://v.politico.com/images/1155968404/201801/319/1155968404_5713627373001_5713606670001-vs.jpg?pubId=1155968404\" true Full text: Jeff Flake on Trump speech transcript\n\nPrepared remarks for Sen. Jeff Flake, who delivered a speech to the Senate on Jan. 17, 2018.\n\nMr. President, near the beginning of the document that made us free, our Declaration of Independence, Thomas Jefferson wrote: “We hold these truths to be self-evident...” So, from our very beginnings, our freedom has been predicated on truth. The founders were visionary in this regard, understanding well that good faith and shared facts between the governed and the government would be the very basis of this ongoing idea of America.\n\nStory Continued Below\n\nAs the distinguished former member of this body, Daniel Patrick Moynihan of New York, famously said: “Everyone is entitled to his own opinion, but not to his own facts.” During the past year, I am alarmed to say that Senator Moynihan’s proposition has likely been tested more severely than at", "comment_2": "“None of this is normal”: read the full transcript of Sen. Jeff Flake’s blistering retirement speech https://t.co/JqzmsJTBoQ via @voxdotcom", "comment_1": "“None of this is normal”: read the full transcript of Sen. Jeff Flake’s blistering retirement speech https://t.co/OneAxA2GIe via @voxdotcom", "split": "test", "label": "fake"}
{"comment_3": "President Trump Signs Executive Order Stripping NFL Of ‘Non Profit’ Status", "article": "The federal government grants some businesses the ability to pay reduced or no taxes because they are set up as a “non-profit.” The NFL is one of those businesses – or was, until Sunday evening when Donald Trump quietly signed an executive order removing the sports league’s non-profit status.\n\nThe order notes the un-American attitude displayed by the players, who repeatedly kneel during the National Anthem, burn flags in their locker rooms, and disrespect our country in every way imaginable.\n\nTo date, little has been done to stop players from disrespecting our military, our flag, and all they stand for, so President Trump “temporarily” revoked their 401(c)(3) status “until it is clear that players and team owners respect their country.”\n\nThe NFL will be classified as a for-profit entity for tax purposes for the 2017 fiscal year, but the order allows the league to re-apply for tax-exempt status in January 2018 “if all of the problems are solved.”\n\nThe White House spokeswoman told Breitbart News that the Presid", "comment_2": "President Trump Signs Executive Order Stripping NFL Of ‘Non Profit’ Status: https://t.co/ci9AYoUgwW via @YouTube", "comment_1": "#BREAKING\nPresident Trump Signs Executive Order Stripping NFL Of ‘Non Profit’ Status https://t.co/rOpUSsFKBH via @YouTube", "split": "test", "label": "fake"}
{"comment_3": "NEW LAW Now Charging ALL VIOLENT Protesters With Terrorism, Spread the News and SHARE THIS!! https://t.co/yDkyn2R6lI", "article": "A version of this action that uses less javacript and may be usable for those who don't use javascript is available at https://actionnetwork.org/petitions/urgent-new-law-would-charge-protesters-with-terrorism?nowrapper=true&referrer=&source=", "comment_2": "NEW LAW Now Charging ALL VIOLENT Protesters With Terrorism, Spread the News and SHARE THIS!! https://t.co/VKPrRl4CuG", "comment_1": "NEW LAW NOW CHARGING ALL VIOLENT PROTESTERS WITH TERRORISM, SPREAD THE NEWS AND SHARE THIS!! https://t.co/6aswCBA8i7", "split": "test", "label": "fake"}
{"comment_3": "Clinton Body Count Series #5: Woman Set to Testify Against Clintons Blown Up in Home Explosion https://t.co/dMhNx2HRzE #news", "article": "Photo credit: infowars.com\n\nNew Jersey couple dies in a home explosion. Caroline Paladino was apparently set to testify to Grand Jury against the Clintons this week..\n\nHouse explosion in New Jersey {Video below}\n\n<div style=\"width:100%;text-align:center;margin:0 auto;\"><iframe width=\"360\" height=\"202\" src=\"https://www.youtube.com/embed/XAOf4QDpnCU\" frameborder=\"0\" allowfullscreen></iframe></div>\n\nThe couple, John Paladino, 73, and Carole Paladino, 72, were the only people inside the home in Newfield, New Jersey when the blast occurred shortly after 6 a.m.\n\n<blockquote class=\"twitter-tweet\" data-lang=\"en\"><p lang=\"en\" dir=\"ltr\">Flames are seen burning where a New Jersey home exploded early Saturday morning. Two people were killed in the blast, officials said. The cause of the explosion is not currently known. <a href=\"https://t.co/GA3X6tGIjb\">https://t.co/GA3X6tGIjb</a> <a href=\"https://t.co/7wJt79kqte\">pic.twitter.com/7wJt79kqte</a></p>— ABC News (@ABC) <a href=\"https://twitter.com/ABC/status/1015662071638298", "comment_2": "More crookedness from the Clinton mafia. If only we had a DOJ and FBI to investigate them. Wouldn't that be somethi… https://t.co/dmndTw5FjW", "comment_1": "Clinton Body Count Series #5: Woman Set to Testify Against Clintons Blown Up in Home Explosion https://t.co/4CSq25Fw5h #news", "split": "test", "label": "fake"}
{"comment_3": "MAN PARDONED BY OBAMA 3 MONTHS AGO ARRESTED FOR MURDER | The Underground Report https://t.co/1gUWVKhDbX", "article": "SAGINAW, Mich. — A man recently pardoned by former President Barack Obama was shot and killed by two men with assault-style rifles.\n\nIt happened at 9:40 p.m. on Jan. 23, at Bannum Place Federal Corrections Halfway House in Saginaw. Full list of 330 drug sentences commuted by Obama\n\nMichigan State Police spokesperson Lt. David Kaiser told WNEM the two masked men barged into the building and shot 31-year-old Demarlon Thomas of Saginaw.\n\nHe was shot multiple times by one of the gunmen, while the other held roughly two dozen others at the home at gunpoint. Thomas died at the scene.\n\n“One person watched over a group of them while another subject located the victim and executed him,” Kaiser told MLive.com. “They were looking for this person.”\n\nThe two suspects then fled the area. No one else was injured.\n\nIt wasn’t immediately known how long Thomas had been out of prison and living in the halfway house.\n\nFull list of 64 people pardoned, 209 sentences commuted by Obama\n\nThomas was a former Sunny Side Gang member, ac", "comment_2": "MAN PARDONED BY OBAMA 3 MONTHS AGO ARRESTED FOR MURDER\nWow What a Shame for Obama!!! https://t.co/JptDNdY54L", "comment_1": "MAN PARDONED BY OBAMA 3 MONTHS AGO ARRESTED FOR MURDER https://t.co/4LNkvNBkfr", "split": "test", "label": "fake"}
{"comment_3": "Nancy Pelosi To Resign After New Revelations https://t.co/zNcmpM5s2H via @", "article": "Insiders in Senate Majority Leader Nancy Pelosi’s office tell the Army Times that there might be an open spot “as early as next week” following the bombshell allegations leveled at Pelosi this past week.\n\nWhile the mainstream media continues to ignore Pelosi’s scandals, Breitbart reported on Thursday that “at least five men and one woman have complained about Pelosi making unwanted advances in the past, but it always got swept under the rug.”\n\nAccording to the publication, two sources have confirmed that they were “incentivized” to transfer out of her office — one with a promotion and one with a lump sum cash payment of $15,000.\n\nAccording to insiders, Pelosi “has determined that she has no choice but to step down, though she wholeheartedly denies the allegations.”\n\nThree of Pelosi’s accusers, all male, are former interns and pages, while the others worked as a clerical aide and a member of the cleaning staff..\n\nPelosi has been attacking Roy Moore lately for his alleged consensual affair with a young woman, b", "comment_2": "New post (BREAKING NANCY PELOSI TO RESIGN AFTER NEW REVELATIONS) has been published on BuzzyBuzz -… https://t.co/myAmdK16dg", "comment_1": "BREAKING: Nancy Pelosi To Resign After New Revelations https://t.co/zEm5AFtBzD OMG!!!!REALLY???HAHAHAHAHAHAHAHAHAHAHAHAHAHAHA", "split": "test", "label": "fake"}
{"comment_3": "Pier 39 Terrorist Was an Anti-Trump Antifa Supporter https://t.co/DakqtoCAkC via @realalexjones", "article": "Muslim convert and would-be domestic terrorist Everitt Aaron Jameson, who planned to carry out a Christmas Day massacre on Pier 39 in San Francisco, was a supporter of Antifa and counted amongst his favourite news organisations CNN, BuzzFeed and Al-Jazeera.\n\nThe former US Marine was arrested after he told the FBI of his plan to carry out the atrocity, noting that December 25 would be “the perfect day to commit the attack” because Pier 39 would be crowded with people.\n\nMedia reports confirmed that Jameson “had recently been posting and liking pro-terrorism content on Facebook” and had expressed support for the ISIS-inspired Halloween truck attack in New York. He converted to Islam two years ago.\n\nHowever, what those reports don’t mention is that the would-be terrorist also ‘liked’ numerous Antifa pages, suggesting he supported the movement.\n\nJameson liked Berkeley Antifa, Antifa California, Antifa Scaramento and White Rose Antifa Portland, an archived version of his Facebook profile confirms.\n\nHe also liked a ", "comment_2": "Pier 39 Terrorist Was an Anti-Trump Antifa Supporter https://t.co/8WEQA0FdaM via @realalexjones", "comment_1": "Pier 39 Terrorist Was an Anti-Trump Antifa Supporter https://t.co/teqvaklLYM via @realalexjones", "split": "test", "label": "fake"}
{"comment_3": "FACT CHECK: Electoral College Elector Commits Suicide to Avoid Voting for Donald Trump https://t.co/oM0Fp69doW https://t.co/CsoyL5OZj6", "article": "Detroit, MI | A Michigan elector, in a surge of despair at the election of Donald Trump to the US presidency, has taken his life late last night.\n\nThe 47-year-old man, who leaves behind his wife and six children, took his own life to avoid voting for Donald Trump during the Electoral College that will swear the next president-elect this week.\n\nA letter he wrote before taking his own life explains the reasons for his apparent suicide.\n\n“ I do not want to carry the burden of Trump’s election on my shoulders, so for the greater good of my children and future generations, I am doing what I believe is best for my country and I hope others will follow in my footsteps ” 1.1k\n\nShares 1.1k – Jeremy Hashville\n\nJeremy Hashville, a Michigan elector, has taken his own life to avoid voting in favor of Trump despite Trump’s victory as state laws requires him to vote, an act he hopes others will have the courage to follow to “save his country”.\n\nA tragic end\n\nAccording to the Detroit City Coroner’s report, the last moments o", "comment_2": "LIBERALS GONE WILD LOL \n\nhttps://t.co/ygWe3Z1kR0\n\n\"Electoral College elector commits suicide to avoid voting for Do… https://t.co/7tjDZqU6Zs", "comment_1": "Electoral College Elector Commits Suicide to Avoid Voting for Donald #Trump - https://t.co/lIEq2M88fQ via @Shareaholic", "split": "test", "label": "fake"}
{"comment_3": "Georgia Mosque KEEPS Hurricane Harvey Donations, Will Send To Syrian Refugees Instead https://t.co/VhHLSkv9HQ", "article": "A mosque in Georgia is under fire after they solicited donations allegedly for victims of Hurricane Harvey but decided to keep them and send them to a different kind of refugee instead.\n\n“Because Donald Trump will not let victims of war and crime seek solitude in the United States, we can not in good conscience help his people when so many Muslims can not find shelter,” said Imam Sharaj Alkalb of the Ramazala Mosque in Peachton. “Allah has told us that we must consider where the need is greater and respond to it.”\n\nThe mosque recently made headlines for its “Good work” in the community. According to news reports at the time, the mosque had raised more than $340,000 in cash and supplies “for the victims of Hurricane Harvey.” All of that will now be sent overseas to Syria to “help” people in refugee camps, which have been repeatedly identified as breeding grounds for ISIS recruitment.\n\n“We intended to send it to the people impacted by the hurricane,” Alkalb said when asked if he lied about his intent when askin", "comment_2": "Georgia Mosque KEEPS Hurricane Harvey donations, will send to Syrian refugees instead  https://t.co/ja5izdh9wM", "comment_1": "Georgia Mosque KEEPS Hurricane Harvey Donations, Will Send To Syrian Refugees Instead https://t.co/XmW3l8c0Ky  @GBI_GA  Isn't this fraud?", "split": "test", "label": "fake"}
{"comment_3": "@dancinchicken BREAKING: Clinton Foundation Ordered To Cease Operations, Chelsea Charged With Fraud!? https://t.co/HHEcmmT37w via @YouTube", "article": "Greg Hunter\n\nGreg is the producer and creator of USAWatchdog.com. The site’s slogan is “analyzing the news to give you a clear picture of what’s really going on.” The site will keep an eye on the government, your financial interests and cut through the media spin. USAWatchdog.com is neither Democrat nor Republican, Liberal or Conservative. Before creating and producing the site, Greg spent nearly 9 years as a network and investigative correspondent. He worked for ABC News and Good Morning America for nearly 6 years. Most recently, Greg worked for CNN for shows such as Paula Zahn Now, American Morning and various CNN business shows.", "comment_2": "Clinton Foundation Ordered To Cease Operations – Chelsea Charged With Fraud! https://t.co/rExv39Rebb", "comment_1": "BREAKING: Clinton Foundation Ordered To Cease Operations – Chelsea Charged With Fraud! https://t.co/aevSzvmWcr", "split": "test", "label": "fake"}
{"comment_3": "“HIV Virus” Detected In Walmart Bananas After 10 Year Old Boy Contracts The Virus. (#2 IS THE... https://t.co/igUvfCPafC", "article": "CNNews– A 10-year-old young boy who had eaten a banana his mom acquired at a Walmart in Tulsa, Oklahoma, was hurried to the emergency clinic due to fever, chills and tiredness simply seven days after usage. After a thorough examination, blood tests and scans the young boy tested favorable for the HIV virus. His mother certainly in shock. However, the 10-year-old child was not the only one admitted to the medical facility for the very same concern. Eight kids, all under the age of 17, have actually been identified as HIV-positive within the month of March. Exactly what is the something they share? Getting bananas from The Tulsa, Oklahoma Walmart.\n\nIn accordance with the moms and dads, they sent several foods their kids had been consuming to medical professionals for screening, along with documenting the different places they had visited within the month. They discovered that 8 children had consumed bananas from the superstore. The facility, LHC Laboratories, evaluated the bananas which all came up positive con", "comment_2": "\"HIV Virus\" Detected In Walmart Bananas After 10 Year Old Boy Contracts The Virus https://t.co/dlq1C23UvE", "comment_1": "\"HIV Virus\" Detected In Walmart Bananas After 10 Year Old Boy Contracts The Virus - https://t.co/UWzlgZP3xq", "split": "test", "label": "fake"}
{"comment_3": "Snoop Dogg Arrested For Conspiracy After Talking About His ‘Murder Trump’ Video https://t.co/bEluXiOIRy", "article": "Snoop Dogg, major pothead and advocate of violence as a form of protest, has landed in hot water over his video “Lavender,” in which he shoots Donald Trump. In the video, the rapper shoots a clown version of President Trump with a toy gun, but that’s not what got him in trouble.\n\nAfter the story went viral, a reporter from Breitbart caught up with Snoop Dogg and asked him if he believed violence was the answer. His response was chilling. He said:\n\n“No, man. I don’t like violence any more than the next guy, but I would hope that if this clown in the White House was about to start a war or somethin’ that someone would do what I did but with a real gun. I know I would and I would encourage anyone who could get close enough to do the same. That’s not violence…it’s survival of the species.”\n\nThe reporter, Glen Dingusman, immediately contacted the Secret Service with his evidence of violent threats made against the president and Snoop Dogg, who was on his way into a restaurant for lunch when the exchange happened, ", "comment_2": "BREAKING: Snoop Dogg Arrested For Conspiracy After Talking About His ‘Murder Trump’ Video https://t.co/RWz0vriw5Z", "comment_1": "Snoop Dogg Arrested For Conspiracy After Talking About His ‘Murder Trump’ Video - TRENDING https://t.co/mgsbzfMZ40", "split": "test", "label": "fake"}
{"comment_3": "#State Of Minnesota Has Just Handed Over FULL CONTROL To Muslims So They Can Take Down ‘Infidels’ - https://t.co/V8g55UVRVt", "article": "There is not a day that goes by that we don’t hear about a Muslim terror attack taking place somewhere in our world, but that hasn’t stopped leftists from defending them at every opportunity. Those of us that criticize the so-called “religion of peace” are subjected to ridicule and even being attacked for our belief of how dangerous Muslims are. In Europe, those that speak out against Islam are being imprisoned for their belief. Courts are actually sentencing people for “Islam anti-blasphemy” laws. While this may be par for the course in Europe right now, it is not the way we roll in America, until now. Minnesota has just established a similar law.\n\nAnti-blasphemy laws are a huge victory for Muslims because it ensures their protection and in turn, allows them to continue acting in whatever manner they please all the while marching towards Sharia Law.\n\nAccording to Minneapolis’ local newspaper, the Star-Tribune, the hotline was set up as a way to target Trump supporters, who Muslims believe are the group of pe", "comment_2": "State Of Minnesota Has Just Handed Over FULL CONTROL To Muslims So They Can Take Down ‘Infidels’ https://t.co/0mdvv5UqQV via @mayhem_news", "comment_1": "State Of Minnesota Has Just Handed Over FULL CONTROL To Muslims So They Can Take Down ‘Infidels’ https://t.co/S9BdqvOKCZ via @mayhem_news", "split": "val", "label": "fake"}
{"comment_3": "BREAKING: NBC Just Fired Megyn Kelly Before Her New Show Begins https://t.co/rFyWAF7M8j", "article": "Share Facebook\n\nAccording to sgsnews:\n\nNBC Just Fired Megyn Kelly Before Her New Show Begins.\n\nMegyn Kelly turned down a $20 million payday to stay with the only trusted name in news for a daytime slot where she could play a white version of Oprah Winfrey on NBC for 25 percent less money. Now that her tenure at Fox has ended and her new show is scheduled to start production sequences for a fall premiere, Kelly decided she wasn’t happy and demanded the format be changed.\n\nAccording to Hugh McGovern, executive producer of Kelly’s new show:\n\n“Megyn had high hopes when she left Fox that people would still take her seriously as a journalist. She was lured to NBC with promises of easier days and evenings at home with the family. Now that she sees the production schedule, she feels like she’s been duped and has demanded she be given more serious show assignments.”\n\nThe problem, according to McGovern, is that Kelly sees a schedule filled with visits from celebrities and novelists to talk about their sitcoms and books", "comment_2": "BREAKING: NBC Just Fired Megyn Kelly Before Her New Show Begins https://t.co/5GjKZELFOe https://t.co/2AY1feBzwT", "comment_1": "BREAKING: NBC Just Fired Megyn Kelly Before Her New Show Begins https://t.co/cweg0eoOdb", "split": "val", "label": "fake"}
{"comment_3": "First family visits D.C. shelter, highlights homeless veterans’ plight https://t.co/1DxKxgr65G", "article": "\n\nPresident Obama, alongside his family, serving Thanksgiving dinner to the homeless Wednesday night at Friendship Place in Washington. (NICHOLAS KAMM/AFP/Getty Images/AFP/Getty Images)\n\nPresident Obama, joined by his wife and daughters, served Thanksgiving dinner in a D.C. shelter Wednesday to highlight the administration's efforts to end homelessness among U.S veterans.\n\nThe first family visited Friendship Place, which is located in the basement of St. Luke’s Church in Northwest Washington. The shelter, which received a $3.1 million grant from the Department of Veterans Affairs this year to improve its capacity to address veteran homelessness, operates the program Veterans First, a leading provider of housing services to veterans and their families in the area that currently serves 550 households.\n\nThe Obamas, along with some friends, served dinner as part of the shelter's \"Feast with Friends\" event. Each member of the family had assigned duties: The president served turkey and ladled gravy; Michelle Obama ", "comment_2": "First family visits D.C. shelter, highlights homeless veterans' plight https://t.co/EYHIaSvURS #usa #politics", "comment_1": "First family visits D.C. shelter, highlights homeless veterans’ plight:    President Obama, joined by his wife... https://t.co/oqVT8nhJBo", "split": "val", "label": "fake"}
{"comment_3": "@realDonaldTrump  @Federal Judge Grants Permission To Subpoena Trump https://t.co/OHtG6WlCIB", "article": "Federal Judge Peter J. Messitte has just ruled in favor of two attorney generals seeking to subpoena the Trump organization relating to President Trump unlawfully receiving emoluments from foreign and domestic governments.\n\nD.C. Attorney General Karl A. Racine and Maryland Attorney General Brian E. Frosh can now subpoena the Trump organization, thereby forcing them to preserve documents in relation to President Trump’s alleged indiscretions.\n\nThe case advances a very high-profile attempt to see if President Trump is violating the emoluments clause of the U.S. Constitution, which precludes him from receiving gifts from foreign or state governments. The Trump Organization will be compelled to comply with the court’s ruling.\n\n“This ruling is an important first step in our litigation against President Trump for unlawfully receiving emoluments from foreign and domestic governments,” Racine said in a statement.\n\nPer the Post:\n\nBecause Trump continues to benefit financially from his hotel, resort and golf properties", "comment_2": "BREAKING: Federal Judge Grants Permission To Subpoena Trump https://t.co/vHEb9yphcJ", "comment_1": "Federal Judge Grants Permission To Subpoena #Trump over #emolument clause https://t.co/8lmEyEVFFq", "split": "val", "label": "fake"}
{"comment_3": "Singer Tina Turner: “This Thanksgiving Is The First Time in 8 Years That I am Thankful For Our President, God Bless… https://t.co/JkRnaenRt6", "article": "ARE YOU READY? GET IT NOW!\n\nIncrease more than 500% of Email Subscribers!\n\nYour Information will never be shared with any third party.", "comment_2": "Singer Tina Turner: “This Thanksgiving Is The First Time in 8 Years That I am Thankful For Our President, God Bless… https://t.co/PVXZYdb0nA", "comment_1": "Singer Tina Turner: “This Thanksgiving Is The First Time in 8 Years That I am Thankful For Our President, God Bless… https://t.co/HffdG95sK2", "split": "val", "label": "fake"}
{"comment_3": "BREAKING: Susan Rice Arrested For Criminal ‘Unmasking’ Of Trump Officials https://t.co/uZkU43kACG", "article": "Washington (CNN) Former national security adviser Susan Rice privately told House investigators that she unmasked the identities of senior Trump officials to understand why the crown prince of the United Arab Emirates was in New York late last year, multiple sources told CNN.\n\nThe New York meeting preceded a separate effort by the UAE to facilitate a back-channel communication between Russia and the incoming Trump White House.\n\nThe crown prince, Sheikh Mohammed bin Zayed al-Nahyan, arrived in New York last December in the transition period before Trump was sworn into office for a meeting with several top Trump officials, including Michael Flynn, the president's son-in-law, Jared Kushner, and his top strategist Steve Bannon, sources said.\n\nThe Obama administration felt misled by the United Arab Emirates, which had failed to mention that Zayed was coming to the United States even though it's customary for foreign dignitaries to notify the US government about their travels, according to several sources familiar ", "comment_2": "BREAKING: Susan Rice Arrested For Criminal ‘Unmasking’ Of Trump Officials https://t.co/OduuCjixA4", "comment_1": "BREAKING: Susan Rice Arrested For Criminal ‘Unmasking’ Of Trump Officials https://t.co/NVIowLfGPA Wow it's about time now get  rest of them", "split": "val", "label": "fake"}
{"comment_3": "BOMBSHELL: COMEY KNEW MURDERED DNC STAFFER, SETH RICH, WAS WIKILEAKS SOURCE &amp; COVERED IT UP FOR HILLARY https://t.co/pYCZTsLNza", "article": "HERE Is WHAT WILL HAPPEN If The DEEP STATE TAKES DOWN PRESIDENT TRUMP & It’s NOT PRETTY … FOR THEM\n\n“The tree of liberty must be refreshed with the blood of patriots and tyrants.” – Thomas Jefferson\n\nELDER PATRIOT – Corrupt politicians ignore Jefferson’s directive to their own detriment. It’s no longer political, it’s personal.\n\nAmericans have had their eyes opened by the ascension of Donald Trump and no amount of leftwing money can put the Freedom Movement genie back in the bottle.\n\nConservative Senator Ted Cruz made that observation after reviewing the results of the 2016 elections and the expectations of the voters.\n\nCruz, who had the most high profile personality clash with Donald Trump during the Republican primary process nevertheless embraced Trump’s America First agenda and said, “If we’re given the White House and both houses of Congress and we don’t deliver, I think there will be pitchforks and torches in the streets. And I think quite rightly.”\n\nCandidate Trump promised many things – border control", "comment_2": "BOMBSHELL: COMEY KNEW MURDERED DNC STAFFER, SETH RICH, WAS WIKILEAKS SOURCE &amp; COVERED IT UP FOR HILLARY https://t.co/lCdNjGZXLM", "comment_1": "BOMBSHELL: COMEY KNEW MURDERED DNC STAFFER, SETH RICH, WAS WIKILEAKS SOURCE &amp; COVERED IT UP FOR HILLARY https://t.co/c6znrILLMA", "split": "val", "label": "fake"}
{"comment_3": "This is fake: \"Rubio: ‘Rape victims should be in custody if there is suspicion that they’re planning abortion.’ \" https://t.co/AVXUzgwZF1", "article": "At a campaign town hall event at St. Anselm College in New Hampshire, Sen. Marco Rubio used a question on abortion from a reporter to focus on Hillary Clinton, claiming she is the one with “radical” positions. Perhaps trying to show Rubio is out of step with voters on abortion, he was asked whether a fertilized egg should have legal protections, the candidate used the question as an opportunity to defend life and vigorously attacked the Democrat frontrunner.\n\n“I don’t know what you’re talking – I believe all life is worthy of the protection of our laws. That’s what I believe,” declared Rubio. Rubio, 44, is the youngest candidate in the Republican field, and has consistently declared he will defend life at all stages of conception, regardless of circumstances. “I believe it is outrageous that Hillary Clinton supports partial-birth abortion, which is a gruesome process that’s been outlawed in the United States, but she supports it as a process that should be legal,” Rubio asserted.\n\n\n\nTaking another question fr", "comment_2": "Rubio: “Rape Victims Should Be In Custody If There Is Suspicion That They’re Planning Abortion” - enscenic:... https://t.co/Inla29aoCz", "comment_1": "Rubio: “Rape Victims Should Be In Custody If There Is Suspicion That They’re Planning Abortion” https://t.co/1O2nHA3yta", "split": "val", "label": "fake"}
{"comment_3": "Jason Aldean Gig Canceled After He Sells Out To Liberals On SNL", "article": "About Trendolizer™\n\nTrendolizer™ (patent pending) automatically scans the internet for trending content. The website you are looking at has no human editors at all: links to trending stories are automatically posted from a selection of the data Trendolizer™ picked up. If you are interested in using the Trendolizer™ engine, dashboard or API for your own projects, more information is available at get.trendolizer.com . Trendolizer™ is owned by Lead Stories LLC\n\nPrivacy policy\n\nThis site uses cookies to track user behaviour on this site, without linking to personally identifiable data. Advertisers may also use cookies, but the scope and nature of this use is beyond our control.", "comment_2": "Fake News: Jason Aldean Gig NOT Canceled After He Sells Out To Liberals On SNL https://t.co/OLyxA9Moxb https://t.co/NUSIi9lByH #stupidity…", "comment_1": "Seriously Jason? Disappointed. --&gt; Jason Aldean Gig Canceled After He Sells Out To Liberals On SNL https://t.co/dazwp7wFFt via @Breaking!", "split": "val", "label": "fake"}
{"comment_3": "@LittleJoeRadio For your news: Colorado Rockies Baseball Team To Sell Marijuana Brownies At Their Concession Stands https://t.co/w88ic5XTPU", "article": "Colorado Rockies Baseball Team To Sell Marijuana Brownies At Their Concession Stands\n\nDENVER, COLORADO –\n\nWith the new laws in effect in Colorado, major sports organizations are looking for ways to cash in on the newest legal cash crop in the state.\n\nSources are reporting that Major League Baseball’s Colorado Rockies plan to sell food items which contain marijuana at concession stands during games next season.\n\nThe first item on the list? Pot Brownies.\n\nAn official within the Rockies organization stated that the Rockies organization has given the green light to concession stands selling marijuana brownies.\n\nHigh ranking officials in the Rockies organization say they are thrilled at the new menu item since they note that it will bring in tens of thousands of dollars per month.\n\nThe Rockies head office is hoping that the sale of marijuana brownies will also boost sales of other concession items. What better way to sell concessions that to give everyone in the stadium the munchies?\n\nSIDENOTE: An inside source wi", "comment_2": "Colorado Rockies Baseball Team To Sell Marijuana Brownies At Their Concession Stands https://t.co/iALU2ccgMD", "comment_1": "This is crazy----&gt; Colorado Rockies Baseball Team To Sell Marijuana Brownies At Their Concession Stands http://t.co/Nal5gk0IIc", "split": "val", "label": "fake"}
{"comment_3": "RT @_keithkoolin: The need to put _Barack_ _Obama_ on a new dollar bill.", "article": "A longtime push to honor modern presidents on currency has finally come to fruition. In 2017, Obama’s image will replace George Washington’s\n\n“We thought about creating a new denomination for Obama, but George Washington has had plenty of time in the sun,” John Apple from the Federal Reserve said. “We’ve needed to change things up for a while now.”The Bureau of Engraving and Printing has released several comps but a design has not been finalized. The Bureau will release all compositions in early 2016 and poll the American public letting them help decide which design works best.\n\nMany presidents were bandied about as the new face of the one-dollar bill including Jimmy Carter and Ronald Reagan. Reportedly, Reagan almost got the nod to replace Washington, but people within the Federal Reserve felt Obama brought a much needed multiracial mix to American currency.\n\n“Obama being of mixed-race was probably what tipped things; however, we looked at overall accomplishments as well. Frankly, he [Obama] has done more fo", "comment_2": "#JewishTimes #USdollar #BarackObama #USTreasury #JackLew Lew’s new scribble on your dollar bill http://t.co/UVHdvWmE", "comment_1": "(100) Barack Obama 2012 Commemorative Dollar Bill: 100 BRAND New Novelty Bills http://t.co/kWq88ZEH", "split": "train", "label": "fake"}
{"comment_3": "BREAKING: Shep Smith To Be Canned Because He Can’t Control His Hate For Donald Trump https://t.co/qYVCeX3T90", "article": "A dispute in Angela Merkel’s coalition over migration policy has swiftly escalated into one of the biggest tests of her chancellorship.\n\nThe clash has opened a rift at the heart of the German leader’s own camp, between her Christian Democratic Union and its CSU Bavarian sister party. How the conflict is resolved will determine the chancellor’s fate, possibly as soon as Monday.\n\nHorst Seehofer, Merkel’s interior minister and the leader of Bavaria’s Christian Social Union, wants to force through a plan to send back migrants who have already registered for asylum in other European Union states. Merkel rejects the proposal as offloading the burden on neighboring states, and says it would kill efforts to forge a bloc-wide response to the continent’s struggle with migration.\n\nBavarian lawmakers are fully behind Seehofer, while Merkel has wrested a majority in the larger CDU group for her position. The standoff is a replay of tensions that have periodically bubbled up between Merkel and Seehofer since the height of ", "comment_2": "BREAKING: Shep Smith To Be Canned Because He Can’t Control His Hate For Donald Trump - World News And Rumors https://t.co/9DLEqk7qIJ", "comment_1": "BREAKING: Shep Smith To Be Canned Because He Can't Control His Hate For Donald Trump https://t.co/69wOUVgJXt", "split": "train", "label": "fake"}
{"comment_3": "via @TIME: A Student Started Filming During the Florida School Shooting. He Hasn’t Stopped https://t.co/IxpxG35dGf https://t.co/1VkrltN7rb", "article": "David Hogg, a senior at Marjory Stoneman Douglas High School, knows what gunshots sound like: His father worked in law enforcement, and taught him about weapons and how to handle them. So when Hogg heard a “pop” while sitting in an AP environmental science class around 2:30 p.m. Wednesday, he told his teacher it sounded strangely like a gunshot. But there had been a fire drill that very morning and talk of a “Code Red” exercise to prepare for an active shooter. This must just be a surprise drill, he reasoned.\n\nAnd then the fire alarm sounded. Dutifully acting on it, Hogg and other students tried to exit the building. A janitor—Hogg doesn’t know his name but calls him an angel—knew where the shots were coming from and sent the students back. Then a culinary arts teacher, Ashley Kurth, pulled Hogg and others inside, locked the door, and made them hide in a closet. Checking Twitter and Instagram, Hogg—who’s an editor at the school’s TV station—found the news that the shooting was real and ongoing.\n\nThe shots con", "comment_2": "A Student Started Filming During the Florida School Shooting. He Hasn't Stopped https://t.co/nSoPklx4wK", "comment_1": "A Student Started Filming During the Florida School Shooting. He Hasn't Stopped https://t.co/BlnOWoK5Jy", "split": "train", "label": "fake"}
{"comment_3": "Las Vegas Shooting Witnesses Report Multiple Gunmen Dressed as Security Guards - https://t.co/zaTFC5qVnN", "article": "Oops! It Looks like the page you are looking for has been removed.\n\nWe're redirecting you to our homepage...", "comment_2": "Las Vegas Shooting Witnesses Report Multiple Gunmen Dressed as Security Guards https://t.co/dqw0sNDTQR", "comment_1": "Las Vegas Shooting Witnesses Report Multiple Gunmen Dressed as Security Guards https://t.co/juREz7uHPO", "split": "train", "label": "fake"}
{"comment_3": "ICE Detainer Issued for Suspected Wine Country Arsonist in Sonoma Jail - Breitbart https://t.co/UoDf4T5JJA", "article": "UPDATE: Consistent with our subsequent coverage of the California wildfires, this story has been updated to clarify that Jesus Fabian Gonzales is not suspected of the recent Sonoma County fires that killed 40 residents.\n\nThe U.S. Immigration & Customs Enforcement Agency (ICE) issued a detainer request on the Sonoma County Jail for Jesus Fabian Gonzalez, who was arrested Sunday on suspicion of arson in Wine Country fires.\n\nBreitbart News reported earlier this week that Sonoma County Sheriffs had arrested Jesus Fabian Gonzalez, 29, at Maxwell Regional Park in Sonoma County after a series of reports of ongoing fires in the region. Mr. Gonzalez was observed around 3:00 p.m. PDT wearing a jacket and walking “out of the creek area and a plume of smoke behind him,” according to the Santa Rosa Press Democrat.\n\nMr. Gonzalez, who is homeless and reportedly known by law enforcement to have been living under a nearby bridge, claimed he was cold and had lit the fire to stay warm. But it was a balmy 78 degrees when he and ", "comment_2": "BUILD THE DAMN WALL!\nICE Detainer Issued for Suspected Wine Country Arsonist in Sonoma Jail - Breitbart https://t.co/x6WS8c0jJd", "comment_1": "ICE Detainer Issued for Suspected Wine Country Arsonist in Sonoma Jail - Breitbart https://t.co/k7seI5kU5Q", "split": "train", "label": "fake"}
{"comment_3": "BREAKING: The Democrat James Comey Has Been Having An Affair With Was JUST REVEALED! (DETAILS) https://t.co/zBxLvdd9fB COMEY HAVING AFFAIR .", "article": "As we promised, Freedom Crossroads has just learned the identity of the Democrat James Comey has been having an affair with for at LEAST the last 8 months, it’s none other than the DISGRACED former Chair of the DNC, Debbie “Whiny Democrat” Wasserman Schultz — talk about a match made in Heave… errrrr… Hell!\n\nThese two dimwits were probably attracted to each other because they are both LOSERS who can’t accept defeat, but that doesn’t really differentiate them from the rest of the crybaby Democrat Party, now does it?\n\nAccording to our exclusive sources, Comey and Wasserman Schultz met while both working for the government, and despite the fact that both of them are married, they couldn’t put aside their lust for each other and decided to have an affair. Not exactly shocking, considering they’re two liberal sickos — and we all know, ANYTHING goes for them.\n\nAnd now we all know the REAL reason that the sad ex-FBI Director Comey is trying to attack Donald Trump… to impress his GIRLFRIEND!\n\nPathetic.\n\nThe staff at F", "comment_2": "LMAO!\nBREAKING: The Democrat James Comey Has Been Having An Affair With Was JUST REVEALED! (DETAILS) https://t.co/Y9otEJdLrx", "comment_1": "BREAKING: The Democrat James Comey Has Been Having An Affair With Was JUST REVEALED! (DETAILS) https://t.co/qFyDro5Buz", "split": "train", "label": "fake"}
{"comment_3": "Spicer: “Trump Has The Legal Right To Cancel SCOTUS Because They Serve At His Pleasure” https://t.co/iu23nviMe7", "article": "During a Monday press conference that media outlets were banned from airing, White House Press Secretary Sean Spicer announced that the president was sending “thoughts and prayers” to the victims of an alleged terrorist attack in London and to the families of seven dead U.S. sailors. Spicer defended the ban on broadcasting the briefing by noting that President Donald Trump had already appeared on camera on Monday for several minutes, although he took no questions. Spicer also said that the president had confidence in all the members of the Justice Department, including Special Counsel Robert Mueller, who is reportedly investigating the president for obstruction of justice. He also insisted that Trump has the power to fire Mueller if necessary. “If you serve at the pleasure of the president, you serve at the pleasure of the president,” he said. “That is a fact.”\n\nAsked by several reporters to clarify the full extent of the president’s power, or in other words, its limitations – if they exist – Spicer argued th", "comment_2": "Spicer: \"Trump has the legal right to cancel SCOTUS because they serve at his pleasure\"\n\n— Bloggers on Wednesday,... https://t.co/bQy3IJgcUc", "comment_1": "Spicer: “Trump Has The Legal Right To Cancel SCOTUS Because They Serve At His Pleasure” https://t.co/FzC06gKx3e", "split": "train", "label": "fake"}
{"comment_3": "Tens of Thousands Of Scientists Declare Climate Change A Hoax https://t.co/CFLFGdmsb3 via @peoplesvoice_tv", "article": "A staggering 31,487 Americans, including scientists, academics and university graduates, have come forward to claim that global warming is not caused by the human release of gases.\n\nOne of the experts is weather channel founder, John Coleman, who warns that huge fortunes are being made by man-made climate change proponents such as Al Gore.\n\nNatural News reports:\n\nIn a recent interview with Climate Depot, Coleman said:\n\n“Al Gore may emerge from the shadows to declare victory in the ‘global warming’ debate if Hillary Clinton moves into the White House. Yes, if that happens and the new climate regulations become the law of the land, they will be next to impossible to overturn for four to eight years.”\n\nClimate change proponents remain undeterred in their mission, ignoring numerous recent scientific findings indicating that there has been no warming trend at all for nearly two decades.\n\nAl Gore’s dire predictions of the melting of polar ice on a massive scale have proved to be completely false. In fact, in 2014 –", "comment_2": "Tens of Thousands Of Scientists Declare Climate Change A Hoax https://t.co/6bw2oUsbq1 via @yournewswire", "comment_1": "Have actually looked at the tens of thousands of scientists who claim #ClimateChange is a hoax.\n1970s #IceAge foole… https://t.co/W9Ah8L7keA", "split": "train", "label": "fake"}
{"comment_3": "UPDATE: Malia Obama Among 10 Arrested In Racist Antifa Attack https://t.co/FOYJUAb8Xj https://t.co/bVKvXFJ6eV", "article": "Create an account or sign in to comment\n\nYou need to be a member in order to leave a comment", "comment_2": "UPDATE: Malia Obama Among 10 Arrested In Racist Antifa Attack – Daily https://t.co/EE4OEJvxxV", "comment_1": "UPDATE: Malia Obama Among 10 Arrested In Racist Antifa Attack https://t.co/jqI6pSwTXP", "split": "train", "label": "fake"}
{"comment_3": "BREAKING: Bill O’Reilly In Critical Condition After Being Attacked By ‘Tolerant’ Liberals https://t.co/uG4Fhbja2h", "article": "Bill O’Reilly was reportedly minding his own business at a bagel shop in New York City this morning when he was approached by two women and three men who said they were “disgusted” by his behavior towards women at Fox News. O’Reilly, who has never been afraid of anyone, turned and told the group to grow up and leave him alone. That’s when the “tolerant” liberals got violent.\n\nOne of the men grabbed O’Reilly and dragged him out into the street, according to witnesses, where the other two men proceeded to kick him until he was unconscious and bleeding. The 5 perpetrators, who are still at large, ran off like the cowards they are. The police arrived within minutes and called for medical help.\n\nO’Reilly was taken to St. Vincent’s where he is in critical condition with 4 broken ribs and a punctured lung. Doctors also fear that he had a cardiac event and have him on a monitor. They are hopeful, but with O’Reilly’s age and the extent of his injuries, he may not make it through.\n\nThe family is asking for privacy at t", "comment_2": "BREAKING: Bill O’Reilly In Critical Condition After Being Attacked By ‘Tolerant’ Liberals https://t.co/zCgU4ZcoS2 https://t.co/oM7vLnXhrI", "comment_1": "BREAKING: Bill O’Reilly In Critical Condition After Being Attacked By ‘Tolerant’ Liberals\n\nhttps://t.co/hee4zrKa6u", "split": "train", "label": "fake"}
{"comment_3": "Donald Trump warns outgoing Ghana President https://t.co/uuY58J2h7S", "article": "I’ll Make Sure you are Jailed- Donald Trump Tells Ghana’s Prez Mahama\n\nThe President-elect of the United States, Donald Trump has on Wednesday issued a warning to the outgoing President of Ghana, John Dramani Mahama that he will make sure that the International Criminal Court (ICC) jails him for him mismanagement of State fund.\n\n\n\nTalking to the NY Times, Trump acknowledged the efforts of John Mahama in defending Africa’s democracy by peacefully conceding defeat in the country’s elections.\n\nThe praise was followed by a warning.\n\n“As an outgoing President, you don’t have to implement last-minute policies that will make governance tough for the incoming President. You just have to spend the rest of the days on packing. Reverse those appointments and salary increments immediately. ” – Trump warned.\n\nTrump went on further to describe the actions of the outgoing president as that of a ‘lizard’s shit’. “Don’t end your beautiful shit with a different color.” – he added.\n\nTrump’s warning comes days after the outgoing", "comment_2": "Donald Trump warns outgoing Ghana President https://t.co/QZ7pZFyoF0", "comment_1": "Donald Trump warns outgoing Ghana President https://t.co/Dzchh9KG8Q", "split": "train", "label": "fake"}
{"comment_3": "BREAKING: Trump’s Android Device Believed To Be Source Of Recent White House Leaks https://t.co/kOeaAjpodB via @The Seattle Tribune", "article": "Initial reports from two such agencies, A.R.H. Intelligence and Z|13 Security, suspect the source of the recent White House leaks to be President Trump’s unsecured Android device.\n\nIf you’ve recently seen the hashtag – #DitchTheDevice trending on social media, it’s because, according to several private intelligence reports, the source of the multiple recent leaks within the White House is President Trump’s unsecured Android device.\n\nThroughout the past several weeks President Trump and his administration have expressed extreme frustration over the multiple leaks provided to members of the press from inside the White House.\n\nThe recent leaks range from information regarding his executive orders (before he issued them), fighting and chaos among White House staffers, classified conversations with foreign leaders (specifically Australian Prime Minister Malcolm Turnbull & Mexican President Enrique Peña Nieto), White House staffers conducting meetings in the dark because they can’t figure out how the lights work, a", "comment_2": "BREAKING: Trump’s Android Device Believed To Be Source Of Recent White House Leaks https://t.co/xRrgDFJc49 via @The Seattle Tribune", "comment_1": "BREAKING: Trump’s Android Device Believed To Be Source Of Recent White House Leaks https://t.co/c5nkmJKiCO via @The Seattle Tribune", "split": "train", "label": "fake"}
{"comment_3": "Eric Trump: “My Father’s Tax Return Is Irrelevant Because We’re Going To Cancel Taxes For WEALTHY People Anyway.” https://t.co/1K8XxMxMhD", "article": "Eric Trump on Wednesday dismissed arguments that his father, Donald Trump Donald John TrumpGraham open to investigating Acosta-Epstein plea deal Sustaining progress with Mexico on migration Government to issue licenses for business with Huawei MORE, should release his tax returns, saying doing so would be \"foolish.\"\n\nADVERTISEMENT\n\n“You would have a bunch of people who know nothing about taxes trying to look through and trying to come up with assumptions on things they know nothing about,” Eric Trump said Wednesday on CNBC.\n\n“It would be foolish to do. I’m actually the biggest proponent of not doing it.”\n\nDonald Trump, the Republican presidential nominee, has faced criticism for refusing to release his tax returns.\n\nHe has repeatedly pushed back against calls to release the documents, saying he is under audit by the Internal Revenue Service (IRS).\n\nThe IRS has said nothing prevents Trump from releasing his tax returns.\n\nEric Trump said on Wednesday that there is \"no tax attorney in the world who will tell you", "comment_2": "Eric Trump: “My Father’s Tax Return Is Irrelevant Because We’re Going To Cancel Taxes For WEALTHY People Anyway.”… https://t.co/kHCDmAEzEx", "comment_1": "Eric Trump: “My Father’s Tax Return Is Irrelevant Because We’re Going To Cancel Taxes For WEALTHY People Anyway.” https://t.co/yS0cEfBeKE", "split": "train", "label": "fake"}
{"comment_3": ".⚠️⚠️⚠️Com' On Now, CLINTON ‼️ 🔥🔥🔥 ANOTHER-SUICIDE‼️😱⁉️☠️☠️☠️ ⁉️\nHaiti Official Getting Ready To Testify Against Cl… https://t.co/NZio9kp2Ba", "article": "It’s absolutely clear that the Clinton Foundation has faced some honest reports of stealing from impoverished Haitians devastated in the 2008 Hurricane Hanna, and straight through their own foundation. For years the Haitians have been struggling and protesting outside the Clinton Foundation offices over the robbery. The money taken was donated by the individuals and business directly to the Clinton Foundation, thinking they were going to receive aid. However, the opposite it true. The money never even made it to the poorest of the poor. Now we have one man ready to testify against the corrupt Clinton Foundation in the upcoming week. However, the 50 year old man, a former Haitian government official Klaus Eberwein, was found dead in his Miami home with a “gunshot to the head” that’s been ruled a “suicide” by the Miami-Dade’s medical examiner records supervisor.\n\nKlaus Eberwein, a former Haitian government official who was expected to expose the extent of Clinton Foundation corruption and malpractice next week,", "comment_2": "Haiti Official Getting Ready To Testify Against Clinton Foundation Corruption NEXT WEEK, Found DEAD With “Gunshot t… https://t.co/936Kt3TwrV", "comment_1": "Haiti Official Getting Ready To Testify Against Clinton Foundation Corruption NEXT WEEK, Found DEAD With “Gunshot t… https://t.co/iuKO7F0SrQ", "split": "train", "label": "fake"}
{"comment_3": "'The Daily Show's' Michelle Wolf Lands Her Own Netflix Late-Night Show (Exclusive) https://t.co/HPDM6ZeAYa", "article": "“You can expect the types of jokes my former bosses would tell me we couldn’t do on TV,” she says of her forthcoming weekly program.\n\nMichelle Wolf has landed a show of her own.\n\nAfter nearly half a decade working on Late Night With Seth Meyers and The Daily Show With Trevor Noah, Wolf is set to host her own weekly show on Netflix. The streaming giant, which is making a considerable push in the talk-show space with entries from David Letterman and Joel McHale, is billing Wolf’s show as a break from the seriousness of late-night comedy. The planned star vehicle will launch later this year.\n\nThe 32-year-old rising star, whose show does not yet have a name, is expected to make fun of everything and everybody, with no preaching or political agenda — unless, of course, it’s funny. “You can expect the types of jokes my former bosses would tell me we couldn’t do on TV,” Wolf joked in a statement, with Netflix’s vp content Bela Bajaria, adding more earnestly: \"We're thrilled to be working with Michelle, a gifted writ", "comment_2": "'The Daily Show's' Michelle Wolf Lands Her Own Netflix Late-Night Show (Exclusive)\n#TheDailyShow  https://t.co/75bc0Wy9yg", "comment_1": "'The Daily Show's' Michelle Wolf Lands Her Own Netflix Late-Night Show (Exclusive) https://t.co/GYWeoffUg2 https://t.co/xtpN1q8B9c", "split": "train", "label": "fake"}
{"comment_3": "CONFIRMED ! JUSTICE RUTH BADER GINSBURG IS RESIGNING FROM THE POST OF ASSOCIATE JUSTICE OF THE SUPREME COURT… https://t.co/jgl6C6kOPh", "article": "If this is true it will mean an opening for another Conservative Justice to be appointed by President Trump.\n\nShe said she will resign if Trump was elected President, and now when he got elected, and with a month until the inauguration, she will be resigning.\n\nThe Supreme Court is in recess for the summer, but Justice Ruth Bader Ginsburg took some time to reflect on its future composition, which will chiefly depend on who is elected president in November. Asked on Thursday about the prospect of Donald Trump being handed the job of selecting the next crop of justices, she seemed uneasy at the thought.\n\n“I DON’T WANT TO THINK ABOUT THAT POSSIBILITY, BUT IF IT SHOULD BE, THEN EVERYTHING IS UP FOR GRABS,” SHE TOLD THE ASSOCIATED PRESS IN A WIDE-RANGING INTERVIEW THAT ALSO TOUCHED ON THE LOSS OF HER DEAR FRIEND ANTONIN SCALIA AND SOME OF THE COURT’S BIGGEST RULINGS IN THE TERM THAT ENDED IN LATE JUNE.\n\n“I REALLY DISLIKE THAT MAN FOR A NUMBER OF REASONS, AND ALTHOUGH I AM NOT SUPPOSED TO PUT FORTH MY PERSONAL VIEWS", "comment_2": "BA BYE!\nConfirmed ! Justice Ruth Bader Ginsburg is RESIGNING From The Post of Associate Justice of the Supreme Court https://t.co/RfliwKJbYV", "comment_1": "CONFIRMED!!! JUSTICE RUTH BADER GINSBURG IS RESIGNING FROM THE POST OF ASSOCIATE JUSTICE OF THE SUPREME COURT! https://t.co/Fr6o2QmIko", "split": "train", "label": "fake"}
{"comment_3": "Libtard Hero Al Franken Forced To Resign In Disgrace https://t.co/2BpPVCcnoc", "article": "Libtard Democrat Al Franken will resign his seat as US Senator and Minority Leader this morning after learning that the White House has enough on him to ruin his marriage and send him to jail. Rather than face the backlash and vindictive response from the Trump administration to his requests to play ball, Franken will resign, deny all of the allegations and spend the next 7 1/2 years under investigation by Trey Gowdy.\n\nThis was a great move by Trump. Not only does he get rid of a huge political opponent, he shows America that our elected officials can be compromised and forced to do as they’re told. No more of this pussyfooting around with majority votes and filibusters…either get in line of get out.\n\nOne of these days the Democrats will realize they can’t keep up with the winning strategy of the Republican party. It doesn’t matter how many more votes the Dems get, the GOP continues to grow stronger. With Schumer out of the way it will grow even stronger. The alleged file on Franken includes things like pushi", "comment_2": "Libtard Hero Al Franken Forced To Resign In Disgrace https://t.co/kdZPxgqeVz", "comment_1": "Libtard Hero Al Franken Forced To Resign In Disgrace | Breaking https://t.co/x2odyw2PrX", "split": "train", "label": "fake"}
{"comment_3": "BREAKING: FBI Issues Warrant For Obama’s Arrest After Confirming Illegal Trump Tower Wiretap https://t.co/GtXpZSh3QE", "article": "Former president and breaker of laws, Barack Obama, will either surrender himself or be picked up by the FBI sometime today to be booked and charged with unlawful use of authority, wire fraud and conspiracy to interfere with free elections after it was confirmed that he ordered the tapping of the phones at Trump Tower during the presidential election.\n\nThe order, which isn’t something even a president can do without the signature of a federal judge, was to listen in on Trump and his children to try to find a connection to Russia. Nothing came of it since President Trump nor any of his campaign staff have ever been to, spoken with or had anything to do with Russia or its agents.\n\nTrump first disclosed the bombshell in an early morning tweetstorm, knowing already that the FBI was preparing charges and asking a judge to sign a warrant for Obama’s arrest. Todd McMartin, a spokesman for the FBI, told Fox News: Trump first disclosed the bombshell in an early morning tweetstorm, knowing already that the FBI was prep", "comment_2": "FBI Issues Warrant for Obama’s Arrest After Confirming Illegal Trump Tower Wiretap? https://t.co/69Odq8VBGK https://t.co/ObLmRYEHAm", "comment_1": "FACT CHECK: FBI Issues Warrant for Obama’s Arrest After Confirming Illegal Trump Tower Wiretap? https://t.co/txeQH39Hxi", "split": "train", "label": "fake"}
{"comment_3": "Democrat Maxine Waters Has Shown Up To Only 10% Of Congressional Meetings For 35 YEARS😡😡😡👎🏻👎🏻👎🏻 https://t.co/xGwGRumhOR", "article": "Maxine Waters (D-CA) is one of the most unpleasant people to ever hold be a public servant. She is always, angry, something that she wears as a badge of honor. She has pushed the lie about President Trump having Russian connections and has even had to admit that no facts exists to condemn the White House for.\n\nNow the demented Democrat is looking even more foolish since an observant Reddit user known as 1tch has taken the time to gather the facts together showing that “Over Her 35 Years In Congress Maxine Waters Has Missed 90% Of Congressional Meetings.”\n\nKnown in some circles as “the Poverty Pimp,” Waters has been peddling race baiting, socialist agenda’s, and a hatred for President that borders is obsessive, she has accomplished very little in her career.\n\nEven today, she finds herself above impeachment and was so terribly rude to one of her own constituents that watching the video of it is cringe worthy, to say the least.\n\nOn top of that, she seems to imply that as a woman of color, she can not be thrown o", "comment_2": "Democrat Maxine Waters Has Shown Up To Only 10% Of Congressional Meetings For 35 YEARS https://t.co/V1829H9nIt  new Name is #NoshowWaters", "comment_1": "Democrat Maxine Waters Has Shown Up To Only 10% Of Congressional Meetings For 35 YEARS https://t.co/ThcZitIZSX", "split": "train", "label": "fake"}
{"comment_3": "@mjfree Truth👇\n\nMORGAN FREEMAN: ‘JAILING HILLARY’ BEST WAY TO ‘RESTORE PUBLIC FAITH IN GOVT’ https://t.co/DLyt8hyCaB", "article": "302 SHARES Share Tweet\n\nThe best way to restore public faith in government institutions is to “send Hillary to prison“, according to Hollywood icon Morgan Freeman, who warns that unless the former First Lady’s crimes are seen to be punished, “everyday Americans will forever know, deep down, that there is one law for those with money and power, and another for the rest of us.”\n\n“Hillary should be in jail for her unlawful deeds and President Trump should absolutely, absolutely make sure this happens to send the very strong message that no-one, and I mean no-one, is above the law in the United States of America,” Morgan Freeman said in New York while promoting National Geographic’s new docu-series The Story of Us.\n\nResponding to a question about why he thinks President Trump has not yet fulfilled this particular campaign promise, Freeman laughed and said and looked up at the heavens before saying, “Goddamnit man, you were elected for this very reason, lock that bitch up!”\n\nAfter being accused of political incorr", "comment_2": "Morgan Freeman: ‘Jailing Hillary’ Best Way To ‘Restore Public Faith In Govt’\n\nhttps://t.co/yNN4sFMi7J", "comment_1": "@HillaryClinton Hollywood Report - Morgan Freeman: ‘Jailing Hillary’ Best Way To ‘Restore Public Faith In Govt’.\nRe… https://t.co/FP06gwVKl2", "split": "train", "label": "fake"}
{"comment_3": "CNN To Permanently Close Its Doors As Ratings Plunge 30 Percent https://t.co/7Sx7kN5HJp via @YouTube", "article": "CNN is on the verge of permanently closing its doors after its ratings collapsed even more than last week, falling a staggering 30 percent in the second week of May.\n\nWhile Fox News increased its total viewers by a healthy 6 percent and MSNBC held steady, CNN’s viewership took a nosedive, signalling that the failing news network may be about to come to an abrupt end.\n\nBreitbart.com reports: While no one in the media want to talk about it, CNN’s relentless fake news sprees have not only created a massive credibility problem for the hate network, the far-left cable channel’s ratings crisis is even more severe.\n\nCNN lies.\n\nNumbers do not…\n\nLast week, during the all-important primetime hours, CNN was only able to average 844K total viewers. During this same week last year, CNN averaged 1.191 million. That is a -29 percent collapse.\n\nCNN’s average total day viewers disintegrated by -25 percent, 841K compared to 635K.\n\nIn other words, throughout the day last week, CNN could only attract an average of 635,000 total ", "comment_2": "CNN To Permanently Close Its Doors As Ratings Plunge 30 Percent https://t.co/uogz6B55ml", "comment_1": "CNN To Permanently Close Its Doors As Ratings Plunge 30 Percent https://t.co/KqjgvlahVl via @YouTube", "split": "train", "label": "fake"}
{"comment_3": "Babysitter on Crystal Meth Eats 3-Month-Old Baby https://t.co/2xqIMRBzet", "article": "9.6k SHARES Share Tweet Share\n\nDe Soto, Missouri – Parents of a three-month old baby were horrified to discover their babysitter had turned into a crystal meth-smoking cannibal when they found the remains of their child cooked in the microwave.\n\nAccording to police report, the young parents, were out at the movies before they came back home to find a confused babysitter under the influence of alcohol and crystal meth who had lost consciousness and was covered in blood in the family’s living room.\n\nMoments later, the parents made the gruesome discovery when the young mother saw something moving in microwave.\n\nThe 16-year-old babysitter named ‘Anna Ritchie’, claims she had brought some crystal meth and only took a few hits before she became hungry and eventually lost consciousness.\n\n“I just took a few hits because I was bored and wanted to stay awake,” she told Officer Robert. “All I remember is that I started getting really hungry, ate some chicken wings and passed out” recalls the police officer, visibly trau", "comment_2": "Missouri: Babysitter on Crystal Meth Eats 3-Month-Old Toddler https://t.co/Zo0yoXwUYd Again, I say, we have a socie… https://t.co/4JUJNxqPYl", "comment_1": "Easy snow day at the office for PolitiFact....\"Babysitter on crystal meth eats 3-month-old baby.\" Fake!", "split": "train", "label": "fake"}
{"comment_3": "New post (National Guard Storms Mexico Border, Makes Game Changing Impact In Just 30 Days) has been published on  -… https://t.co/891a6m3LQb", "article": "A major game-changing incident took place after the National Guard stormed the border to protect the immigration laws and defend citizens from having nearly 2,000 people break into America illegally. America is a land of laws and those wishing to immigrate to the country must follow the proper laws and protocol because people cannot simply walk in without following the rules. Thanks to the National Guard arriving at the border to help lend a hand to the roving tribe of potential illegal immigrants, The U.S. Customs and Border Protection officers were able to arrest 1,600 extra people who were trying to allegedly cross the border illegally.\n\nOut of those 1,600 it’s unknown how many people have criminal records, but they were all about to have a criminal record if they broke into a country illegally. The National Guard helped protect the border and provided the extra manpower that was needed to keep the situation under control. It was reported that the level of criminal activity has slowed due to the agents bei", "comment_2": "National Guard Storms Mexico Border, Makes Game-Changing Impact In Just 30 Days https://t.co/X5d6vOjSqu", "comment_1": "National Guard Storms Mexico Border, Makes Game-Changing Impact In Just 30 Days https://t.co/x6VKsATnPg @jjauthor", "split": "train", "label": "fake"}
{"comment_3": "Miley Cyrus: 'Donald Trump is a F--king Nightmare' https://t.co/W60WZFToQU via billboard", "article": "Donald Trump took a major step toward securing the Republican presidential nomination following the mogul’s Super Tuesday victory, and faced with the prospect of a President Trump, Miley Cyrus turned to Instagram Tuesday to tell her 38.1 million followers, “Donald Trump is a fucking nightmare!”\n\nCyrus wrote the caption next to a publicity photo of Trump; Cyrus’ Instagram burn has gained 239,000 likes since it was posted Tuesday. On Wednesday, the Dead Petz singer continued lobbying against the GOP frontrunner with a photo of Trump’s delegate totals over Ted Cruz and Marco Rubio and a caption where Cyrus playfully threatened to move out of the country if Trump is elected and a hashtag #aintapartyindausaanymo.\n\nRelated How America Made Donald Trump Unstoppable\n\nDonald Trump is a fucking nightmare! A photo posted by Miley Cyrus (@mileycyrus) on Feb 29, 2016 at 12:35pm PST\n\ngonna vom / move out da country. #aintapartyindausaanymo A photo posted by Miley Cyrus (@mileycyrus) on Mar 1, 2016 at 6:32pm PST\n\nCyrus’ Ins", "comment_2": "Miley Cyrus: \"Donald Trump is a f--king nightmare\" https://t.co/YVWEXjwVVQ https://t.co/L1HdEf9aPH", "comment_1": "Miley Cyrus: 'Donald Trump Is a F--king Nightmare' https://t.co/r0vUgAsNY2", "split": "train", "label": "fake"}
{"comment_3": "Jimmy Carter: “Medical Marijuana Cured My Cancer” https://t.co/ntM6p5n9Aw", "article": "Cannasos reports:\n\nBy Jacqueline Austin\n\nThe Nobel winner thanked his doctors and family for their support through his brain cancerordeal. He also thanked Terrance ‘Scooby’ Williams of Dr. Green’s Greenery, a pot dispensary in Oakland, CA, for helping him find the right strain of cannabis.\n\nCarter told his medicinal regiment to Sawyer“I smoke two joints in the morning, I smoke two joints at night, I smoke two joint in the afternoon, and it makes me feel all right.\n\n“Edibles are also good when traveling when smoking is not permitted.”\n\nThe future is bright for the 91-year-old humanitarian. Carter has resumed his house building for Habitat for Humanity and continues his weekly prayer service. “Marijuana is God’s medicine. I find indica is better than sativa, but there are plenty of good hybrids.“\n\nCarter wasn’t endorsing pot smoking for everyone. “There is the right place and the right time to spark up a bowl. Don’t be a pothead but also be aware of the potential benefits of cannabis when used in moderation wit", "comment_2": "#MustWeed Jimmy Carter: “Medical Marijuana Cured My Cancer” https://t.co/Brxm3OBnqf https://t.co/U2tgbXpBl2 https://t.co/zYgdRLg4md", "comment_1": "Jimmy Carter: “Medical Marijuana Cured My Cancer” https://t.co/96IxRYlMzJ via @LukeWeAreChange", "split": "train", "label": "fake"}
{"comment_3": "Obama Announces Bid To Become UN Secretary General https://t.co/bo7GcZAW6a", "article": "Barack Obama has announced plans to become secretary general of the United Nations, allowing him to advance his globalist agenda on the world’s stage.\n\nAccording to Al-Jarida, Obama has no intention to step away from the spotlight, much to the dismay of other world leaders such as Israeli Prime Minister Benjamin Netanyahu:\n\nIsraeli Prime Minister Benjamin Netanyahu reportedly is planning payback for President Obama’s dismissing Mr. Netanyahu’s objections to the Iran nuclear deal last year. Mr. Netanyahu is said to be rallying moderate Arabs to thwart Mr. Obama’s bid to become the Secretary-General of the United Nations after he leaves the White House next year.\n\nMr. Obama has already discussed the issue with Republican, Democratic and Jewish officials in the United States, according to Kuwaiti newspaper Al-Jarida.\n\nMr. Netanyahu recently is said to have gotten wind of Obama’s plans which he calls the Obama Project. “Wasn’t eight years of having Obama in office enough?” Mr. Netanyahu is quoted in the Kuwaiti d", "comment_2": "Obama Announces Bid To Become UN Secretary General https://t.co/qK5qYLnmIY via @yournewswire 👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻", "comment_1": "Obama Announces Bid To Become UN Secretary General https://t.co/wIC8AQzTd8", "split": "train", "label": "fake"}
{"comment_3": "BREAKING: CZECH REPUBLIC ARMS CITIZENS – “YOU CAN NOW SHOOT TERRORISTS ON SIGHT” https://t.co/7pLxF6e7wz", "article": "WITH THE EUROPEAN MIGRANT CRISIS GROWING WORSE EVERY SINGLE DAY, MANY DOUBT THAT EUROPE WILL BE ABLE TO SURVIVE ITS SELF-INFLICTED IMMIGRATION WOUNDS.\n\nSome Islamic leaders have even stated that Europe will be ruled under a caliphate within the next 2 generations. While many politicians are as spineless and weak as can be, such as Merkel, Macron, and London’s Mayor, some are standing up to the atrocity that is Islamic Extremism.\n\nIn an incredible turn of events, 139 out of 168 deputies voted in favor of an amendment which would allow citizens to carry guns and shoot terrorists on sight. “We do not want to disarm our own people at a time when the security situation is deteriorating,” Interior Minister Milan Chovanec said on Wednesday.\n\nSputnik News, a news agency centered in Moscow, reports:\n\n“The new law states that Czech citizens have the right to acquire, keep and bear arms in order to ensure the security of the state.”\n\n“It means that the approximately 360,000 licensed gun-owners in the Czech Republic are ", "comment_2": "BREAKING: Czech Republic Arms Citizens - \"You Can Now Shoot Terrorists On Sight\" ⋆ Silence is Consent https://t.co/5umiNWkIUx", "comment_1": "BREAKING: CZECH REPUBLIC ARMS CITIZENS – “YOU CAN NOW SHOOT TERRORISTS ON SIGHT” https://t.co/LmSZtERmji", "split": "train", "label": "fake"}
{"comment_3": "Well it is Fox so called news. Fake news built into a real story,\n\"Jefferson Davis statue to be replaced with Obama likeness.\"", "article": "Workers in New Orleans dismantled the city’s Jefferson Davis monument early Thursday, removing the prominent statue of the Confederate leader that had stood for more than 100 years.\n\nAs workers slung a strap around the statue’s waist and lifted it off its pedestal, at least 100 people cheered from across the street, outnumbering the few dozen protesters of the removal, some waving Confederate flags.\n\n“This historic moment is an opportunity to join together as one city and redefine our future,” Mayor Mitch Landrieu said as he announced that crews had begun removing the statue, the second of four planned removals of Confederacy-related monuments.\n\nThe Mayor also made an announcement that the statue would be replaced with a bronze statue of the 44th President Barack Obama.\n\n“It will be nice”, Landrieu said, “to see a monument to our first African-American President in the same spot that used to be a place to memorialize old racist White privilege.”\n\nThe Obama statue will be patterned after one erected in Kenya l", "comment_2": "ISIS/Taliban in Amerika: vernietig kultuur voorgangers:\nJEFFERSON DAVIS STATUE TO BE REPLACED WITH OBAMA LIKENESS https://t.co/8m0yFI2LQh", "comment_1": "Is a Jefferson Davis Statue to be Replaced with Obama Likeness? https://t.co/cnGRqHCZiP https://t.co/l9KWP7y3Ie", "split": "train", "label": "fake"}
{"comment_3": "\"New regulation requires motorcycle owners to install 75 MPH governor by January 2017\" - PolitiFact (blog) https://t.co/ekuk23Sko1", "article": "The government has implemented a new regulation requiring a governor to be placed on all motorcycles by mid-January 2017. The purpose of the mandatory governor would be to prevent motorcyclists from exceeding a speed of 75- miles per hour. The regulation aims to drastically reduce the amount of annual motorcycle fatalities in the United States.\n\nMany are not surprised by the regulation as politicians have been asking for stricter safety features to be implemented on motorcycles for the past several decades. In 2014, the government offered all major motorcycle manufactures including Harley-Davidson, Yamaha, Honda, Ducati, Kawasaki, Suzuki, and BMW a large tax-incentive to begin implementing governors on all newly manufactured motorcycles, however to much surprise, all relevant manufactures declined to take advantage of the additional tax-incentive, requiring government officials to return to the drawing board.\n\nMembers of the U.S. Department of Transportation or U.D.O.T were supportive of the regulation and he", "comment_2": "New Regulation Requires Motorcycle Owners To Install 75 MPH Governor By January 2017 https://t.co/3vErMbEyi8 via @Associated Media Coverage", "comment_1": "New Regulation Requires Motorcycle Owners To Install 75 MPH Governor By January 2017 https://t.co/id11AFKjra", "split": "train", "label": "fake"}
{"comment_3": "US Representatives Promise Implement Of UN Gun-Control Plans https://t.co/QYarfrLIRe via @ConDailyPost", "article": "The Second Amendment has continuously been under assault in the United States and in the United Nations. Most often, the attacks came from Democrats and other leftists who have long wanted to see a disarmed populace, with only the government and military maintaining access to firearms. Most liberals know that an armed population will not willingly become slaves.\n\nMany people ascertain that the United Nations has long worked, on an international level, to undermine the right of individuals to keep and bear arms, particularly the right of Americans to do so. In a recent document, it certainly sounds like representatives of the United States promised “full implementation” of the UN’s gun-control agreement, and in doing so essentially forfeit the Second and Tenth Amendments to the United States Constitution.\n\nThe UN conference “provided an opportunity for participating countries to review their progress and reaffirm a commitment made in 2001 to limit the illicit trade of small arms and light weapons,” according t", "comment_2": "More proof we should pull out of the U.N. and throw them out of the U.S.\n@Potus @RealDonaldTrump \nUS Representative… https://t.co/D9Nq7hzTzJ", "comment_1": "US Representatives Promise Implement Of UN Gun-Control Plans https://t.co/uOCUCaLDiS via @ConDailyPost", "split": "train", "label": "fake"}
{"comment_3": "Proud to announce launch of website on  #ArunachalBudget2018 by Hon'ble Chief Minister Pema Khandu ji on March 12 a… https://t.co/aONI7aBwpc", "article": "Like · Comment · Share\n\n12,068 others like this\n\nView more comments 50 of 80,312\n\nJust Now · Like\n\nJust Now · Like\n\nEunice Garza Oh yeah! Going to london With my Friend #Juillet\n\nBryan Odum It was busy at Delta Airline counter today. It seems that many people have won these Tickets.\n\nJust Now · Like", "comment_2": "Have you accessed BNiQ yet? The paywall is DOWN until March 12, so take a look #underthehood!", "comment_1": "On March 12, @CareFirst determined an employee was victim of #phishing email that compromised their email account t… https://t.co/nfVwsUZf8f", "split": "train", "label": "fake"}
{"comment_3": "3,000-Pound Great White Shark Captured in Great Lakes https://t.co/s8BoKllVsl", "article": "218.9k SHARES Share Tweet Share\n\n\n\nWaukegan, IL | The capture of a huge 3,000-pound great white shark in Lake Michigan yesterday could explain the disappearance of missing people in the area in the last decade, has confirmed the U.S. Coast Guard this morning.\n\nCanadian tourist, John O’Keef and his friend from Chicago, Allan Brooks captured the 3,000-pound beast while fishing for sturgeon in Michigan Lake.\n\n“We reeled in the beast for a good 4-5 hours before my friend Allan finally shot it with a rifle and wounded it to the head” explains O’Keef.\n\n“I’d heard of the Lake Michigan monster, but never did I expect to catch it myself,” claims the 63-year-old Canadian tourist.\n\nThe great white shark estimated at more than 1.2 tons is the biggest fish ever caught in the region, believe experts.\n\nProfessor of biology at the University of Illinois, Allan Jameson said: “This is not common to find such a beast so far inland. Either rising sea temperatures and depleted fish stocks possibly led the shark to adventure itsel", "comment_2": "3,000-Pound Great White Shark Captured in Great Lakes https://t.co/lUPKKCscN0", "comment_1": "3,000-Pound Great White Shark Captured in Great Lakes https://t.co/28OvUbxIog", "split": "train", "label": "fake"}
{"comment_3": "@KellyannePolls Liberal Women Hate Me Because Of My “Striking Beauty And Intellect”, Says Kellyanne Conway. \"She lo… https://t.co/Gfv6QU0PYP", "article": "Kellyanne Conway, counselor to President Trump claimed that Liberal women hate her because of her “striking beauty and intellect” in comments that were made to a reporter at a luncheon in Washington D.C.\n\nPundits were quick to capitalise on her comments and tell her that if she and her boss were doing a good job and being open and honest with the American people then she wouldn’t have to face much criticism.\n\n“Making ridiculous claims that she’s being hated because of her good looks is as ridiculous as it gets. The American people don’t care if she looks like a model or not. All they want is to see her doing a good job and not spinning facts around,” wrote James Collin, a New York based attorney and registered Democrat.\n\nKellyanne Conway’s comments have caused reactions on social media especially on Twitter where she has been blasted as “a show off and trying to divert attention from the most important issues facing our country.”\n\nWhat do you think of her comments? Let us know in the comments section below an", "comment_2": "Liberal Women Hate Me Because Of My \"Striking Beauty And Intellect\", Says Kellyanne Conway - London Web News https://t.co/KwcwJOFj5S", "comment_1": "Liberal Women Hate Me Because Of My “Striking Beauty And Intellect”, Says Kellyanne Conway https://t.co/sZYk7sMOMW", "split": "train", "label": "fake"}
{"comment_3": "BREAKING: Malia Obama Arrested With A Gang Of Thugs In Chicago https://t.co/qeuZuPBmrx https://t.co/UjEKjz2nPP", "article": "Malia Obama may have done irreparable harm to her career this morning when she decided to join a gang of thugs in Chicago for a day of drinking, drugs and dogfighting at a public park in Chicago. Malia was arrested along with seven others and charged with wanton endangerment of animals, public intoxication and possession of a controlled substance.\n\nShe was found in the company of mostly older men when police arrived after being called by a concerned citizen complaining about a loud group of people watching dogs fight in the park. According to a witness:\n\n“They was all just right out there in the open drinkin’ and lettin’ their dogs go at it. I saw some smoking weed. Some were doing other things I don’t know. All those dudes had that baggy pants thing. They weren’t the types of people you’d expect that girl to be with.”\n\nAccording to the Secret Service, Malia had slipped away late last night after being told open air parties at public parks were too dangerous. She wasn’t seen again until she showed up in the 1", "comment_2": "BREAKING: Malia Obama Arrested With A Gang Of Thugs In Chicago - Conservative Flash News https://t.co/rFsNnfHkcs", "comment_1": "Malia Obama was arrested with 'gang of thugs' in Chicago, fake news site claims: https://t.co/qslpWbWUfs via @AOL", "split": "train", "label": "fake"}
{"comment_3": "Obama passed law for grandparents to get all their grandchildren every weekend https://t.co/X2y28HdPT0", "article": "The authors of posts of bullying or that advocate acts of terrorism or violate public order are subject to prosecution.\n\nTips : You must be creative but keep in mind to make it fun.\n\nTitle: Choose a catchy title for your joke. Make your friends curious.\n\nDescription: Be creative and make your friends curious.\n\nImage: Upload one or search one. Make sure they are free of use!", "comment_2": "Obama passed law for grandparents to get all their grandchildren every weekend https://t.co/ZEj6kZNJIc", "comment_1": "Obama passed law for grandparents to get all their grandchildren every weekend https://t.co/aXwS86KwtD", "split": "train", "label": "fake"}
{"comment_3": "WOW: Obama Orders Life-Sized Bronze Statute of Himself To Be Permanently Installed in White House \nhttps://t.co/ubHmOJImOW", "article": "0\n\nWASHINGTON, D.C. –\n\nPresident Obama has ordered a $200,000, life-sized, bronze statue of himself, with plans to install it in the entryway of the White House. The president says that his legacy “should not be diminished,” and that this is the only way he can “keep an eye” over Trump, as well as future presidents.\n\n“I have been president for only eight years, and in that time, I have done what no other presidents could do in all their time in total,” said Obama. “I have created a legacy that should not be diminished. I have created something that no future president will be able to do. In that regard, I have commissioned this statute, with plans to have it permanently erected in the entryway of the White House, so that all who enter can remember me fondly.”\n\nThe statue will not be allowed to be removed, as every president is allowed to leave one thing in the White House that must never be touched by future presidents. William Howard Taft left his giant bathtub. Bill Clinton left one of his saxophones. Georg", "comment_2": "WOW: Obama Orders Life-Sized Bronze Statute of Himself To Be Permanently Installed in White House: https://t.co/klXr8CtPa0", "comment_1": "WOW: Obama Orders Life-Sized Bronze Statute of Himself To Be Permanently Installed in White House: https://t.co/Lxszmtup35", "split": "train", "label": "fake"}
{"comment_3": "Keanu Reeves Shock The World With Another Powerful Message https://t.co/ostXKCPPlb", "article": "Sign up for your daily dose of enlightenment and positivity!\n\nSubmit", "comment_2": "Keanu Reeves Shock The World With Another Powerful Message https://t.co/NzJTGfctmI", "comment_1": "Keanu Reeves Shock The World With Another Powerful Message https://t.co/85QOmgbm4O", "split": "train", "label": "fake"}
{"comment_3": "WAR ON CHRISTMAS: OBAMA ORDERS BAN ON CHRISTMAS CARDS TO MILITARY https://t.co/ooqTyqiaVc Obama is a Huge Muslim  POS  period.", "article": "U.S. President Donald Trump has long positioned himself as a front-line soldier in the so-called War on Christmas, which made non-Christians justifiably nervous as they anticipated his administration’s first holiday season as a religiously charged, exclusionary and divisive affair.\n\nTo really understand Trump and the Middle East - subscribe to Haaretz\n\nskip - Thank You, President Trump\n\nIndeed, days before the holiday, a pro-Trump video featuring a little blonde girl lisping “Thank you, President Trump, for letting us say ‘Merry Christmas’ again,” as if the words had somehow been previously banned or outlawed.\n\nskip - christmas proud\n\nPeople are proud to be saying Merry Christmas again. I am proud to have led the charge against the assault of our cherished and beautiful phrase. MERRY CHRISTMAS!!!!! — Donald J. Trump (@realDonaldTrump) December 25, 2017\n\n>>Netanyahu enlists in Trump's army: \"Israel is a country that says 'Merry Christmas'\"\n\nAnd then on Christmas Eve, Trump tweeted that he was \"proud\" to have b", "comment_2": "Happy Holidays! RT @billbong9059 WAR ON CHRISTMAS: OBAMA ORDERS BAN ON CHRISTMAS CARDS TO MILITARY https://t.co/GKYddAc9dr", "comment_1": "WAR ON CHRISTMAS: OBAMA ORDERS BAN ON CHRISTMAS CARDS TO MILITARY https://t.co/2MG0r2RDgO", "split": "train", "label": "fake"}
{"comment_3": "Morgue employee cremated by mistake while taking a nap https://t.co/VbX56NTXXJ", "article": "Beaumont, Texas | An employee of the Jefferson County morgue died this morning after being accidentally cremated by one of his coworkers.\n\nAccording to the Beaumont Police Department, 48-year old Henri Paul Johnson decided to take a nap on a stretcher after working for sixteen hours straight.\n\nWhile he was sleeping, another employee mistook him for the corpse of a 52-year-old car accident victim and carried him to the crematory.\n\nBefore anyone could notice the mistake, he had already been exposed to temperatures ranging between 1400 to 1800 degrees Fahrenheit and reduced to ashes.\n\nJenna Davis, one of Henri Johnson’s coworkers, says she heard him scream for about 15 seconds after the crematory was activated.\n\n“At first, we didn’t understand where the sound was coming from. When we realised what was happening, it was too late. We shut down the heating system, but he was already dead.”\n\nMs. Davis claims that the young coworker who caused the accident was a new employee and had forgotten to check for the toe tag", "comment_2": "Morgue employee cremated by mistake while taking a nap https://t.co/rAL5HXddER", "comment_1": "Morgue employee cremated by mistake while taking a nap https://t.co/cp1KwXnC7V", "split": "train", "label": "fake"}
{"comment_3": "Red Crescent Says No Evidence of Chemical Attack in Syria’s Douma https://t.co/RfPy0BnDyV", "article": "Update:\n\nThe Syrian Arab Red Crescent statement was reported, and at the time we had no reason to believe it was not true. Subsequent questions have emerged, however, and the International Federation of Red Cross and Red Crescent is saying they are unaware of such a statement having ever been issued by the Syrian branch. They further say the Syrian Red Crescent was shut down in Douma effective April 7.\n\n—\n\nThe Syrian Red Crescent issued a statement Monday dismissing the allegations of a weekend chemical weapon attack in the city of Douma. The statement insisted their medical personnel in the city had found no evidence any such attack took place.\n\nThe Syrian Red Crescent said their hospital in Douma received six patients complaining of respiratory problems, but said they didn’t seem to have any physical problems at all, nor was there any trace of any chemical agents they might’ve been exposed to.\n\n(This has been retracted, it is incorrect.)\n\nChemical attack or no, it wouldn’t be surprising for some people to c", "comment_2": "Red Crescent Says No Evidence of Chemical Attack in #Syria’s #Douma -  https://t.co/bzoESwTKc9 #douma_gas_attack… https://t.co/Cvd860Iq1j", "comment_1": "Red Crescent Says No Evidence of Chemical Attack in Syria’s Douma https://t.co/Qpb2CpL1wR", "split": "train", "label": "fake"}
{"comment_3": "The Land That Time Forgot: North Carolina's Nine Hundred 112 Year Old Voters 'Like Calling NC Home' http://t.co/UnVoOSrg", "article": "Early voting began in North Carolina in October, and soon after almost 900 voters aged 112 reportedly cast ballots. In fact in 2008, almost 10,000 108-year olds cast ballots and just over 9,000 110-year olds voted in 2010.\n\nHave this many centenarians actually been voting in North Carolina, or is this a sign of voter fraud as some have asked? Neither, according to the State Board of Elections.\n\nThe true explanation is much less exciting.\n\nPrior to passage of the National Voter Registration Act (NVRA) in 1993, the state did not require those registering to provide their birth date. While most voters who registered before NVRA did provide birth dates, some did not. These voters were automatically assigned a default birth date of 01/01/1900 in the state’s voter rolls. So while these voters are still diligently voting, it is very doubtful they are 112 years old.", "comment_2": "#Voters The 94-Year-Old Civil-Rights Pioneer Who Is Now Challenging #NorthCarolina’s Voter-ID Law via @thenation https://t.co/oTG6vg4kKW", "comment_1": "Number of 112 Year Old Registered #Democrat #Voters Now at 3,020 in North Carolina.  I, for ONE, am PERFECTLY ... http://t.co/onZpSbxx", "split": "train", "label": "fake"}
{"comment_3": "Melania Trump: ‘If ISIS Lay A Finger On Barron, I’ll Scratch Obama’s Eyes Out’ https://t.co/DYDHxUuWZB https://t.co/Ak9LAEgwMz", "article": "First Lady Melania Trump has warned former president Barack Obama that if ISIS terrorists “lay a finger” on Barron Trump, she will “scratch his eyes out.”\n\nMelania Trump’s warning comes days after ISIS terrorists used social media to call for the assassination of Barron Trump.\n\nThe terror group is sharing personal details about the 11-year-old boy on social media channels, including the private address of his school, and Melania Trump is pulling no punches, laying the blame for the rise of ISIS firmly at the feet of Barack Obama.\n\nThe Middle East Media Research Institute (MEMRI) translated the mass calls for the murder of President Trump’s youngest son on the popular “Telegram” app.\n\n“Using the hashtag ‘handle the son of the mule of America,’ the supporter, who uses the name ‘Dak Al-Munafiqeen,’ Arabic for ‘striking the hypocrites,’ wrote: ‘Barron Trump goes to this school in Washington,'” according to MEMRI. “The post was followed by a photo of Barron Trump. To widely disseminate the call for assassination, ", "comment_2": "Melania Trump: ‘If ISIS Lay A Finger On Barron, I’ll Scratch Obama’s Eyes Out’ https://t.co/8fVt6cVyVz https://t.co/eOyVzXi530", "comment_1": "Melania Trump: 'If ISIS Lay A Finger On Barron, I'll Scratch Obama's Eyes Out' https://t.co/J3fB9O4L5Y", "split": "train", "label": "fake"}
{"comment_3": "Sasha Obama Just Crashed Her Expensive New Car Into A Lake? https://t.co/hlyfowZVex", "article": "About Trendolizer™\n\nTrendolizer™ (patent pending) automatically scans the internet for trending content. The website you are looking at has no human editors at all: links to trending stories are automatically posted from a selection of the data Trendolizer™ picked up. If you are interested in using the Trendolizer™ engine, dashboard or API for your own projects, more information is available at get.trendolizer.com . Trendolizer™ is owned by Lead Stories LLC\n\nPrivacy policy\n\nThis site uses cookies to track user behaviour on this site, without linking to personally identifiable data. Advertisers may also use cookies, but the scope and nature of this use is beyond our control.", "comment_2": "Sasha Obama Just Crashed Her Expensive New Car Into A Lake? https://t.co/jt3huBNKx9", "comment_1": "Sasha Obama Just Crashed Her Expensive New Car Into A Lake? https://t.co/wIeAJN8qpf https://t.co/S16edwOmbL", "split": "train", "label": "fake"}
{"comment_3": "Carnival's 72-Hour Sale to Offer Cash Back, Free Upgrades on a ...: Today, Carnival Cruise Lines launches a 72-H... http://bit.ly/hWBY1d", "article": "Greensburg clown found eating a live cat. Late last night Greensburg police received a phone call from a worried resident saying \"she heard very concerning sounds coming from an alley way near her house\". Upon arrival officers instantly heard the noise she was talking about but never expected what they where about to see. Upon investigation they found a 21 year old male dressed as a clown eating a live cat who's legs were zip tied together. The cat was still crying for help as the individual was seemingly eating around the vital spots prolonging it's death. When he noticed the officers he started petting the cat and told the officers \"curiosity killed the cat, I wanted to see if it tasted like Chinese food.\" He was non resistant during arrest however did not have identification when asked his name he always replied \"furball munchinsrein the clown\". In the holding cell it was reported he kept calling to a female officer \"here kitty kitty kitty\" she eventually approached him and said what he reportedly said \"I ", "comment_2": "Travelocity:  Free Stateroom Upgrades from Carnival Cruise Lines! Offer ends 5/27! http://bit.ly/dhlboy", "comment_1": "Foremylife Free Stateroom Upgrades from Carnival Cruise Lines! Offer ends 5/27! http://t.co/mUnXaZp", "split": "train", "label": "fake"}
{"comment_3": "412 MICHIGAN MUSLIMS ARRESTED ‘LARGEST BUST IN U.S. HISTORY’!! THEY HIT THE MOTHERLOAD! – Deplorable Politics https://t.co/bwU6CVi9LM", "article": "The state of Michigan is quickly turning into a Sharia swamp, thanks to the reckless immigration policies of Obama over the past 8 years. Not only are portions of Michigan being transformed into a “mini Baghdad,” but the state is also being overrun with rampant illegal activity, where the Muslim populace is constantly being busted in welfare fraud and disgusting mutilation practices on little girls. Now thanks to the hordes of Muslims taking over the state, Michigan can add another “accomplishment” on their list, as the Justice Department is dubbing what just went down in this state the “largest scam in United States history.”\n\n\n\nThe corrupt establishment will do anything to suppress sites like the Burning Platform from revealing the truth. The corporate media does this by demonetizing sites like mine by blackballing the site from advertising revenue. If you get value from this site, please keep it running with a donation. [Jim Quinn - PO Box 1520 Kulpsville, PA 19443] or Paypal ------------------------------", "comment_2": "‘The Largest Bust in U.S. History’ 412 Muslims Arrested from Michigan! - Fresh Media News https://t.co/33P7gu8ECZ", "comment_1": "The Largest Bust in U.S. History’ 412 Muslims Arrested from Michigan https://t.co/VBsVUUs2lk", "split": "train", "label": "fake"}
{"comment_3": "Computer Models Show IRMA Destroying New York City On Sept. 10 https://t.co/u9OVKeFb3x", "article": "All 5 Boroughs of New York City and most of New Jersey could be totally destroyed on September 10 by Hurricane IRMA, according to computer simulations.\n\nBy 12:00 noon on September 10, computer models show that the strength and path of IRMA risk totally obliterating New York.\n\nHalturnerradioshow.com reports: The National Weather Service, and its National Hurricane Center utilize supercomputers to predict where hurricanes will travel based on hundreds-of-thousands of pieces of weather data. The system they use is called Global Forecast System (GFS).\n\nAt 2:00 this afternoon, Friday, September 1, the GFS model spit out its projection of Hurricane IRMA’s path over the next 12 days. This model shows the utterly terrifying projected path of Hurricane IRMA coming right up the east coast, and making landfall in NEW YORK HARBOR as a Category 5 Hurricane, with winds in excess of 157 MPH.\n\nI am not a weather expert. I do not profess to have any idea at all about the accuracy of these computer models. As a layman, I know ", "comment_2": "Computer Models Show IRMA Destroying New York City On Sept. 10 https://t.co/rw61Zhj2z3 via @yournewswire", "comment_1": "Computer Model Shows IRMA DESTROYING New York City &amp; NJ on Sept. 10 https://t.co/pw37Aa5oSK https://t.co/w7VHQ97smk", "split": "train", "label": "fake"}
{"comment_3": "Red Hen Owner Just Issued Sick Threat To Sarah Sanders After Biz Was Destroyed By Booting Her https://t.co/xNw3nztk5E", "article": "Domain Suspension\n\nThis domain has expired and is now suspended. If you would like to restore it please contact the registrar used to register your domain. You can check the registrar used for your domain at whois.CO.\n\nEste dominio ha expirado y está ahora suspendido. Si usted es el titular del dominio y quisera recuperarlo, por favor contacte el registrador que fue usado para registrar el dominio.", "comment_2": "Red Hen Owner Just Issued Sick Threat To Sarah Sanders After Biz Was Destroyed By Booting Her https://t.co/htYR3MPNuF via @redrightvideos", "comment_1": "Red Hen Owner Just Issued Sick Threat To Sarah Sanders After Biz Was Destroyed By Booting Her… https://t.co/EavePgMM8R", "split": "train", "label": "fake"}
{"comment_3": "Police Find 19 White Female Bodies In Freezers With “Black Lives Matter” Carved Into Skin - TRENDING https://t.co/q0BZDWKWSN", "article": "Rasheed Thompson, 39 of Chicago, was arrested in connection with a series of dead bodies found in a freezer located in his basement. According to reports, the bodies had the words “Black Lives Matter” carved into the foreheads of the corpses.\n\nThe Chicago coroners office made a gruesome discovery today after several 911 calls were placed by neighbors regarding their concern of suspicious activity at the residence of Thompson. At approximately 8 p.m., police were dispatched to South Pulaski Road and West Lexington Street. Upon their arrival, their arrival, authorities were met by a group of residents at the corner where they assisted police in locating the home in question. Police proceeded to the 3000 Block of West Lexington Street where they located the home. Authorities knocked on the door of the residence and was met by an African-American male, who appeared to be in his late 30’s and seemed to be “under the influence of drugs”.\n\nUpon entering the home, authorities indicated that the home “smelled of death", "comment_2": "Police Find 19 White Female Bodies In Freezers With “Black Lives Matter” Carved Into Skin https://t.co/B1itzP5di2 via @TRENDING", "comment_1": "Police Find 19 White Female Bodies In Freezers With “Black Lives Matter” Carved Into Skin https://t.co/vScwnrOmhn via @tmzhiphop.com", "split": "train", "label": "fake"}
{"comment_3": "Clint Eastwood Leaves His Estate To The Trump 2020 Campaign https://t.co/c1JxAOJcJe via @", "article": "Clint Eastwood says his doctors have put him on notice to get his affairs in order and prepare for that final trip in one of those limousine station wagons we call a hearse. The famous actor, 89, says he’ll be lucky to see 2019:\n\n“I’ve had a good run. They say I’m probably gonna be on the list of dead people at the awards show next year. Me and that damned empty chair. Guaranteed. Why can’t folks just let that go?”\n\nEastwood, always in good spirits, says that he’s made a good life for his family and taken care of them with trust funds, homes and large insurance policies and that he’d like to see his personal estate go to something…bigger:\n\n“I have been able to sit here in this magnificent ranch watching as President Trump made America great again in just a few months. He’ll persevere through the witch hunt and I will do what I can to make his journey easier.”\n\nEastwood is donating his Northern California ranch, 40K acres of grazing land in Nevada and more than $7 million in cash and other assets to Trump’s 20", "comment_2": "Clint Eastwood Leaves His Estate To The Trump 2020 Campaign https://t.co/Wt93LwDXtu", "comment_1": "👏👏👏👏👏👏👏👏👏Clint Eastwood Leaves His Estate To The Trump 2020 Campaign https://t.co/rDaDq2ka0L via @", "split": "train", "label": "fake"}
{"comment_3": "BUSTED: Obama is Holding Secret Meetings to OVERTAKE the White House https://t.co/mA13wqxS6u", "article": "BUSTED: Obama is Holding Secret Meetings to OVERTAKE the White House", "comment_2": "BUSTED: Obama is Holding Secret Meetings to OVERTAKE the White House https://t.co/vuL8qbejNk\n\nTruthFeedNews", "comment_1": "BUSTED: Obama is Holding Secret Meetings to OVERTAKE the White House https://t.co/Y5W1PKRnfc", "split": "train", "label": "fake"}
{"comment_3": "Target to Discontinue Sale of Holy Bible https://t.co/sfaKrnYVdV via @noscomunicamos_", "article": "Target to Discontinue Sale of Holy Bible\n\nTarget CEO Brian Cornell announced today the retail giant will be discontinuing sales of the Holy Bible. The company has come under fire recently from religious groups for its new transgender bathroom policy. The King James Bible has been available for purchase at Target stores ever since the company was founded as Goodfellow Dry Goods back in 1902.\n\nSpeaking with CNBC, Cornell cited recent protests from what he calls “religious extremists” as the reason to pull the bible from its shelves. “Target will no longer cater to religious extremists,” said Cornell. “If that means removing the bible from our shelves, then so be it.” Cornell said the big box chain is “sticking to its guns” regarding their bathroom policy, and will be phasing out anything having to do with religion. “We believe that everyone, every team member, every guest, and every community, deserves to be treated equally, regardless of their religious beliefs.”\n\nMore…\n\n~~~~~~~~~~~~~~~~~~~~~~~~\n\nThis is the v", "comment_2": "Target to Discontinue Sale of Holy Bible https://t.co/SjBTxdl141", "comment_1": "Target to Discontinue Sale of Holy Bible https://t.co/e480fWbCs0", "split": "train", "label": "fake"}
{"comment_3": "Breaking News |  Witness Due to Testify Against Hillary Clinton, Survive... https://t.co/2po602IQFD via @YouTube", "article": "Representative Bob Goodlatte will miss out on the fun of issuing a subpoena. Photo: Pete Marovich/Bloomberg via Getty Images\n\nPeter Strzok, the FBI agent who sent anti-Trump messages to a colleague while leading the investigation of Hillary Clinton’s emails and Russia’s involvement in the Trump campaign, has said he’s willing to testify before the House Judiciary Committee, or any other committee that wants to talk with him. This could lead to dramatic hearings, as Strzok could expose more information about those probes, and is central to President Trump’s effort to discredit Special Counsel Robert Mueller’s investigation.\n\nReports last week indicated that House Judiciary chairman Bob Goodlatte was preparing to subpoena Strzok as part of the House investigation into the FBI’s conduct during the 2016 election. Strzok’s lawyer, Aitan Goelman, said in a letter to Goodlatte released Sunday that the move would be unnecessary, as Strzok “intends to voluntarily appear and testify before your committee and any other ", "comment_2": "@AIIAmericanGirI Between worrying about being arrested, investigated or worse case testify against @HillaryClinton… https://t.co/8F6Ni3e7fU", "comment_1": "Witness Due to Testify Against Hillary Clinton, Survives Ăssăssînatîoň A... https://t.co/LN61UT5OFo via @YouTube", "split": "train", "label": "fake"}
{"comment_3": "Lady Gaga Reveals Plan To Cover Her Face Again “Until Trump Gets Fired From Office And I Feel Free Once More” https://t.co/t3HaIEK4Kb", "article": "Lady Gaga has opened up about the perils of fame. In an appearance on CBS’s “Sunday Morning,” the “Million Reasons” singer talked about how her life has changed since becoming famous and how she feels like she has no freedom because of the attention she has been getting. Gaga also said that she finds solace in her home, and that leaving it gives her a bit of anxiety. “I’m very acutely aware that once I cross that property line I’m not free anymore,” Gaga said.\n\n“It’s like I’m stepping out into this entirely different world where everybody’s allowed to follow me, take pictures of me, treat me like a circus freak and flat out do whatever they want around me and I can’t even call the police to help me because they’re not doing anything wrong,” the singer complained. “I realize that this is part of what I wanted when I set out to become famous and fulfill my dreams, but nobody told me I’d have to give up my privacy completely. And to top it all off – we’ve just had the presidential election and the least favorite", "comment_2": "Lady Gaga Reveals Plan To Cover Her Face Again “Until Trump Gets Fired From Office And I Feel Free Once More”… https://t.co/nWLjqHMiX4", "comment_1": "Lady Gaga Reveals Plan To Cover Her Face Again “Until Trump Gets Fired From Office And I Feel Free Once More” |  https://t.co/EE6N6rsxQL", "split": "train", "label": "fake"}
{"comment_3": "Starbucks Just Placed Trump’s Photo on Floor so Every Customer have to Step On It…. SHUT Them Down @realdonaldtrump+ https://t.co/G2oDouIAFX", "article": "Please Support Online Petition To Congress For Banning Islam From U.S. If You Do Please Like This Form. Together We Can Do That!!!\n\nIslam is not a religion, it is a violent cult and should be banned from America. I urge you to sponsor and support legislation banning Islam from America. Remember To Start This Movement It Is Necessary To Get At Least 100,000 Likes!\n\nPGlmcmFtZSBzcmM9Imh0dHBzOi8vd3d3LmZhY2Vib29rLmNvbS9wbHVnaW5zL3BhZ2UucGhwP2hyZWY9aHR0cHMlM0ElMkYlMkZ3d3cuZmFjZWJvb2suY29tJTJGQW1lcmljYW4xc3RMYWR5JTJGJnRhYnMmd2lkdGg9MzAwJmhlaWdodD03MCZzbWFsbF9oZWFkZXI9dHJ1ZSZhZGFwdF9jb250YWluZXJfd2lkdGg9ZmFsc2UmaGlkZV9jb3Zlcj1mYWxzZSZzaG93X2ZhY2VwaWxlPWZhbHNlJmFwcElkPTIwMjQ1OTY3NjgwMDg5MSIgd2lkdGg9IjMwMCIgaGVpZ2h0PSI3MCIgc3R5bGU9ImJvcmRlcjpub25lO292ZXJmbG93OmhpZGRlbiIgc2Nyb2xsaW5nPSJubyIgZnJhbWVib3JkZXI9IjAiIGFsbG93VHJhbnNwYXJlbmN5PSJ0cnVlIj48L2lmcmFtZT4=", "comment_2": "Starbucks Just Placed Trump’s Photo on Floor so Every Customer have to Step On It…. https://t.co/y0ncg0hOJh", "comment_1": "@MrMayor73 Starbucks Just Placed Trump’s Photo on Floor so Every Customer have to Step On It…. https://t.co/uP7k7MJIZY", "split": "train", "label": "fake"}
{"comment_3": "BREAKING: Malia Obama SUSPENDED After Racist Anti-White Attack Goes Viral: https://t.co/kxOuDT1z9H\n\nSeems to run in the family....", "article": "BREAKING: Malia Obama SUSPENDED After Racist Anti-White Attack Goes Viral\n\nA few days ago, a student at Harvard leaked the contents of Malia Obama’s speech final. The topic? A World Without Whites. And now it may get Malia Obama suspended.\n\n“White people are so 1960’s. Sometimes the only thing that keeps me going is the fact that they will be blended out by the time I am 30,” a recording of Obama’s speech shared on Snapchat said. “Imagine a world without white people.” Obama was of course referring to the scientific belief that if whites continue to breed at low rates in America while others races continue to breed at current rates, white babies will be virtually nonexistent in our country by 2038.\n\nA post quoting Obama was shared more than 14,000 times with a reach of nearly 1 million Americans, which forced Harvard to take action.\n\n“This sort of attack against any race is uncalled for,” Harvard Dean Cain Markholder said in a statement Sunday. “Ms. Obama has been informed she is suspended pending an investig", "comment_2": "BREAKING: Malia Obama SUSPENDED by HARVARD After Racist Anti-White Attack Goes Viral: “Sometimes the only thing tha… https://t.co/qxQXWf1zJZ", "comment_1": "Obama’s great parenting?!! 😂😂😂BREAKING: Malia Obama SUSPENDED After Racist Anti-White Attack Goes Viral: https://t.co/1nZZw8jtp2", "split": "train", "label": "fake"}
{"comment_3": "Breaking: Mar-A-Lago Destroyed By Irma-Jared Kushner Still Missing https://t.co/QNtQc0GC2s", "article": "The building Jared Kushner was reportedly in is gone. .\n\nMar-A-Lago was at the front and center of a rogue wave created by the outer bands of Hurricane Irma. The wave, spanning hundreds of yards across and nearly 20-feet high crashed directly into the Palm Beach estate of President Trump.\n\nSeveral other properties on either side, including the home of guitar legend Kieth Richards, were also destroyed. The staff at Mar-A-Lago had been sent home except for those who live on the property. They were all in the “safe” building towards the rear of the property when the wave hit.\n\nThe building, designed by Eric Trump, was supposed to be able to withstand bunker-busting bombs. He told the National Report that the reason the water was able to penetrate was simple physics:\n\n“I designed the building for an air raid. Who would ever think that the threat would come from the side? Those walls were just normal walls to keep cost down. The roof was what was designed to absorb the impact. Mass equals force times accelarated i", "comment_2": "@Pete_Begins \"'Mar-A-Lago Destroyed By Irma--Jared Kushner Still Missing,' blares the headline from a website calle… https://t.co/xTBobYsVSf", "comment_1": "Breaking: Mar-A-Lago Destroyed By Irma-Jared Kushner Still Missing - Breaking! https://t.co/aiGc7oYny4", "split": "train", "label": "fake"}
{"comment_3": "Not even trying to hide the fact that they're a 4chan troll acount, Laguna Beach \"Antifa\" is now using the same pic… https://t.co/6bz7AwGySq", "article": "Adele Posted A Meme Of Herself After The End Of Her Marriage And All I Can Do Is Applaud", "comment_2": "@Tr0llYouHard @MillenPolitics You could have at least included the \"Laguna Beach Antifa\" part...", "comment_1": "@0H0UR1 Zero-if you find time what’s the Real deal with these “Russian” Antifa accounts? Beverly Hills and laguna b… https://t.co/Hm2hGVpkNO", "split": "train", "label": "fake"}
{"comment_3": "BREAKING: Florida Moves For FULL RECOUNT Of State Over Massive Voter Fraud (DETAILS) https://t.co/wZfqdT6jYt via @Bipartisan Report", "article": "About Trendolizer™\n\nTrendolizer™ (patent pending) automatically scans the internet for trending content. The website you are looking at has no human editors at all: links to trending stories are automatically posted from a selection of the data Trendolizer™ picked up. If you are interested in using the Trendolizer™ engine, dashboard or API for your own projects, more information is available at get.trendolizer.com . Trendolizer™ is owned by Lead Stories LLC\n\nPrivacy policy\n\nThis site uses cookies to track user behaviour on this site, without linking to personally identifiable data. Advertisers may also use cookies, but the scope and nature of this use is beyond our control.", "comment_2": "BREAKING: Florida Moves For FULL RECOUNT Of State Over Massive Voter Fraud (DETAILS) https://t.co/SOWX6m35dP", "comment_1": "BREAKING: Florida Moves For FULL RECOUNT Of State Over Massive Voter Fraud (DETAILS) https://t.co/2MTtAjAMRs via @Bipartisan Report", "split": "train", "label": "fake"}
{"comment_3": "If You Are Using This Toothpaste… Throw It Away Immediately! https://t.co/wE3q3ge4yv", "article": "We'll send you an email that you can review, edit and forward from your own email application...\n\nWhere should we send the email?", "comment_2": "BREAKING: If You Are Using This Toothpaste… Throw It Away Immediately! https://t.co/Xc6TqDow4H via @Woman Daily Tips", "comment_1": "If You Are Using This Toothpaste… Throw It Away Immediately! #Topbuzz https://t.co/V1N8VvxUKN", "split": "train", "label": "fake"}
{"comment_3": "Trump wants to deport American Indians to India https://t.co/wJOId6EyDM", "article": "Washington (dpo) – As part of his plan to improve national security and combat illegal immigration, US President Donald Trump intends to send around 3 million American Indians back to where they came from – India. He is to sign an executive order to this effect this week.\n\nIn an interview with Fox News, President Trump described Indians living in the USA as lawless warriors with a history of attacking and killing US citizens. He claimed, “I’ve seen it in all kinds of TV documentaries. Horrible attacks on good Americans using hatchets or bows and arrows. You can’t trust these Indians.”\n\nPresident Trump consulted with the appropriate members of the government and found that most Indians do not possess the relevant immigration documents. “That means they are here illegally. I had to act.”\n\nFurther criticism is to be found on the President’s Twitter account:\n\nHe also tweeted:\n\nThe White House has announced that Indians will be given a three month period in which to leave the country. India is to pay for their fli", "comment_2": "Trump wants to deport American Indians to India https://t.co/YIAFxNclZR", "comment_1": "Trump wants to deport American Indians to India https://t.co/uYQpNcSWJ9", "split": "train", "label": "fake"}
{"comment_3": "Democrats Announce  They Will Abolish ICE  If They Win 2020  Election https://t.co/iZPdW5eTno via @YouTube", "article": "The Democrats mulling a run for the White House in 2020 are facing intense pressure from liberals to campaign on abolishing the agency that enforces federal immigration laws, a proposal that was once relegated to the far-left fringe.\n\nIn protesting the Trump administration’s policies toward illegal immigration, liberal commentators and writers have been embracing the idea of gutting the U.S. Immigration and Customs Enforcement agency, which identifies, arrests and deports illegal immigrants inside the United States.\n\n“This is a growing position on the left, and I imagine 2020 Democratic presidential aspirants will have to grapple with it,” liberal writer and MSNBC host Chris Hayes tweeted.\n\nIn January, the idea was endorsed by Brian Fallon, a former top aide to 2016 Democratic nominee Hillary Clinton, and Eric Holder, President Barack Obama’s attorney general. The Daily Caller first drew attention to the calls.\n\n“ICE operates as an unaccountable deportation force,” Fallon tweeted. “Dems running in 2020 should", "comment_2": "DIMS GO HARD ON NATIONALISM:😡😡😡⁉️\nDemocrats Announce They Will Abolish ICE If They Win 2020 Election\nhttps://t.co/qgBBNCUoEU", "comment_1": "Democrats Announce They Will Abolish ICE If They Win 2020 Election https://t.co/jFwLvdIueN", "split": "train", "label": "fake"}
{"comment_3": "Michelle Obama Just Received Life Shattering News From The Doctor And It... https://t.co/Eg8tHbbf1u via @YouTube", "article": "Michelle Obama has been mostly laying low on one vacation after another since leaving the White House, only to emerge when she sees an opportunity to publicly slam President Donald Trump. A lot of questions have come up about the former first lady, starting when Barack Obama was still the president and continuing on now as the two live very separate lives. Although she’s desperately tried to hide the truth for months, a doctor has recently revealed what she has diagnosed her with which confirms our suspicions as well as our fears.\n\nMany have felt that Michelle’s behavior in the final months of being the first lady was strange, even for her, and has only gotten more alarming since the arrogant woman left the White House, but perpetually tries to remain as the center of everyone’s attention. Much of the country is happy to have her and her husband out of politics and wish that she’d slip into obscurity, but she refuses. Now we know why.\n\nMichelle’s hate for America seemed to become more obvious as the grip of p", "comment_2": "BREAKING NEWS TODAY, Michelle Obama Just Received LIFE-SHATTERING News From The Doctor. #BuzzVideo https://t.co/5U90DYGJcC", "comment_1": "I liked a @YouTube video https://t.co/B0fAQ8cac7 Michelle Obama Just Received LIFE-SHATTERING News From The Doctor", "split": "train", "label": "fake"}
{"comment_3": "Putin Issues International Arrest Warrant for Rothschild &amp; Soros https://t.co/AJoYvZXpwC via @saul42", "article": "George Soros—the Billionaire investment banker who has admitted to manipulating the financial markets in Asia, the UK, Greece, and Russia has finally gone too far.\n\nYou see Mr. Soros has become persona non grata across the globe for his role in destabilizing country’s economy’s and financial markets. He does so for the sole intent of lining his own pockets at the expense of others.\n\nGeorge Soros now lives in the United States and has been involved in many of the anti-Trump protests around the country. He has paid salaries and housing for many of the leaders of Black Lives Matters group, in addition to paying young people to protest Donald Trump in multiple big cities across the U.S.\n\nHe has done this before in different countries throughout Europe and Asia. Basically, he causes massive financial chaos in a country, cashes in on it, and moves to the next one.\n\nRussia was once a victim of his demented financial upheaval. Back in the ‘90’s he wrote a letter that besmirched the Russian currency and said it was ov", "comment_2": "Vladimir Putin: Russia Issues International Arrest Warrant For Rothschild &amp; Soros!  https://t.co/NXnlg8bjWS", "comment_1": "BREAKING: PUTIN ISSUES INTERNATIONAL ARREST WARRANT FOR GEORGE SOROS … DEAD OR ALIVE ! https://t.co/sHgBv4J9WU https://t.co/PLVJBpJk8q", "split": "train", "label": "fake"}
{"comment_3": "Thanx to all who've taken part in our Boro' Creative Sector Study. We'd like to build up our evidence. A new survey… https://t.co/xdzdmGn7Iv", "article": "Mental Images\n\n“My pictures ask where does the truth end and the lies begin…where the subjective triumphs over the objective.”\n\nAlison Jackson is renown for her explorations into how photography and the cult of the celebrity have transformed our relationship to what is ‘real’. Her notorious photographic portraits, life-like sculptures, films and videos are startlingly realistically staged affairs that cast uncannily styled actors into an entirely fathomable projection of a future that could have been; or the intimate, often salacious, imagined private moments of media icons such as Diana Princess of Wales, the Queen of England, Marilyn Monroe, George Bush, Brad and Angelina, and David Beckham. Jackson’s productions stress-test the implicit belief that a photograph can capture a frozen moment of ‘truth’.\n\n‘At best, a photograph of a celebrity reproduces something authentic only at the very moment the shutter clicks’ says the artist ‘yet we have been teased into giving these moments an absolute and unquestioned", "comment_2": "TNS estimated in Nov 15 that ave social network user 16-24-y/o accessed 5 social platforms weekly - https://t.co/N6J4NKyBe2 via @eMarketer", "comment_1": "Accused obtained Driver's confession thru HC order in June '16, yet @charulpshah had \"accessed\" it in Nov'15 😳 https://t.co/QX08DqUDnM", "split": "train", "label": "fake"}
{"comment_3": "Southwest Airlines celebrating 50th anniversary by providing 2 free tickets to everyone! https://t.co/Ca6D5BdYtu", "article": "Like · Comment · Share\n\n12,068 others like this\n\nView more comments 50 of 80,312\n\nJust Now · Like\n\nJust Now · Like\n\nEunice Garza Oh yeah! Going to london With my Friend #Juillet\n\nBryan Odum It was busy at Southwest Airlines counter today. It seems that many people have won these Tickets.\n\nJust Now · Like", "comment_2": "Southwest Airlines celebrating 50th anniversary by providing 2 free tickets to everyone! https://t.co/hCirmNNFjh", "comment_1": "Southwest Airlines celebrating 50th anniversary by providing 2 free tickets to everyone! https://t.co/0b3Oq3e53O", "split": "train", "label": "fake"}
{"comment_3": "Virginia Republican Wants Schools To Check Children’s Genitals Before Using Bathroom - https://t.co/8EPOC83yWC", "article": "Republican attacks on transgendered Americans and the religious fight to keep gender a binary delineation took a turn for the bizarre this week when Virginia Republican Mark Cole filed a bill that would force schools to check the genitals of their students in order to ensure that they are using facilities reserved for their “anatomical sex:”\n\nLocal school boards shall develop and implement policies that require every school restroom, locker room, or shower room that is designated for use by a specific gender to solely be used by individuals whose anatomical sex matches such gender designation. Such policies may also provide that a student may, upon request, be granted access, to the extent reasonable, to a single stall restroom or shower, a unisex bathroom, or controlled individual use of a restroom, locker room, or shower. Any student who willfully and knowingly violates this section shall be liable for a civil penalty not to exceed $50. Civil penalties assessed under this section shall be paid into the Lite", "comment_2": "Virginia Republican Wants Schools To Check Children’s Genitals Before Using Bathroom - https://t.co/l5PQVJmKI4", "comment_1": "Virginia Republican Wants Schools To Check Children’s Genitals Before Using Bathroom - https://t.co/HZzbkIumU2", "split": "train", "label": "fake"}
{"comment_3": "“FOX Network Picks Up ‘Roseanne,’ Saying It Has No Problem With Occasional Racism” by @AllanIshacNYC https://t.co/1Blb9eWBAB", "article": "After ABC cancels Roseanne Barr’s hit show in response to her stunning racist tweet, the network of bigots comes to the rescue.\n\nAdvertisement – story continues below\n\nJust hours after ABC canceled its hit sitcom “Roseanne” due to an ugly racist tweet by its controversial star, Roseanne Barr, the Fox Network said it would be picking up the show.\n\n“We’re excited to announce that ‘Roseanne’ will be coming to Fox this fall,” said Brian Sullivan, Fox Networks Group president and COO. “The controversy regarding Ms. Barr’s racially charged Twitter message, as well as her bigoted attitudes, are just some of the reasons we’re happy to welcome her to the Fox family. And we know our audience of narrow-minded, unsophisticated bumpkins will welcome her just as enthusiastically.”\n\nIn her vulgar post, Ms. Barr wrote that Valerie Jarrett, an African-American adviser to President Barack Obama, was the offspring of the “muslim brotherhood & planet of the apes.” The abhorrent tweet met with immediate condemnation on social med", "comment_2": "FOX Network Picks Up 'Roseanne,' Saying It Has No Problem With Occasional Racism - Medium https://t.co/aZSWBpwh1B via @nuzzel", "comment_1": "FOX Network Picks Up ‘Roseanne,’ Saying It Has No Problem With Occasional Racism https://t.co/c6H5QvdWGW", "split": "train", "label": "fake"}
{"comment_3": "All Citizens Who Want to Receive Gvt Benefits Must Agree to Be Microchipped in the Near Future https://t.co/ATEVJFZ7XT", "article": "(Natural News) Late last month, it was reported that a Wisconsin company called Three Square Market was planning on surgically implanting microchips underneath the skin of its employees for convenience purposes.\n\nThree Square Market CEO Todd Westby told KSTP, the Twin Cities ABC affiliate station, that the microchip implants are “the next big thing that’s inevitably going to happen, and we want to be a part of it.”\n\nWestby explained that the microchip would be capable of doing a number of different things, from allowing people to purchase food in the break room by simply scanning their hand, to serving as an electronic key to open doors and access computers.\n\nThe microchips use Radio Frequency Identification technology (RFID) to function, which also happens to be the technology used when you pay for items using your iPhone or Android device.\n\n“We foresee the use of RFID technology to drive everything from making purchases in our office break room market, opening doors, use of copy machines, logging into our o", "comment_2": "All Citizens Who Want to Receive Gvt Benefits Must Agree to Be Microchipped in the Near Future https://t.co/CfoxkPVZ7b", "comment_1": "All Citizens Who Want to Receive Gvt Benefits Must Agree to Be Microchipped in the Near Future https://t.co/nueOSy9SBg", "split": "train", "label": "fake"}
{"comment_3": "MUSLIMS OFFENDED THAT THEIR KIDS HAVE TO RECITE NATIONAL ANTHEM, CLAIM IT’S RACIST TO FORCE THEM TO… - https://t.co/ua48R8qynC", "article": "Wouldn’t it be novel approach to do a story on what doesn’t offend Muslims? Perhaps then we could figure out why they’re risking their lives entering both America and European countries if “western culture” offends them so!\n\nAccording to Islamic activist group, Hizb-ut-Tahrir, which is campaigning against Australia because they believe the country, is enforcing democratic values and a “disputed view” of history which contradicts Islamic beliefs.\n\n“Requiring schoolchildren to sing the national anthem, and the citizenship pledge supporting democratic values, are a part of an oppressive campaign by Australian authorities of ‘forced assimilation’ of the Muslim community.”\n\nHizb-ut-Tahrir spokesmen, Unthman Badar said; Well, if there’s one culture that knows a thing or two about “forced assimilation” it would be Islam.\n\nHe continued; “That this supposed oppression is due to an “exaggerated fear of a security threat”.\n\nObviously when “documented events” of world-wide terrorism inflicted within the last 2-decades ha", "comment_2": "MUSLIMS OFFENDED THAT THEIR KIDS HAVE TO RECITE NATIONAL ANTHEM, CLAIM IT’S RACIST TO FORCE THEM TO… - https://t.co/UGz5pN2jFa", "comment_1": "MUSLIMS OFFENDED THAT THEIR KIDS HAVE TO RECITE NATIONAL ANTHEM, CLAIM IT’S RACIST TO FORCE THEM TO… https://t.co/R4nOxN0Y4D", "split": "train", "label": "fake"}
{"comment_3": "BREAKING: A Hollywood Star Is Moving To Canada Because Of President Trump - https://t.co/gpArS8hvGE via @Shareaholic.", "article": "Bryan Cranston and Donald Trump. Ilya S. Savenok; Gary Gershoff/Getty With Election Day close and a Donald Trump presidency appearing increasingly likely, some of Hollywood's left-leaning stars are preparing to emigrate to the country up north if things go sour for them.\n\n\"Breaking Bad\" actor Bryan Cranston is the latest celebrity to suggest that he would leave the US for Canada in the event of a Trump victory in Tuesday's election.\n\nHe joins the likes of Barbara Streisand, Chelsea Handler, and several others who are planning to cross the border into the land of liberal prime minister Justin Trudeau should Hillary Clinton lose.\n\nHere are 9 celebrities who say they'll move to Canada if Donald Trump becomes president:", "comment_2": "W/all hollywood stars moving to canada if @realDonaldTrump is elected prez we'll need to build wall btwn canada 2. #tcot #teaparty #foxnews", "comment_1": "What happened to all those Hollywood stars that said they were moving to Canada if trump became president? Did they… https://t.co/75pCbgiXqU", "split": "train", "label": "fake"}
